handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/**
*     Copyright (c) 2023, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g05x.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2023, Nations Technologies Inc. All rights reserved.
**/
#ifndef __N32G05X_H__
#define __N32G05X_H__

#ifdef __cplusplus
extern "C" {
#endif


/***  N32G05x_Library_Basic ***/

#if !defined HSE_VALUE
#define HSE_VALUE (8000000U) /* Value of the External oscillator in Hz */
#endif

#define HSI_VALUE   (8000000U) /* Value of the Internal oscillator in Hz*/
#define HSI_24M     (24000000U)   

#define LSI_VALUE (32000) /* Value of the Internal Low Speed oscillator in Hz*/


/** In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value **/
#define HSE_STARTUP_TIMEOUT ((uint16_t)0x1000U)  /* SYSCLK= 64M Time out for HSE start up */
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x0300U)  /* SYSCLK= 64M Time out for HSI start up */
#define LSI_STARTUP_TIMEOUT ((uint16_t)0x0300U)  /* SYSCLK= 64M Time out for LSI start up */

/** n32g05x Standard Peripheral Library version number **/
#define __n32g05x_STDPERIPH_VERSION_MAIN   (0x01U) /* [31:24] main version */
#define __n32g05x_STDPERIPH_VERSION_SUB1   (0x00U) /* [23:16] sub1 version */
#define __n32g05x_STDPERIPH_VERSION_SUB2   (0x00U) /* [15:8]  sub2 version */
#define __n32g05x_STDPERIPH_VERSION_RC     (0x00U) /* [7:0]  release candidate */
#define __n32g05x_STDPERIPH_VERSION        ( (__n32g05x_STDPERIPH_VERSION_MAIN << 24U)\
                                           |(__n32g05x_STDPERIPH_VERSION_SUB1 << 16U)\
                                           |(__n32g05x_STDPERIPH_VERSION_SUB2 << 8U)\
                                           |(__n32g05x_STDPERIPH_VERSION_RC))

/** Configuration of the Cortex-M0 Processor and Core Peripherals **/
#define __NVIC_PRIO_BITS          2U /* N32G05X uses 2 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0U /* Set to 1 if different SysTick Config is used */

/*** N32G05X Interrupt Number Definition ***/

typedef enum IRQn
{
    /** Cortex-M0 Processor Exceptions Numbers **/
    NonMaskableInt_IRQn         = -14,    /* 2 Non Maskable Interrupt                                */
    HardFault_IRQn              = -13,    /* 3 Cortex-M0 Hard Fault Interrupt                        */
    SVC_IRQn                    = -5,     /* 11 Cortex-M0 SV Call Interrupt                          */
    PendSV_IRQn                 = -2,     /* 14 Cortex-M0 Pend SV Interrupt                          */
    SysTick_IRQn                = -1,     /* 15 Cortex-M0 System Tick Interrupt                      */

    /** N32G05x specific Interrupt Numbers  **/
    WWDG_IRQn                   = 0,      /* Window WatchDog Interrupt                               */
    PVD_IRQn                    = 1,      /* PVD through EXTI Line 16 detect Interrupt               */
    RTC_IRQn                    = 2,      /* PVD through EXTI Line 17/18/19 detect Interrupt         */
    MMU_RAMC_ERR_IRQn           = 3,      /* MMU&RAM global Interrupt                                */
    FLASH_IRQn                  = 4,      /* FLASH Interrupt                                         */
    RCC_IRQn                    = 5,      /* RCC global Interrupt                                    */
    EXTI0_1_IRQn                = 6,      /* EXTI Line 0 and 1 Interrupts                            */
    EXTI2_3_IRQn                = 7,      /* EXTI Line 2 and 3 Interrupts                            */
    EXTI4_15_IRQn               = 8,      /* EXTI Line 4 to 15 Interrupts                            */
    SAC_IRQn                    = 9,      /* SAC global Interrupt                                    */
    DMA_CH1_2_IRQn              = 10,     /* DMA Channel 1/2 global Interrupt                        */
    DMA_CH3_4_5_IRQn            = 11,     /* DMA Channel 3/4/5 global Interrupt                      */
    TIM4_IRQn                   = 12,     /* TIM4 global Interrupt                                   */
    TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /* TIM1 Break, Update, Trigger and Commutation Interrupts  */
    TIM1_CC_IRQn                = 14,     /* TIM1 Capture Compare Interrupt                          */
    CAN_IRQn                    = 15,     /* CAN global Interrupt                                    */
    TIM3_IRQn                   = 16,     /* TIM3 global Interrupt                                   */
    UART3_4_IRQn                = 17,     /* UART3/4 global Interrupt                                */
    TIM5_IRQn                   = 18,     /* TIM5 global Interrupt                                   */
    TIM6_IRQn                   = 19,     /* TIM6 through EXTI Line 20 Interrupt                     */
    TIM2_IRQn                   = 20,     /* TIM2 global Interrupt                                   */
    ADC_IRQn                    = 21,     /* ADC global Interrupt                                    */
    SPI2_IRQn                   = 22,     /* SPI2 global Interrupt                                   */
    I2C1_IRQn                   = 23,     /* I2C1 global Interrupt                                   */
    I2C2_IRQn                   = 24,     /* I2C2 global Interrupt                                   */
    SPI1_IRQn                   = 25,     /* SPI1 global Interrupt                                   */
    UART1_IRQn                  = 26,     /* UART1 Interrupt                                         */
    SPI3_IRQn                   = 27,     /* SPI3 global Interrupt                                   */
    UART5_IRQn                  = 28,     /* UART5 global Interrupt                                  */
    LCD_IRQn                    = 29,     /* LCD global Interrupt                                    */
    UART2_IRQn                  = 30,     /* UART2 global Interrupt                                  */
    COMP1_2_3_4_IRQn            = 31      /* COMP1/2/3/4 Interrupt                                   */
} IRQn_Type;

#include "core_cm0.h"
#include "system_n32g05x.h"
#include <stdint.h>
#include <stdbool.h>

/* n32g05x Standard Peripheral Library old types (maintained for legacy purpose) */
typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /* Read Only */
typedef const int16_t sc16;  /* Read Only */
typedef const int8_t sc8;    /* Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

