handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
typedef __I int32_t vsc32;  /* Read Only */
typedef __I int16_t vsc16;  /* Read Only */
typedef __I int8_t vsc8;   /* Read Only */

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /* Read Only */
typedef const uint16_t uc16;  /* Read Only */
typedef const uint8_t uc8;   /* Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /* Read Only */
typedef __I uint16_t vuc16;  /* Read Only */
typedef __I uint8_t vuc8;   /* Read Only */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, INTStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/* n32g05x Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSEStartUp_TimeOut   HSE_STARTUP_TIMEOUT
#define HSE_Value            HSE_VALUE
#define HSI_Value            HSI_VALUE

/*** Analog to Digital Converter ***/
typedef struct
{
    __IO uint32_t STS;     	//0x00
    __IO uint32_t CTRL1;   	//0x04
    __IO uint32_t CTRL2;	//0x08
    __IO uint32_t CTRL3;	//0x0C
    __IO uint32_t SAMPT;	//0x10
    __IO uint32_t WDGHIGH;	//0x14
    __IO uint32_t WDGLOW;	//0x18
    __IO uint32_t DAT0;		//0x1C
    __IO uint32_t DAT1;		//0x20	
    __IO uint32_t DAT2;		//0x24
    __IO uint32_t DAT3;		//0x28
    __IO uint32_t DAT4;		//0x2C
} ADC_Module;


/*** CRC calculation unit ***/
typedef struct
{
    __IO uint32_t RESERVED0;	// 0x00	
    __IO uint32_t RESERVED1;	// 0x04
    __IO uint32_t RESERVED2;	// 0x08
    __IO uint32_t CRC16CTRL;	// 0x0C
    __IO uint8_t  CRC16DAT;		// 0x10
    uint8_t RESERVED3;			// 0x11
    uint16_t RESERVED4;			// 0x12
    __IO uint16_t CRC16D;		// 0x14
    uint16_t RESERVED5;			// 0x16
    __IO uint8_t LRC;			// 0x18
    uint8_t RESERVED6;			// 0x19
    uint16_t RESERVED7;			// 0x1A
} CRC_Module;



/***  External Interrupt/Event Controller ***/

typedef struct
{
   __IO uint32_t EMASK;   //0x00
   __IO uint32_t IMASK;   //0x04 
   __IO uint32_t FT_CFG;  //0x08
   __IO uint32_t RT_CFG;  //0x0C
   __IO uint32_t PEND;    //0x10
   __IO uint32_t SWIE;    //0x14
   __IO uint32_t TS_SEL;  //0x18
} EXTI_Module;

/*** FLASH Registers ***/

typedef struct
{
    __IO uint32_t AC;			//0x00
    __IO uint32_t KEY;			//0x04
    __IO uint32_t OPTKEY;		//0x08
    __IO uint32_t STS;			//0x0C
    __IO uint32_t CTRL;			//0x10
    __IO uint32_t ADD;			//0x14
    __IO uint32_t RESERVED0;	
    __IO uint32_t OB;			//0x1C
    __IO uint32_t WRP;			//0x20
    __IO uint32_t ECC;			//0x24
    __IO uint32_t RESERVED[8];
    __IO uint32_t USER;			//0x48
    __IO uint32_t START_ADD;	//0x4C
    __IO uint32_t VTOR;			//0x50
} FLASH_Module;

/*** Option Bytes Registers ***/

typedef struct
{
    __IO uint32_t RDP1;		//0x00
    uint32_t RESERVED0;
    __IO uint32_t USER1;	//0x08
    uint32_t RESERVED1;
    __IO uint32_t USER2;	//0x10
    uint32_t RESERVED2;
    __IO uint32_t USER3;	//0x18
    uint32_t RESERVED3;
    __IO uint32_t USER4;	//0x20
    uint32_t RESERVED4;
    __IO uint32_t USER5;	//0x28
    uint32_t RESERVED5;
    __IO uint32_t USER6;	//0x30
    uint32_t RESERVED6;
    __IO uint32_t Data0;	//0x38
    uint32_t RESERVED7;
    __IO uint32_t Data1;	//0x40
    uint32_t RESERVED8;
    __IO uint32_t WRP0;		//0x48
    uint32_t RESERVED9;
    __IO uint32_t WRP1;		//0x50
    uint32_t RESERVED10;
    __IO uint32_t WRP2;		//0x58
    uint32_t RESERVED11;
    __IO uint32_t WRP3;		//0x60
    uint32_t RESERVED12;
    __IO uint32_t RDP2;		//0x68
    uint32_t RESERVED13;
} OB_Module;

/** General Purpose I/O **/

typedef struct
{
    __IO uint32_t PMODE;	// 0x00
    __IO uint32_t POTYPE;	// 0x04
    __IO uint32_t SR;		// 0x08
    __IO uint32_t PUPD;		// 0x0C
    __IO uint32_t PID;		// 0x10
    __IO uint32_t POD;		// 0x14
    __IO uint32_t PBSC;		// 0x18
    __IO uint32_t PLOCK;	// 0x1C
    __IO uint32_t AFL;		// 0x20
    __IO uint32_t AFH;		// 0x24
    __IO uint32_t PBC;		// 0x28
    __IO uint32_t DS;		// 0x2C
} GPIO_Module;

/** Alternate Function I/O **/

typedef struct
{
    __IO uint32_t CFG;			// 0x00
	__IO uint32_t RESERVED0;	// 0x04
    __IO uint32_t EXTI_CFG[4];	// 0x08
    __IO uint32_t DIGEFT_CFG1;	// 0x18
    __IO uint32_t DIGEFT_CFG2;	// 0x1C
} AFIO_Module;



/***  Inter Integrated Circuit Interface ***/

typedef struct
{
  __IO uint32_t CTRL1;    //0x00
  __IO uint32_t CTRL2;    //0x04
  __IO uint16_t OADDR1;   //0x08
  uint16_t  RESERVED2;
  __IO uint16_t OADDR2;   //0x0C
  uint16_t  RESERVED3;
  __IO uint16_t DAT;      //0x10
  uint16_t  RESERVED4;
  __IO uint32_t STS1;     //0x14
  __IO uint32_t STS2;     //0x18
  __IO uint16_t CLKCTRL;  //0x1C
  uint16_t  RESERVED7;
  __IO uint16_t TMRISE;   //0x20
  uint16_t  RESERVED8;
  __IO uint16_t BYTENUM;  //0x24
  uint16_t  RESERVED9;
  __IO uint16_t GFLTRCTRL;//0x28
  uint16_t  RESERVED10;
} I2C_Module;


/***  Beeper  ***/

typedef struct
{
  __IO uint32_t CTRL;	// 0x00
} BEEPER_Module;


/*** Independent watchdog ***/

typedef struct
{
  __IO uint32_t KEY;		// 0x00
  __IO uint32_t PREDIV;		// 0x04
  __IO uint32_t RELV;		// 0x08
  __IO uint32_t STS;		// 0x0C
  __IO uint32_t FREEZE;		// 0x10
} IWDG_Module;

/*** Power Control ***/
typedef struct
{
    __IO uint32_t CTRL;      //0x00
    __IO uint32_t CTRLSTS;   //0x04
    __IO uint32_t CTRL2;     //0x08
    uint32_t      RESERVED0;
    uint32_t      RESERVED1;
    __IO uint32_t CTRL3;     //0x14
    uint32_t      RESERVED2;
    uint32_t      RESERVED3;
    __IO uint32_t CTRL4;     //0x20
    __IO uint32_t CTRL5;     //0x24
    __IO uint32_t CTRL6;     //0x28
    uint32_t      RESERVED4;
    __IO uint32_t DBG_CTRL;  //0x30
} PWR_Module;

/*** Reset and Clock Control ***/

typedef struct
{
    __IO uint32_t CTRL;       //0x00
    __IO uint32_t CFG;        //0x04
    __IO uint32_t CLKINT;     //0x08
    __IO uint32_t APB2PRST;   //0x0C
    __IO uint32_t APB1PRST;   //0x10
    __IO uint32_t AHBPCLKEN;  //0x14
    __IO uint32_t APB2PCLKEN; //0x18
    __IO uint32_t APB1PCLKEN; //0x1C
    __IO uint32_t LSCTRL;     //0x20
    __IO uint32_t CTRLSTS;    //0x24
    __IO uint32_t AHBPRST;    //0x28
    __IO uint32_t CFG2;       //0x2C
    __IO uint32_t CFG3;       //0x30
    __IO uint32_t EMCCTRL;    //0x34
} RCC_Module;


/*** COMP_Single ***/
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t FILC;
    __IO uint32_t FILP;
    uint32_t RESERVED;
} COMP_SingleType;

/*** compare ***/

typedef struct
{
    __IO uint32_t res0[4];	//0x00
    COMP_SingleType COMP1;	//0x10
    COMP_SingleType COMP2;	//0x20
    COMP_SingleType COMP3;	//0x30
    COMP_SingleType COMP4;	//0x40
    __IO uint32_t res1[8];	
    __IO uint32_t OSEL;		//0x70
    __IO uint32_t res2[4];
    __IO uint32_t LOCK;		//0x84
    __IO uint32_t res3;		//0x88
    __IO uint32_t INTEN;	//0x8C
    __IO uint32_t INTSTS;	//0x90
    __IO uint32_t VREFSCAL;	//0x94
    __IO uint32_t TIM_OSEL; //0x98
} COMP_Module;



