handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/*** Serial Peripheral Interface ***/
typedef struct
{
    __IO uint32_t CTRL1;   // 0x00
    __IO uint32_t CTRL2;   // 0x04
    __IO uint32_t STS;     // 0x08
    __IO uint32_t DAT;     // 0x0C
    __IO uint32_t CRCTDAT; // 0x10
    __IO uint32_t CRCRDAT; // 0x14
    __IO uint32_t CRCPOLY; // 0x18
    __IO uint32_t RESERVED0[7]; // 0x1C
    __IO uint32_t CTRL3;   // 0x38
} SPI_Module;


/*** TIM ***/

typedef struct
{
    __IO uint32_t CTRL1;  // 0x00
    __IO uint32_t CTRL2;  // 0x04
    __IO uint32_t STS;    // 0x08
    __IO uint32_t EVTGEN; // 0x0C
    __IO uint32_t SMCTRL; // 0x10
    __IO uint32_t DINTEN; // 0x14
    __IO uint32_t CCMOD1; // 0x18
    __IO uint32_t CCMOD2; // 0x1C
    __IO uint32_t CCMOD3; // 0x20
    __IO uint32_t CCEN;   // 0x24
    __IO uint32_t CCDAT1; // 0x28
    __IO uint32_t CCDAT2; // 0x2C
    __IO uint32_t CCDAT3; // 0x30
    __IO uint32_t CCDAT4; // 0x34
    __IO uint32_t CCDAT5; // 0x38
    __IO uint32_t CCDAT6; // 0x3C
    __IO uint32_t PSC;    // 0x40
    __IO uint32_t AR;     // 0x44
    __IO uint32_t CNT;    // 0x48
    __IO uint32_t REPCNT; // 0x4C
    __IO uint32_t BKDT;   // 0x50
    __IO uint32_t CCDAT7; // 0x54
    __IO uint32_t CCDAT8; // 0x58
    __IO uint32_t CCDAT9; // 0x5C
    __IO uint32_t BKFR;   // 0x60
    __IO uint32_t C1FILT; // 0x64
    __IO uint32_t C2FILT; // 0x68
    __IO uint32_t C3FILT; // 0x6C
    __IO uint32_t C4FILT; // 0x70
    __IO uint32_t FILTO;  // 0x74
    __IO uint32_t INSEL;  // 0x78
    uint32_t  RESERVED0;  // 0x7C
    uint32_t  RESERVED1;  // 0x80
    uint32_t  RESERVED2;  // 0x84
    uint32_t  RESERVED3;  // 0x88
    uint32_t  RESERVED4;  // 0x9C
    uint32_t  RESERVED5;  // 0x90
    __IO uint32_t DCTRL;  // 0x94
    __IO uint32_t DADDR;  // 0x98
} TIM_Module;



/*** Universal Asynchronous Receiver Transmitter ***/
typedef struct
{
    __IO uint32_t CTRL1;  // 0x00
    __IO uint32_t CTRL2;  // 0x04
    __IO uint32_t CTRL3;  // 0x08
    __IO uint32_t STS;    // 0x0C
    __IO uint32_t DAT;    // 0x10
    __IO uint32_t BRCF;   // 0x14
    __IO uint32_t GTP;    // 0x18
} UART_Module;


/*** Controller Area Network TxMailBox ***/

typedef struct
{
    __IO uint32_t TMI;  //0x180, 0x190, 0x1A0
    __IO uint32_t TMDT;	//0x184, 0x194, 0x1A4
    __IO uint32_t TMDL;	//0x188, 0x198, 0x1A8
    __IO uint32_t TMDH;	//0x18c, 0x19c, 0x1ac
} CAN_TxMailBox_Param;

/*** Controller Area Network FIFOMailBox ***/

typedef struct
{
    __IO uint32_t RMI;	//0x1B0, 0x1C0
    __IO uint32_t RMDT;	//0x1B4, 0x1C4
    __IO uint32_t RMDL;	//0x1B8, 0x1C8
    __IO uint32_t RMDH;	//0x1BC, 0x1CC
} CAN_FIFOMailBox_Param;

/*** Controller Area Network FilterRegister ***/

typedef struct
{
    __IO uint32_t FR1;		//0x240h
    __IO uint32_t FR2;		//0x31C
} CAN_FilterRegister_Param;

/*** Controller Area Network ***/

typedef struct
{
    __IO uint32_t MCTRL;	//0x00
    __IO uint32_t MSTS;		//0x04
    __IO uint32_t TSTS;		//0x08
    __IO uint32_t RFF0;		//0x0C
    __IO uint32_t RFF1;		//0x10
    __IO uint32_t INTE;		//0x14
    __IO uint32_t ESTS;		//0x18
    __IO uint32_t BTIM;		//0x1C
    uint32_t RESERVED0[88];
    CAN_TxMailBox_Param sTxMailBox[3];
    CAN_FIFOMailBox_Param sFIFOMailBox[2];
    uint32_t RESERVED1[12];
    __IO uint32_t FMC;		//0x200
    __IO uint32_t FM1;		//0x204
    uint32_t RESERVED2;
    __IO uint32_t FS1;		//0x20C
    uint32_t RESERVED3;
    __IO uint32_t FFA1;		//0x214
    uint32_t RESERVED4;
    __IO uint32_t FA1;		//0x21C
    uint32_t RESERVED5[8];
    CAN_FilterRegister_Param sFilterRegister[14];
} CAN_Module;


/*** Real-Time Clock ***/

/**  Real-Time Clock **/

typedef struct
{
    __IO uint32_t INITSTS;  // 0x00
    __IO uint32_t CTRL;     // 0x04
    __IO uint32_t TSH;    	// 0x08  
    __IO uint32_t DATE;   	// 0x0C  
    __IO uint32_t WRP; 		// 0x10    
    __IO uint32_t SCTRL; 	// 0x14   
    __IO uint32_t SUBS;		// 0x18
    __IO uint32_t TST;		// 0x1C
    __IO uint32_t ALARMA;	// 0x20 
    __IO uint32_t PRE;		// 0x24
    __IO uint32_t ALARMB;	// 0x28
    __IO uint32_t WKUPT;	// 0x2C
    __IO uint32_t TMPCFG; 	// 0x30
    __IO uint32_t ALRMASS;	// 0x34
    __IO uint32_t OPT;		// 0x38
    __IO uint32_t ALRMBSS;	// 0x3C
    __IO uint32_t CALIB;	// 0x40
    __IO uint32_t TSSS;		// 0x44
    __IO uint32_t TSD;		// 0x48
} RTC_Module;

/*** Window WATCHDOG ***/

typedef struct
{
    __IO uint32_t CTRL;		// 0x00
    __IO uint32_t CFG;		// 0x04
    __IO uint32_t STS;		// 0x08
} WWDG_Module;

/*** DMA Controller ***/
typedef struct
{
    __IO uint32_t CHCFG;		//0x08+20 * (x-1)
    __IO uint32_t TXNUM;		//0x0c+20 * (x-1)
    __IO uint32_t PADDR;		//0x10+20 * (x-1)
    __IO uint32_t MADDR;		//0x14+20 * (x-1)
    __IO uint32_t CHSEL;		//0x18+20 * (x-1)
} DMA_ChannelType;

typedef struct
{
    __IO uint32_t INTSTS;					//0x00
    __IO uint32_t INTCLR;					//0x04
    __IO DMA_ChannelType DMA_Channel[5];
} DMA_Module;


/*** DAC ***/
typedef struct
{
    __IO uint32_t CTRL;		//0x00
    __IO uint32_t SOTTR;	//0x04
    __IO uint32_t DATO;		//0x08
    __IO uint32_t DH8RA;	//0x0C	
    __IO uint32_t DH12LA;	//0x10
    __IO uint32_t DH12RA;	//0x14
} DAC_Module;

/*** LCD ***/
typedef struct
{
    __IO uint32_t CTRL; 		//0x00   
    __IO uint32_t FCTRL;  	//0x04  
    __IO uint32_t STS;      //0x08
    __IO uint32_t CLR;  		//0x0C 
    uint32_t RESERVED;     
    __IO uint32_t RAM_COM[16];     //0x14 + x*4
} LCD_Module;

/*** SAC ***/
typedef struct
{
    uint32_t RESERVED;     
} SAC_Module;


/*** Peripheral memory map ***/

#define FLASH_BASE            ((uint32_t)0x08000000U) /* FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000U) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000U) /* Peripheral base address in the alias region */

#define UCID_BASE             ((uint32_t)0x1FFFF8D0U) /* UCID Address : 0x1FFF_F8D0 */
#define UCID_LENGTH           ((uint32_t)0x10U)       /* UCID Length  : 16 Bytes */
#define UID_BASE              ((uint32_t)0x1FFFF910U) /* UID Address  : 0x1FFF_F910 */
#define UID_LENGTH            ((uint32_t)0x0CU)       /* UID Length   : 12 Bytes */
#define DBGMCU_ID_BASE        ((uint32_t)0x1FFFF920U) /* DBGMCU_ID Address :0x1FFF_F920 */
#define DBGMCU_ID_LENGTH      ((uint8_t)0x04U)         /* DBGMCU_ID Length : 4 Bytes */


/** Peripheral memory map **/
#define APB1PERIPH_BASE       (PERIPH_BASE)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000U)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000U)

/** APB1 **/
#define BEEPER_BASE           (APB1PERIPH_BASE + 0x0000U)
#define UART3_BASE            (APB1PERIPH_BASE + 0x0400U)
#define UART4_BASE            (APB1PERIPH_BASE + 0x0800U)
#define UART5_BASE            (APB1PERIPH_BASE + 0x0C00U)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000U)
#define CAN_BASE              (APB1PERIPH_BASE + 0x1C00U)
#define DAC_BASE              (APB1PERIPH_BASE + 0x2000U)
#define COMP_BASE             (APB1PERIPH_BASE + 0x2400U)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800U)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00U)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000U)
#define LCD_BASE              (APB1PERIPH_BASE + 0x3C00U)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400U)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800U)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000U)

/** APB2 **/
#define AFIO_BASE             (APB2PERIPH_BASE + 0x0000U)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400U)
#define GPIOA_BASE            (APB2PERIPH_BASE + 0x0800U)
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x0C00U)
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x1000U)
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x1C00U)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x2000U)
#define TIM4_BASE             (APB2PERIPH_BASE + 0x2400U)
#define TIM5_BASE             (APB2PERIPH_BASE + 0x2800U)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00U)
#define TIM3_BASE             (APB2PERIPH_BASE + 0x3000U)
#define TIM2_BASE             (APB2PERIPH_BASE + 0x3400U)
#define UART1_BASE            (APB2PERIPH_BASE + 0x3800U)
#define UART2_BASE            (APB2PERIPH_BASE + 0x3C00U)
#define SPI3_BASE             (APB2PERIPH_BASE + 0x4000U)
#define SPI2_BASE             (APB2PERIPH_BASE + 0x4400U)


/** AHB **/
#define DMA_BASE              (AHBPERIPH_BASE + 0x0000U)
#define DMA_CH1_BASE          (AHBPERIPH_BASE + 0x0008U)
#define DMA_CH2_BASE          (AHBPERIPH_BASE + 0x001CU)
#define DMA_CH3_BASE          (AHBPERIPH_BASE + 0x0030U)
#define DMA_CH4_BASE          (AHBPERIPH_BASE + 0x0044U)
#define DMA_CH5_BASE          (AHBPERIPH_BASE + 0x0058U)
#define ADC_BASE              (AHBPERIPH_BASE + 0x0800U)
#define RCC_BASE              (AHBPERIPH_BASE + 0x1000U)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000U) /* Flash registers base address */
#define OB_BASE               ((uint32_t)0x1FFFFC00U)    /* Flash Option Bytes base address */
#define CRC_BASE              (AHBPERIPH_BASE + 0x3000U)
#define SAC_BASE              (AHBPERIPH_BASE + 0x4000U)
#define SAC_SRAM512B_BASE     (AHBPERIPH_BASE + 0x4400U)

/** Peripheral_declaration **/
#define BEEPER              ((BEEPER_Module *) BEEPER_BASE)
#define UART3               ((UART_Module *) UART3_BASE)
#define UART4               ((UART_Module *) UART4_BASE)
#define UART5               ((UART_Module *) UART5_BASE)
#define TIM6                ((TIM_Module *) TIM6_BASE)
#define CAN                 ((CAN_Module *) CAN_BASE)
#define DAC                 ((DAC_Module *) DAC_BASE)
#define COMP                ((COMP_Module *) COMP_BASE)
#define RTC                 ((RTC_Module *) RTC_BASE)
#define WWDG                ((WWDG_Module *) WWDG_BASE)
#define IWDG                ((IWDG_Module *) IWDG_BASE)
#define LCD                 ((LCD_Module *) LCD_BASE)
#define I2C1                ((I2C_Module *) I2C1_BASE)
#define I2C2                ((I2C_Module *) I2C2_BASE)
#define PWR                 ((PWR_Module *) PWR_BASE)

#define AFIO                ((AFIO_Module *) AFIO_BASE)
#define EXTI                ((EXTI_Module *) EXTI_BASE)
#define GPIOA               ((GPIO_Module *) GPIOA_BASE)
#define GPIOB               ((GPIO_Module *) GPIOB_BASE)
#define GPIOC               ((GPIO_Module *) GPIOC_BASE)
#define GPIOD               ((GPIO_Module *) GPIOD_BASE)
#define SPI1                ((SPI_Module *) SPI1_BASE)
#define TIM4                ((TIM_Module *) TIM4_BASE)
#define TIM5                ((TIM_Module *) TIM5_BASE)
#define TIM1                ((TIM_Module *) TIM1_BASE)
#define TIM3                ((TIM_Module *) TIM3_BASE)
#define TIM2                ((TIM_Module *) TIM2_BASE)
#define UART1               ((UART_Module *) UART1_BASE)
#define UART2               ((UART_Module *) UART2_BASE)
#define SPI3                ((SPI_Module *) SPI3_BASE)
#define SPI2                ((SPI_Module *) SPI2_BASE)

#define DMA                 ((DMA_Module *)DMA_BASE)
#define DMA_CH1             ((DMA_ChannelType*)DMA_CH1_BASE)
#define DMA_CH2             ((DMA_ChannelType*)DMA_CH2_BASE)
#define DMA_CH3             ((DMA_ChannelType*)DMA_CH3_BASE)
#define DMA_CH4             ((DMA_ChannelType*)DMA_CH4_BASE)
#define DMA_CH5             ((DMA_ChannelType*)DMA_CH5_BASE)
#define ADC                 ((ADC_Module *) ADC_BASE)
#define RCC                 ((RCC_Module *) RCC_BASE)
#define FLASH               ((FLASH_Module *) FLASH_R_BASE)
#define OBT                 ((OB_Module *) OB_BASE)
#define CRC                 ((CRC_Module *) CRC_BASE)
#define SAC                 ((SAC_Module *) SAC_BASE)


/***  Peripheral Registers_Bits_Definition   ***/

