handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/*** CRC calculation unit ***/
/** Bit definition for CRC_CRC16CTRL register **/
#define CRC16_CTRL_ENDHL    ((uint8_t)0x02U)
#define CRC16_CTRL_LITTLE   ((uint8_t)0x02U)
#define CRC16_CTRL_BIG      ((uint8_t)0xFDU)

#define CRC16_CTRL_CLR      ((uint8_t)0x04U) 
#define CRC16_CTRL_RESET    ((uint8_t)0x04U)
#define CRC16_CTRL_NO_RESET ((uint8_t)0xFBU)

/** Bit definition for CRC_CRC16DAT register **/
#define CRC16_CRC16DAT      ((uint8_t)0xFFU)

/** Bit definition for CRC_CRC16D register **/
#define CRC16_CRC16D        ((uint16_t)0xFFFFU)


/*** Power Control ***/
/** Bit definition for PWR_CTRL register **/
#define PWR_CTRL_IWDGRSTEN ((uint32_t)0x00000001U) /* IWDG reset request causes a system reset */
#define PWR_CTRL_PDSTP     ((uint32_t)0x00000002U) /* 0: CPU output DEEPSLEEP is 1, and the chip enters STOP mode, */
                                                                      /* 1: CPU output DEEPSLEEP is 1, and the chip enters PD mode */
#define PWR_CTRL_CLRWKUPF  ((uint32_t)0x00000004U) /* Clear Wakeup Flag */
#define PWR_CTRL_CLRDBGPDF ((uint32_t)0x00000008U) /* Clear DBGPDF flag */
#define PWR_CTRL_PVDEN     ((uint32_t)0x00000010U) /* PVD Enables control */

#define PWR_CTRL_PLS       ((uint32_t)0x000001E0U) /* PLS[3:0] bits (PVD Level Selection) */
#define PWR_CTRL_PLS_0     ((uint32_t)0x00000020U) /* Bit 0 */
#define PWR_CTRL_PLS_1     ((uint32_t)0x00000040U) /* Bit 1 */
#define PWR_CTRL_PLS_2     ((uint32_t)0x00000080U) /* Bit 2 */
#define PWR_CTRL_PLS_3     ((uint32_t)0x00000100U) /* Bit 3 */

#define PWR_CTRL_PDRS      ((uint32_t)0x00000600U) /* PDRS[2:0] bits (VDDD PDR trigger level in STOP mode) */
#define PWR_CTRL_PDRS_0    ((uint32_t)0x00000200U) /* Bit 0 */
#define PWR_CTRL_PDRS_1    ((uint32_t)0x00000400U) /* Bit 1 */

#define PWR_CTRL_NRSTPOL   ((uint32_t)0x00000800U) /* NRST polarity selection */

#define PWR_CTRL_PVDCNT    ((uint32_t)0x00FF0000) /* PVD count */
#define PWR_CTRL_PVDFILEN  ((uint32_t)0x01000000) /* Enable PVD filter */
#define PWR_CTRL_PVDITEN   ((uint32_t)0x02000000) /* Enable PVD interrupt */

/** Bit definition for PWR_CTRLSTS register **/
#define PWR_CTRLSTS_WKUPF   ((uint32_t)0x00000001U) /* Wakeup Flag */
#define PWR_CTRLSTS_DBGPDF  ((uint32_t)0x00000002U) /* DBGPDF Flag */
#define PWR_CTRLSTS_PVDO    ((uint32_t)0x00000004U) /* PVD Output */
#define PWR_CTRLSTS_WKUP0EN ((uint32_t)0x00000100U) /* Enable WKUP pin PA0 */
#define PWR_CTRLSTS_WKUP1EN ((uint32_t)0x00000200U) /* Enable WKUP pin PA2 */
#define PWR_CTRLSTS_WKUPPOL ((uint32_t)0x00000800U) /* Polarity of WKUP pin PA0/PA2,0:Falling edge,1:Rising edge */

/** Bit definition for PWR_CTRL2 register **/
#define PWR_CTRL2_LVRCNT   ((uint32_t)0x000000FFU) /* LVR filter control counts */
#define PWR_CTRL2_LVRFILEN ((uint32_t)0x00000100U) /* Enable LVR filter */
#define PWR_CTRL2_LVRRSTEN ((uint32_t)0x00000200U) /* Enable LVR reset */
#define PWR_CTRL2_LVREN    ((uint32_t)0x00000400U) /* Enable LVR */

#define PWR_CTRL2_LVRLS    ((uint32_t)0x00007800U) /* LVRLS[3:0] bits (LVR Level Selection) */
#define PWR_CTRL2_LVRLS_0  ((uint32_t)0x00000800U) /* Bit 0 */
#define PWR_CTRL2_LVRLS_1  ((uint32_t)0x00001000U) /* Bit 1 */
#define PWR_CTRL2_LVRLS_2  ((uint32_t)0x00002000U) /* Bit 2 */
#define PWR_CTRL2_LVRLS_3  ((uint32_t)0x00004000U) /* Bit 3 */

#define PWR_CTRL2_LVRO     ((uint32_t)0x00008000U) /* LVR Output */

#define PWR_CTRL2_LVRKEY   ((uint32_t)0xFF000000U) /* LVR key */

/** Bit definition for PWR_CTRL3 register **/
#define PWR_CTRL3_LSIEN      ((uint32_t)0x00000080U) /* Control PWR Enables the LSI */
#define PWR_CTRL3_PDRSEL     ((uint32_t)0x00000200U) /* VDDD PDR select signal is controlled by PWR */
#define PWR_CTRL3_NRSTCNT    ((uint32_t)0x07FF0000U) /* NRST filter control counts */
#define PWR_CTRL3_NRSTFILEN  ((uint32_t)0x08000000U) /* Enable NRST filter */

/** Bit definition for PWR_CTRL4 register **/
#define PWR_CTRL4_FLHWKUP ((uint32_t)0x00000001U) /* Flash quick Wake up */
#define PWR_CTRL4_STBFLH  ((uint32_t)0x00000002U) /* Flash Deep standby mode */
#define PWR_CTRL4_RUNF    ((uint32_t)0x00000004U) /* System in RUN mode */

/** Bit definition for PWR_CTRL5 register **/
#define PWR_CTRL5_STPMRSEL   ((uint32_t)0x0000000CU) /* STPMRSEL[1:0] bits (After enter STOP mode, VDDD output voltage select) */
#define PWR_CTRL5_STPMRSEL_0 ((uint32_t)0x00000004U) /* Bit 0 */
#define PWR_CTRL5_STPMRSEL_1 ((uint32_t)0x00000008U) /* Bit 1 */

/** Bit definition for PWR_CTRL6 register **/
#define PWR_CTRL6_STPMREN   ((uint32_t)0x0000000CU) /* STPMREN[1:0] bits (After enter STOP mode, Enable VDDD output voltage select) */
#define PWR_CTRL6_STPMREN_0 ((uint32_t)0x00000004U) /* Bit 0 */
#define PWR_CTRL6_STPMREN_1 ((uint32_t)0x00000008U) /* Bit 1 */

/** Bit definition for DBG_CTRL register **/
#define DBG_CTRL_SLEEP      ((uint32_t)0x00000001U) /* Debug SLEEP mode control */
#define DBG_CTRL_STOP       ((uint32_t)0x00000002U) /* Debug STOP mode control */
#define DBG_CTRL_PD         ((uint32_t)0x00000004U) /* Debug PD mode control */
#define DBG_CTRL_IWDGSTP    ((uint32_t)0x00000100U) /* Debug IWDG mode control */
#define DBG_CTRL_WWDGSTP    ((uint32_t)0x00000200U) /* Debug WWDG mode control */
#define DBG_CTRL_TIM1STP    ((uint32_t)0x00000400U) /* Debug TIM1 mode control */
#define DBG_CTRL_TIM3STP    ((uint32_t)0x00001000U) /* Debug TIM3 mode control */
#define DBG_CTRL_CANSTP     ((uint32_t)0x00004000U) /* Debug CAN mode control */
#define DBG_CTRL_I2C1TIMOUT ((uint32_t)0x00008000U) /* Debug I2C1TIMOUT mode control */
#define DBG_CTRL_I2C2TIMOUT ((uint32_t)0x00010000U) /* Debug I2C2TIMOUT mode control */
#define DBG_CTRL_TIM5STP    ((uint32_t)0x00020000U) /* Debug TIM5 mode control */
#define DBG_CTRL_TIM6STP    ((uint32_t)0x00040000U) /* Debug TIM6 mode control */
#define DBG_CTRL_TIM4STP    ((uint32_t)0x00080000U) /* Debug TIM4 mode control */
#define DBG_CTRL_TIM2STP    ((uint32_t)0x00100000U) /* Debug TIM2 mode control */


/*** Reset and Clock Control ***/

/** Bit definition for RCC_CTRL register **/

#define  RCC_CTRL_HSIEN      ((uint32_t)0x00000001U) /* Internal High Speed clock enable */
#define  RCC_CTRL_HSIRDF     ((uint32_t)0x00000002U) /* Internal High Speed 8M clock ready flag */
#define  RCC_CTRL_HSI24MRDF  ((uint32_t)0x00000004U) /* Internal High Speed 24M clock ready flag */
#define  RCC_CTRL_HSITRIM    ((uint32_t)0x000000F0U) /* Internal High Speed clock trimming */
#define  RCC_CTRL_HSEEN      ((uint32_t)0x00010000U) /* External High Speed clock enable */
#define  RCC_CTRL_HSERDF     ((uint32_t)0x00020000U) /* External High Speed clock ready flag */
#define  RCC_CTRL_HSEBP      ((uint32_t)0x00040000U) /* External High Speed clock bypass */
#define  RCC_CTRL_CLKSSEN    ((uint32_t)0x00080000U) /* Clock Security System enable */  

