handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define  RCC_CTRL_HSERDTIM         ((uint32_t)0x00300000U) /* External High Speed clock ready delay time */  
#define  RCC_CTRL_HSERDTIM_0_5MS   ((uint32_t)0x00000000U) /*  HSE Clock ready delay 0.5ms */  
#define  RCC_CTRL_HSERDTIM_1_0MS   ((uint32_t)0x00100000U) /*  HSE Clock ready delay 1.0ms */  
#define  RCC_CTRL_HSERDTIM_1_5MS   ((uint32_t)0x00200000U) /*  HSE Clock ready delay 1.5ms */  
#define  RCC_CTRL_HSERDTIM_2_5MS   ((uint32_t)0x00300000U) /*  HSE Clock ready delay 2.5ms */  

#define  RCC_CTRL_PLLBP      ((uint32_t)0x00400000U) /* PLL clock bypass */
#define  RCC_CTRL_PLLOUTEN   ((uint32_t)0x00800000U)    /* PLL clock out enable */
#define  RCC_CTRL_PLLEN      ((uint32_t)0x01000000U) /* PLL clock enable */
#define  RCC_CTRL_PLLRDF     ((uint32_t)0x02000000U) /* PLL clock ready flag */  
#define  RCC_CTRL_LKUPRSTEN  ((uint32_t)0x04000000U) /* M0 core lock up reset enabled */    


/** Bit definition for RCC_CFG register **/

/** SCLKSW configuration **/
#define RCC_CFG_SCLKSW      ((uint32_t)0x00000007U) /* SCLKSW[2:0] bits (System clock Switch) */
#define RCC_CFG_SCLKSW_0    ((uint32_t)0x00000001U) /* Bit 0 */
#define RCC_CFG_SCLKSW_1    ((uint32_t)0x00000002U) /* Bit 1 */
#define RCC_CFG_SCLKSW_2    ((uint32_t)0x00000004U) /* Bit 2 */

#define RCC_CFG_SCLKSW_HSI  ((uint32_t)0x00000000U) /* HSI selected as system clock */
#define RCC_CFG_SCLKSW_HSE  ((uint32_t)0x00000001U) /* HSE selected as system clock */
#define RCC_CFG_SCLKSW_PLL  ((uint32_t)0x00000002U) /* PLL selected as system clock */
#define RCC_CFG_SCLKSW_LSI  ((uint32_t)0x00000003U) /* LSI selected as system clock */

/* SCLKSTS configuration */
#define RCC_CFG_SCLKSTS     ((uint32_t)0x0000C008U) /* SCLKSTS[2:0] bits (System Clock Switch Status) */
#define RCC_CFG_SCLKSTS_0   ((uint32_t)0x00000008U) /* Bit 0 */
#define RCC_CFG_SCLKSTS_1   ((uint32_t)0x00004000U) /* Bit 1 */
#define RCC_CFG_SCLKSTS_2   ((uint32_t)0x00008000U) /* Bit 1 */

#define RCC_CFG_SCLKSTS_HSI ((uint32_t)0x00000000U) /* HSI oscillator used as system clock */
#define RCC_CFG_SCLKSTS_HSE ((uint32_t)0x00000008U) /* HSE oscillator used as system clock */
#define RCC_CFG_SCLKSTS_PLL ((uint32_t)0x00004000U) /* PLL used as system clock */
#define RCC_CFG_SCLKSTS_LSI ((uint32_t)0x00004008U) /* LSI oscillator used as system clock */

/** AHBPRES configuration */
#define RCC_CFG_AHBPRES     ((uint32_t)0x000000F0U) /* AHBPRES[3:0] bits (AHB prescaler) */
#define RCC_CFG_AHBPRES_0   ((uint32_t)0x00000010U) /* Bit 0 */
#define RCC_CFG_AHBPRES_1   ((uint32_t)0x00000020U) /* Bit 1 */
#define RCC_CFG_AHBPRES_2   ((uint32_t)0x00000040U) /* Bit 2 */
#define RCC_CFG_AHBPRES_3   ((uint32_t)0x00000080U) /* Bit 3 */

#define RCC_CFG_AHBPRES_DIV1    ((uint32_t)0x00000000U) /* SYSCLK not divided */
#define RCC_CFG_AHBPRES_DIV2    ((uint32_t)0x00000080U) /* SYSCLK divided by 2 */
#define RCC_CFG_AHBPRES_DIV4    ((uint32_t)0x00000090U) /* SYSCLK divided by 4 */
#define RCC_CFG_AHBPRES_DIV8    ((uint32_t)0x000000A0U) /* SYSCLK divided by 8 */
#define RCC_CFG_AHBPRES_DIV16   ((uint32_t)0x000000B0U) /* SYSCLK divided by 16 */
#define RCC_CFG_AHBPRES_DIV64   ((uint32_t)0x000000C0U) /* SYSCLK divided by 64 */
#define RCC_CFG_AHBPRES_DIV128  ((uint32_t)0x000000D0U) /* SYSCLK divided by 128 */
#define RCC_CFG_AHBPRES_DIV256  ((uint32_t)0x000000E0U) /* SYSCLK divided by 256 */
#define RCC_CFG_AHBPRES_DIV512  ((uint32_t)0x000000F0U) /* SYSCLK divided by 512 */

/** APB1PRES configuration */
#define RCC_CFG_APB1PRES    ((uint32_t)0x00000700U) /* APB1PRES[2:0] bits (APB1 prescaler) */
#define RCC_CFG_APB1PRES_0  ((uint32_t)0x00000100U) /* Bit 0 */
#define RCC_CFG_APB1PRES_1  ((uint32_t)0x00000200U) /* Bit 1 */
#define RCC_CFG_APB1PRES_2  ((uint32_t)0x00000400U) /* Bit 2 */

#define RCC_CFG_APB1PRES_DIV1   ((uint32_t)0x00000000U) /* HCLK not divided */
#define RCC_CFG_APB1PRES_DIV2   ((uint32_t)0x00000400U) /* HCLK divided by 2 */
#define RCC_CFG_APB1PRES_DIV4   ((uint32_t)0x00000500U) /* HCLK divided by 4 */
#define RCC_CFG_APB1PRES_DIV8   ((uint32_t)0x00000600U) /* HCLK divided by 8 */
#define RCC_CFG_APB1PRES_DIV16  ((uint32_t)0x00000700U) /* HCLK divided by 16 */

/** APB2PRES configuration **/
#define RCC_CFG_APB2PRES    ((uint32_t)0x00003800U) /* APB2PRES[2:0] bits (APB2 prescaler) */
#define RCC_CFG_APB2PRES_0  ((uint32_t)0x00000800U) /* Bit 0 */
#define RCC_CFG_APB2PRES_1  ((uint32_t)0x00001000U) /* Bit 1 */
#define RCC_CFG_APB2PRES_2  ((uint32_t)0x00002000U) /* Bit 2 */

#define RCC_CFG_APB2PRES_DIV1  ((uint32_t)0x00000000U) /* HCLK not divided */
#define RCC_CFG_APB2PRES_DIV2  ((uint32_t)0x00002000U) /* HCLK divided by 2 */
#define RCC_CFG_APB2PRES_DIV4  ((uint32_t)0x00002800U) /* HCLK divided by 4 */
#define RCC_CFG_APB2PRES_DIV8  ((uint32_t)0x00003000U) /* HCLK divided by 8 */
#define RCC_CFG_APB2PRES_DIV16 ((uint32_t)0x00003800U) /* HCLK divided by 16 */

/* PLLMUL configuration */
#define RCC_CFG_PLLMULFCT   ((uint32_t)0x000F0000U) /* PLLMUL[3:0] bits (PLL multiplication factor) */
#define RCC_CFG_PLLMULFCT_0 ((uint32_t)0x00010000U) /* Bit 0 */
#define RCC_CFG_PLLMULFCT_1 ((uint32_t)0x00020000U) /* Bit 1 */
#define RCC_CFG_PLLMULFCT_2 ((uint32_t)0x00040000U) /* Bit 2 */
#define RCC_CFG_PLLMULFCT_3 ((uint32_t)0x00080000U) /* Bit 3 */

#define RCC_CFG_PLLMULFCT3  ((uint32_t)0x00000000U) /* PLL input clock*3 */
#define RCC_CFG_PLLMULFCT4  ((uint32_t)0x00010000U) /* PLL input clock*4 */
#define RCC_CFG_PLLMULFCT5  ((uint32_t)0x00020000U) /* PLL input clock*5 */
#define RCC_CFG_PLLMULFCT6  ((uint32_t)0x00030000U) /* PLL input clock*6 */
#define RCC_CFG_PLLMULFCT7  ((uint32_t)0x00040000U) /* PLL input clock*7 */
#define RCC_CFG_PLLMULFCT8  ((uint32_t)0x00050000U) /* PLL input clock*8 */
#define RCC_CFG_PLLMULFCT9  ((uint32_t)0x00060000U) /* PLL input clock*9 */
#define RCC_CFG_PLLMULFCT10 ((uint32_t)0x00070000U) /* PLL input clock*10 */
#define RCC_CFG_PLLMULFCT11 ((uint32_t)0x00080000U) /* PLL input clock*11 */
#define RCC_CFG_PLLMULFCT12 ((uint32_t)0x00090000U) /* PLL input clock*12 */
#define RCC_CFG_PLLMULFCT13 ((uint32_t)0x000A0000U) /* PLL input clock*13 */
#define RCC_CFG_PLLMULFCT14 ((uint32_t)0x000B0000U) /* PLL input clock*14 */
#define RCC_CFG_PLLMULFCT15 ((uint32_t)0x000C0000U) /* PLL input clock*15 */
#define RCC_CFG_PLLMULFCT16 ((uint32_t)0x000D0000U) /* PLL input clock*16 */
#define RCC_CFG_PLLMULFCT17 ((uint32_t)0x000E0000U) /* PLL input clock*17 */
#define RCC_CFG_PLLMULFCT18 ((uint32_t)0x000F0000U) /* PLL input clock*18 */

/* PLLPRE configuration */
#define RCC_CFG_PLLPRE      ((uint32_t)0x00300000U) /* PLL prescaler */
#define RCC_CFG_PLLPRE_0    ((uint32_t)0x00100000U) /* Bit 0 */
#define RCC_CFG_PLLPRE_1    ((uint32_t)0x00200000U) /* Bit 1 */

