handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define RCC_CFG_PLLPREDIV1   ((uint32_t)0x00000000U)/* PLL clock is divided by 1 */
#define RCC_CFG_PLLPREDIV2   ((uint32_t)0x00100000U)/* PLL clock is divided by 2 */
#define RCC_CFG_PLLPREDIV3   ((uint32_t)0x00200000U)/* PLL clock is divided by 3 */
#define RCC_CFG_PLLPREDIV4   ((uint32_t)0x00300000U)/* PLL clock is divided by 4 */

/* PLLOUTDIV configuration */
#define RCC_CFG_PLLOUTDIV   ((uint32_t)0x00C00000U) /* PLL Out Clock Divid */
#define RCC_CFG_PLLOUTDIV_0 ((uint32_t)0x00400000U) /* Bit 0 */
#define RCC_CFG_PLLOUTDIV_1 ((uint32_t)0x00800000U) /* Bit 1 */

#define RCC_CFG_PLLOUTDIV1     ((uint32_t)0x00000000U) /* PLL Out clock is divided by 1 */
#define RCC_CFG_PLLOUTDIV2  ((uint32_t)0x00400000U) /* PLL Out clock is divided by 2 */
#define RCC_CFG_PLLOUTDIV3  ((uint32_t)0x00800000U) /* PLL Out clock is divided by 3 */
#define RCC_CFG_PLLOUTDIV4  ((uint32_t)0x00C00000U) /* PLL Out clock is divided by 4 */

/* PLLSRC configuration */
#define RCC_CFG_PLLSRC         ((uint32_t)0x01000000U) /* PLL entry clock source */

#define RCC_CFG_PLLSRC_HSI   ((uint32_t)0x00000000U) /* HSI clock selected as PLL entry clock source */
#define RCC_CFG_PLLSRC_HSE   ((uint32_t)0x01000000U) /* HSE clock selected as PLL entry clock source */

/* MCO configuration */
#define RCC_CFG_MCO      ((uint32_t)0x0E000000U) /* MCO[2:0] bits (Microcontroller Clock Output) */
#define RCC_CFG_MCO_0    ((uint32_t)0x02000000U) /* Bit 0 */
#define RCC_CFG_MCO_1    ((uint32_t)0x04000000U) /* Bit 1 */
#define RCC_CFG_MCO_2    ((uint32_t)0x08000000U) /* Bit 2 */

#define  RCC_CFG_MCO_NOCLK      ((uint32_t)0x00000000U) /* No clock */ 
#define  RCC_CFG_MCO_LSI        ((uint32_t)0x02000000U) /* LSI clock selected as MCO source */
#define  RCC_CFG_MCO_SYSCLK     ((uint32_t)0x04000000U) /* System clock selected as MCO source */ 
#define  RCC_CFG_MCO_HSI        ((uint32_t)0x06000000U) /* HSI clock selected as MCO source */
#define  RCC_CFG_MCO_HSE        ((uint32_t)0x08000000U) /* HSE clock selected as MCO source  */ 
#define  RCC_CFG_MCO_PLL        ((uint32_t)0x0A000000U) /* PLL clock divided selected as MCO source */

/* MCOPRE configuration */
#define RCC_CFG_MCOPRES    ((uint32_t)0xF0000000U)/* MCOPRE[3:0] bits ( PLL prescaler set and cleared by software to generate MCOPRE clock.) */
#define RCC_CFG_MCOPRES_0  ((uint32_t)0x10000000U) /* Bit 0 */
#define RCC_CFG_MCOPRES_1  ((uint32_t)0x20000000U) /* Bit 1 */
#define RCC_CFG_MCOPRES_2  ((uint32_t)0x40000000U) /* Bit 2 */
#define RCC_CFG_MCOPRES_3  ((uint32_t)0x80000000U) /* Bit 3 */

#define RCC_CFG_MCOPRES_PLLDIV2  ((uint32_t)0x20000000U) /* PLL clock is divided by 2 */
#define RCC_CFG_MCOPRES_PLLDIV3  ((uint32_t)0x30000000U) /* PLL clock is divided by 3 */
#define RCC_CFG_MCOPRES_PLLDIV4  ((uint32_t)0x40000000U) /* PLL clock is divided by 4 */
#define RCC_CFG_MCOPRES_PLLDIV5  ((uint32_t)0x50000000U) /* PLL clock is divided by 5 */
#define RCC_CFG_MCOPRES_PLLDIV6  ((uint32_t)0x60000000U) /* PLL clock is divided by 6 */
#define RCC_CFG_MCOPRES_PLLDIV7  ((uint32_t)0x70000000U) /* PLL clock is divided by 7 */
#define RCC_CFG_MCOPRES_PLLDIV8  ((uint32_t)0x80000000U) /* PLL clock is divided by 8 */
#define RCC_CFG_MCOPRES_PLLDIV9  ((uint32_t)0x90000000U) /* PLL clock is divided by 9 */
#define RCC_CFG_MCOPRES_PLLDIV10 ((uint32_t)0xA0000000U) /* PLL clock is divided by 10 */
#define RCC_CFG_MCOPRES_PLLDIV11 ((uint32_t)0xB0000000U) /* PLL clock is divided by 11 */
#define RCC_CFG_MCOPRES_PLLDIV12 ((uint32_t)0xC0000000U) /* PLL clock is divided by 12 */
#define RCC_CFG_MCOPRES_PLLDIV13 ((uint32_t)0xD0000000U) /* PLL clock is divided by 13 */
#define RCC_CFG_MCOPRES_PLLDIV14 ((uint32_t)0xE0000000U) /* PLL clock is divided by 14 */
#define RCC_CFG_MCOPRES_PLLDIV15 ((uint32_t)0xF0000000U) /* PLL clock is divided by 15 */

/** Bit definition for RCC_CLKINT register **/

#define RCC_CLKINT_LSIRDIF     ((uint32_t)0x00000001U) /* LSI Ready Interrupt Flag */
#define RCC_CLKINT_HSIRDIF     ((uint32_t)0x00000004U) /* HSI Ready Interrupt Flag */
#define RCC_CLKINT_HSERDIF     ((uint32_t)0x00000008U) /* HSE Ready Interrupt Flag */
#define RCC_CLKINT_PLLRDIF     ((uint32_t)0x00000010U) /* PLL Ready Interrupt Flag */
#define RCC_CLKINT_RAMPERRIF   ((uint32_t)0x00000020U) /* RAM Parity Error Interrupt Flag */
#define RCC_CLKINT_CLKSSIF     ((uint32_t)0x00000080U) /* HSE Clock Security System Interrupt Flag */

#define RCC_CLKINT_LSIRDIEN      ((uint32_t)0x00000100U) /* LSI Ready Interrupt Enable */
#define RCC_CLKINT_HSIRDIEN      ((uint32_t)0x00000400U) /* HSI Ready Interrupt Enable */
#define RCC_CLKINT_HSERDIEN      ((uint32_t)0x00000800U) /* HSE Ready Interrupt Enable */
#define RCC_CLKINT_PLLRDIEN      ((uint32_t)0x00001000U) /* PLL Ready Interrupt Enable */
#define RCC_CLKINT_RAMPERRIEN    ((uint32_t)0x00002000U) /* RAM Parity Error Interrupt Enable */
#define RCC_CLKINT_RAMPERRRSTEN  ((uint32_t)0x00004000U) /* RAM Parity Error Reset Enable */

#define RCC_CLKINT_LSIRDICLR   ((uint32_t)0x00010000U) /* LSI Ready Interrupt Clear */
#define RCC_CLKINT_HSIRDICLR   ((uint32_t)0x00040000U) /* HSI Ready Interrupt Clear */
#define RCC_CLKINT_HSERDICLR   ((uint32_t)0x00080000U) /* HSE Ready Interrupt Clear */
#define RCC_CLKINT_PLLRDICLR   ((uint32_t)0x00100000U) /* PLL Ready Interrupt Clear */
#define RCC_CLKINT_RAMPERRICLR ((uint32_t)0x00200000U) /* RAM Parity Error Interrupt Clear */
#define RCC_CLKINT_CLKSSICLR   ((uint32_t)0x00800000U) /* HSE Clock Security System Interrupt Clear */

/** Bit definition for RCC_APB2PRST register **/

#define RCC_APB2PRST_AFIORST   ((uint32_t)0x00000001U) /* Alternate Function I/O reset */
#define RCC_APB2PRST_IOPARST   ((uint32_t)0x00000004U) /* I/O port A clock reset */
#define RCC_APB2PRST_IOPBRST   ((uint32_t)0x00000008U) /* I/O port B clock reset */
#define RCC_APB2PRST_IOPCRST   ((uint32_t)0x00000010U) /* I/O port C clock reset */
#define RCC_APB2PRST_IOPDRST   ((uint32_t)0x00000020U) /* I/O port D clock reset */
#define RCC_APB2PRST_SPI1RST   ((uint32_t)0x00000200U) /* SPI 1 reset */
#define RCC_APB2PRST_SPI2RST   ((uint32_t)0x00000400U) /* SPI 2 reset */
#define RCC_APB2PRST_SPI3RST   ((uint32_t)0x00000800U) /* SPI 3 reset */
#define RCC_APB2PRST_TIM1RST   ((uint32_t)0x00001000U) /* Timer 1 reset */
#define RCC_APB2PRST_TIM2RST   ((uint32_t)0x00002000U) /* Timer 2 reset */
#define RCC_APB2PRST_UART1RST  ((uint32_t)0x00004000U) /* UART 1 reset */
#define RCC_APB2PRST_UART2RST  ((uint32_t)0x00008000U) /* UART 4 reset */
#define RCC_APB2PRST_TIM3RST   ((uint32_t)0x00010000U) /* Timer 3 reset */
#define RCC_APB2PRST_TIM4RST   ((uint32_t)0x00020000U) /* Timer 4 reset */
#define RCC_APB2PRST_TIM5RST   ((uint32_t)0x00040000U) /* Timer 5 reset */

/** Bit definition for RCC_APB1PRST register **/

#define RCC_APB1PRST_TIM6RST   ((uint32_t)0x00000010U) /* Timer 6 reset */
#define RCC_APB1PRST_BEEPRST   ((uint32_t)0x00000020U) /* Beeper reset */
#define RCC_APB1PRST_COMPRST   ((uint32_t)0x00000100U) /* COMP reset */
#define RCC_APB1PRST_LCDRST    ((uint32_t)0x00000400U) /* LCD reset */
#define RCC_APB1PRST_WWDGRST   ((uint32_t)0x00000800U) /* Window Watchdog reset */
#define RCC_APB1PRST_UART3RST  ((uint32_t)0x00040000U) /* UART 3 reset */
#define RCC_APB1PRST_UART4RST  ((uint32_t)0x00080000U) /* UART 4 reset */
#define RCC_APB1PRST_UART5RST  ((uint32_t)0x00100000U) /* UART 5 reset */
#define RCC_APB1PRST_I2C1RST   ((uint32_t)0x00200000U) /* I2C 1 reset */
#define RCC_APB1PRST_I2C2RST   ((uint32_t)0x00400000U) /* I2C 2 reset */
#define RCC_APB1PRST_CANRST    ((uint32_t)0x04000000U) /* CAN reset */
#define RCC_APB1PRST_DACRST    ((uint32_t)0x08000000U) /* DAC reset */
#define RCC_APB1PRST_PWRRST    ((uint32_t)0x10000000U) /* Power interface reset */

/** Bit definition for RCC_AHBPCLKEN register **/

#define RCC_AHBPCLKEN_DMAEN    ((uint32_t)0x00000001U) /* DMA clock enable */
#define RCC_AHBPCLKEN_SRAMEN   ((uint32_t)0x00000004U) /* SRAM interface clock enable */
#define RCC_AHBPCLKEN_FLITFEN  ((uint32_t)0x00000010U) /* FLITF clock enable */
#define RCC_AHBPCLKEN_CRCEN    ((uint32_t)0x00000040U) /* CRC clock enable */
#define RCC_AHBPCLKEN_SACEN    ((uint32_t)0x00000800U) /* SAC clock enable */
#define RCC_AHBPCLKEN_ADCEN    ((uint32_t)0x00001000U) /* ADC clock enable */

/** Bit definition for RCC_APB2PCLKEN register **/

#define RCC_APB2PCLKEN_AFIOEN   ((uint32_t)0x00000001U) /* Alternate Function I/O enable */
#define RCC_APB2PCLKEN_IOPAEN   ((uint32_t)0x00000004U) /* I/O port A clock enable */
#define RCC_APB2PCLKEN_IOPBEN   ((uint32_t)0x00000008U) /* I/O port B clock enable */
#define RCC_APB2PCLKEN_IOPCEN   ((uint32_t)0x00000010U) /* I/O port C clock enable */
#define RCC_APB2PCLKEN_IOPDEN   ((uint32_t)0x00000020U) /* I/O port D clock enable */
#define RCC_APB2PCLKEN_SPI1EN   ((uint32_t)0x00000200U) /* SPI 1 enable */
#define RCC_APB2PCLKEN_SPI2EN   ((uint32_t)0x00000400U) /* SPI 2 enable */
#define RCC_APB2PCLKEN_SPI3EN   ((uint32_t)0x00000800U) /* SPI 3 enable */
#define RCC_APB2PCLKEN_TIM1EN   ((uint32_t)0x00001000U) /* Timer 1 enable */
#define RCC_APB2PCLKEN_TIM2EN   ((uint32_t)0x00002000U) /* Timer 2 enable */
#define RCC_APB2PCLKEN_UART1EN  ((uint32_t)0x00004000U) /* UART 1 enable */
#define RCC_APB2PCLKEN_UART2EN  ((uint32_t)0x00008000U) /* UART 4 enable */
#define RCC_APB2PCLKEN_TIM3EN   ((uint32_t)0x00010000U) /* Timer 3 enable */
#define RCC_APB2PCLKEN_TIM4EN   ((uint32_t)0x00020000U) /* Timer 4 enable */
#define RCC_APB2PCLKEN_TIM5EN   ((uint32_t)0x00040000U) /* Timer 5 enable */

/** Bit definition for RCC_APB1PCLKEN register **/

#define RCC_APB1PCLKEN_TIM6EN      ((uint32_t)0x00000010U) /* Timer 6 enable */
#define RCC_APB1PCLKEN_BEEPEN      ((uint32_t)0x00000020U) /* Beeper enable */
#define RCC_APB1PCLKEN_COMPEN      ((uint32_t)0x00000100U) /* COMP enable */
#define RCC_APB1PCLKEN_COMPFILTEN  ((uint32_t)0x00000200U) /* COMP Filter enable */
#define RCC_APB1PCLKEN_LCDEN       ((uint32_t)0x00000400U) /* LCD enable */
#define RCC_APB1PCLKEN_WWDGEN      ((uint32_t)0x00000800U) /* Window Watchdog enable */
#define RCC_APB1PCLKEN_UART3EN     ((uint32_t)0x00040000U) /* UART 3 enable */
#define RCC_APB1PCLKEN_UART4EN     ((uint32_t)0x00080000U) /* UART 4 enable */
#define RCC_APB1PCLKEN_UART5EN     ((uint32_t)0x00100000U) /* UART 5 enable */
#define RCC_APB1PCLKEN_I2C1EN      ((uint32_t)0x00200000U) /* I2C 1 enable */
#define RCC_APB1PCLKEN_I2C2EN      ((uint32_t)0x00400000U) /* I2C 2 enable */
#define RCC_APB1PCLKEN_CANEN       ((uint32_t)0x04000000U) /* CAN enable */
#define RCC_APB1PCLKEN_DACEN       ((uint32_t)0x08000000U) /* DAC enable */
#define RCC_APB1PCLKEN_PWREN       ((uint32_t)0x10000000U) /* Power interface enable */

