handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for RCC_LSCTRL register **/

#define RCC_LSCTRL_LSIEN    ((uint32_t)0x00000001U) /* Internal Low Speed oscillator enable */
#define RCC_LSCTRL_LSIRD    ((uint32_t)0x00000002U) /* Internal Low Speed oscillator Ready */
#define RCC_LSCTRL_LSITRIM  ((uint32_t)0x0000007CU) /* Internal Low Speed oscillator trimming */

#define RCC_LSCTRL_RTCSEL   ((uint32_t)0x00001800U) /* RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_LSCTRL_RTCSEL_0 ((uint32_t)0x00000800U) /* Bit 0 */
#define RCC_LSCTRL_RTCSEL_1 ((uint32_t)0x00001000U) /* Bit 1 */

/** RTC congiguration **/
#define RCC_LSCTRL_RTCSEL_NOCLOCK ((uint32_t)0x00000000U) /* No clock */
#define RCC_LSCTRL_RTCSEL_LSI     ((uint32_t)0x00000800U) /* LSI oscillator clock used as RTC clock */
#define RCC_LSCTRL_RTCSEL_HSE     ((uint32_t)0x00001000U) /* HSE oscillator clock divided by 128 used as RTC clock */
#define RCC_LSCTRL_RTCSEL_HSI     ((uint32_t)0x00001800U) /* HSI oscillator clock divided by 128 used as RTC clock */

#define RCC_LSCTRL_RTCEN          ((uint32_t)0x00002000U) /* RTC clock enable */
#define RCC_LSCTRL_RTCRST         ((uint32_t)0x00004000U) /* RTC clock reset  */

/** Bit definition for RCC_CTRLSTS register **/

#define RCC_CTRLSTS_RMRSTF       ((uint32_t)0x00000001U) /* Remove all reset flag */
#define RCC_CTRLSTS_RAMPERRRSTF  ((uint32_t)0x00000002U) /* RAM parity error reset flag */
#define RCC_CTRLSTS_MMURSTF      ((uint32_t)0x00000004U) /* MMU reset flag */
#define RCC_CTRLSTS_PINRSTF      ((uint32_t)0x00000008U) /* PIN reset flag */
#define RCC_CTRLSTS_PORRSTF      ((uint32_t)0x00000010U) /* POR reset flag */
#define RCC_CTRLSTS_SFTRSTF      ((uint32_t)0x00000020U) /* Software Reset flag */
#define RCC_CTRLSTS_IWDGRSTF     ((uint32_t)0x00000040U) /* Independent Watchdog reset flag */
#define RCC_CTRLSTS_WWDGRSTF     ((uint32_t)0x00000080U) /* Window watchdog reset flag */
#define RCC_CTRLSTS_LPWRRSTF     ((uint32_t)0x00000100U) /* Low-Power reset flag */
#define RCC_CTRLSTS_EMCGBNRSTF   ((uint32_t)0x00000200U) /* EMCGBN reset flag */
#define RCC_CTRLSTS_EMCGBRSTF    ((uint32_t)0x00000400U) /* EMCGB reset flag */
#define RCC_CTRLSTS_LKUPRSTF     ((uint32_t)0x00000800U) /* M0 core lock up reset flag */
#define RCC_CTRLSTS_LVRRSTF      ((uint32_t)0x20000000U) /* LVR reset flag */

/** Bit definition for RCC_AHBPRST register **/

#define RCC_AHBPRST_SACRST    ((uint32_t)0x00000800U) /* SAC clock reset */
#define RCC_AHBPRST_ADCRST    ((uint32_t)0x00001000U) /* ADC clock reset */

/** Bit definition for RCC_CFG2 register **/
/** ADCHPRE configuration **/
#define RCC_CFG2_ADCHPRES   ((uint32_t)0x0000000FU) /* ADCHPRE[3:0] bits */
#define RCC_CFG2_ADCHPRES_0 ((uint32_t)0x00000001U) /* Bit 0 */
#define RCC_CFG2_ADCHPRES_1 ((uint32_t)0x00000002U) /* Bit 1 */
#define RCC_CFG2_ADCHPRES_2 ((uint32_t)0x00000004U) /* Bit 2 */
#define RCC_CFG2_ADCHPRES_3 ((uint32_t)0x00000008U) /* Bit 3 */

#define RCC_CFG2_ADCHPRES_DIV1   ((uint32_t)0x00000000U) /* HCLK clock divided by 1 */
#define RCC_CFG2_ADCHPRES_DIV2   ((uint32_t)0x00000001U) /* HCLK clock divided by 2 */
#define RCC_CFG2_ADCHPRES_DIV4   ((uint32_t)0x00000002U) /* HCLK clock divided by 4 */
#define RCC_CFG2_ADCHPRES_DIV6   ((uint32_t)0x00000003U) /* HCLK clock divided by 6 */
#define RCC_CFG2_ADCHPRES_DIV8   ((uint32_t)0x00000004U) /* HCLK clock divided by 8 */
#define RCC_CFG2_ADCHPRES_DIV10  ((uint32_t)0x00000005U) /* HCLK clock divided by 10 */
#define RCC_CFG2_ADCHPRES_DIV12  ((uint32_t)0x00000006U) /* HCLK clock divided by 12 */
#define RCC_CFG2_ADCHPRES_DIV16  ((uint32_t)0x00000007U) /* HCLK clock divided by 16 */
#define RCC_CFG2_ADCHPRES_DIV32  ((uint32_t)0x00000008U) /* HCLK clock divided by 32 */
#define RCC_CFG2_ADCHPRES_OTHERS ((uint32_t)0x00000008U) /* HCLK clock divided by 32 */

/** ADCPLLPRES configuration **/
#define RCC_CFG2_ADCPLLPRES   ((uint32_t)0x000001F0U) /* ADCPLLPRES[4:0] bits */
#define RCC_CFG2_ADCPLLPRES_0 ((uint32_t)0x00000010U) /* Bit 0 */
#define RCC_CFG2_ADCPLLPRES_1 ((uint32_t)0x00000020U) /* Bit 1 */
#define RCC_CFG2_ADCPLLPRES_2 ((uint32_t)0x00000040U) /* Bit 2 */
#define RCC_CFG2_ADCPLLPRES_3 ((uint32_t)0x00000080U) /* Bit 3 */
#define RCC_CFG2_ADCPLLPRES_4 ((uint32_t)0x00000100U) /* Bit 4 */

#define RCC_CFG2_ADCPLLCLK_DISABLE  ((uint32_t)0xFFFFFEFFU) /* ADC PLL clock Disable */
#define RCC_CFG2_ADCPLLPRES_DIV1    ((uint32_t)0x00000100U) /* PLL clock divided by 1 */
#define RCC_CFG2_ADCPLLPRES_DIV2    ((uint32_t)0x00000110U) /* PLL clock divided by 2 */
#define RCC_CFG2_ADCPLLPRES_DIV4    ((uint32_t)0x00000120U) /* PLL clock divided by 4 */
#define RCC_CFG2_ADCPLLPRES_DIV6    ((uint32_t)0x00000130U) /* PLL clock divided by 6 */
#define RCC_CFG2_ADCPLLPRES_DIV8    ((uint32_t)0x00000140U) /* PLL clock divided by 8 */
#define RCC_CFG2_ADCPLLPRES_DIV10   ((uint32_t)0x00000150U) /* PLL clock divided by 10 */
#define RCC_CFG2_ADCPLLPRES_DIV12   ((uint32_t)0x00000160U) /* PLL clock divided by 12 */
#define RCC_CFG2_ADCPLLPRES_DIV16   ((uint32_t)0x00000170U) /* PLL clock divided by 16 */
#define RCC_CFG2_ADCPLLPRES_DIV32   ((uint32_t)0x00000180U) /* PLL clock divided by 32 */
#define RCC_CFG2_ADCPLLPRES_DIV64   ((uint32_t)0x00000190U) /* PLL clock divided by 64 */
#define RCC_CFG2_ADCPLLPRES_DIV128  ((uint32_t)0x000001A0U) /* PLL clock divided by 128 */
#define RCC_CFG2_ADCPLLPRES_DIV256  ((uint32_t)0x000001B0U) /* PLL clock divided by 256 */
#define RCC_CFG2_ADCPLLPRES_DIV256N ((uint32_t)0x000001C0U) /* PLL clock divided by 256 */


/** ADC1MSEL configuration **/
#define RCC_CFG2_ADC1MSEL     ((uint32_t)0x00000400U) /* ADC1M clock source select */

#define RCC_CFG2_ADC1MSEL_HSI ((uint32_t)0x00000000U) /* HSI clock selected as ADC1M input clock */
#define RCC_CFG2_ADC1MSEL_HSE ((uint32_t)0x00000400U) /* HSE clock selected as ADC1M input clock */

/** ADC1MPRE configuration **/
#define RCC_CFG2_ADC1MPRES   ((uint32_t)0x0000F800U) /* ADC1MPRE[4:0] bits */
#define RCC_CFG2_ADC1MPRES_0 ((uint32_t)0x00000800U) /* Bit 0 */
#define RCC_CFG2_ADC1MPRES_1 ((uint32_t)0x00001000U) /* Bit 1 */
#define RCC_CFG2_ADC1MPRES_2 ((uint32_t)0x00002000U) /* Bit 2 */
#define RCC_CFG2_ADC1MPRES_3 ((uint32_t)0x00004000U) /* Bit 3 */
#define RCC_CFG2_ADC1MPRES_4 ((uint32_t)0x00008000U) /* Bit 4 */

