handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define RCC_CFG2_ADC1MPRES_DIV1  ((uint32_t)0x00000000U) /* ADC1M source clock is divided by 1 */
#define RCC_CFG2_ADC1MPRES_DIV2  ((uint32_t)0x00000800U) /* ADC1M source clock is divided by 2 */
#define RCC_CFG2_ADC1MPRES_DIV3  ((uint32_t)0x00001000U) /* ADC1M source clock is divided by 3 */
#define RCC_CFG2_ADC1MPRES_DIV4  ((uint32_t)0x00001800U) /* ADC1M source clock is divided by 4 */
#define RCC_CFG2_ADC1MPRES_DIV5  ((uint32_t)0x00002000U) /* ADC1M source clock is divided by 5 */
#define RCC_CFG2_ADC1MPRES_DIV6  ((uint32_t)0x00002800U) /* ADC1M source clock is divided by 6 */
#define RCC_CFG2_ADC1MPRES_DIV7  ((uint32_t)0x00003000U) /* ADC1M source clock is divided by 7 */
#define RCC_CFG2_ADC1MPRES_DIV8  ((uint32_t)0x00003800U) /* ADC1M source clock is divided by 8 */
#define RCC_CFG2_ADC1MPRES_DIV9  ((uint32_t)0x00004000U) /* ADC1M source clock is divided by 9 */
#define RCC_CFG2_ADC1MPRES_DIV10 ((uint32_t)0x00004800U) /* ADC1M source clock is divided by 10 */
#define RCC_CFG2_ADC1MPRES_DIV11 ((uint32_t)0x00005000U) /* ADC1M source clock is divided by 11 */
#define RCC_CFG2_ADC1MPRES_DIV12 ((uint32_t)0x00005800U) /* ADC1M source clock is divided by 12 */
#define RCC_CFG2_ADC1MPRES_DIV13 ((uint32_t)0x00006000U) /* ADC1M source clock is divided by 13 */
#define RCC_CFG2_ADC1MPRES_DIV14 ((uint32_t)0x00006800U) /* ADC1M source clock is divided by 14 */
#define RCC_CFG2_ADC1MPRES_DIV15 ((uint32_t)0x00007000U) /* ADC1M source clock is divided by 15 */
#define RCC_CFG2_ADC1MPRES_DIV16 ((uint32_t)0x00007800U) /* ADC1M source clock is divided by 16 */
#define RCC_CFG2_ADC1MPRES_DIV17 ((uint32_t)0x00008000U) /* ADC1M source clock is divided by 17 */
#define RCC_CFG2_ADC1MPRES_DIV18 ((uint32_t)0x00008800U) /* ADC1M source clock is divided by 18 */
#define RCC_CFG2_ADC1MPRES_DIV19 ((uint32_t)0x00009000U) /* ADC1M source clock is divided by 19 */
#define RCC_CFG2_ADC1MPRES_DIV20 ((uint32_t)0x00009800U) /* ADC1M source clock is divided by 20 */
#define RCC_CFG2_ADC1MPRES_DIV21 ((uint32_t)0x0000A000U) /* ADC1M source clock is divided by 21 */
#define RCC_CFG2_ADC1MPRES_DIV22 ((uint32_t)0x0000A800U) /* ADC1M source clock is divided by 22 */
#define RCC_CFG2_ADC1MPRES_DIV23 ((uint32_t)0x0000B000U) /* ADC1M source clock is divided by 23 */
#define RCC_CFG2_ADC1MPRES_DIV24 ((uint32_t)0x0000B800U) /* ADC1M source clock is divided by 24 */
#define RCC_CFG2_ADC1MPRES_DIV25 ((uint32_t)0x0000C000U) /* ADC1M source clock is divided by 25 */
#define RCC_CFG2_ADC1MPRES_DIV26 ((uint32_t)0x0000C800U) /* ADC1M source clock is divided by 26 */
#define RCC_CFG2_ADC1MPRES_DIV27 ((uint32_t)0x0000D000U) /* ADC1M source clock is divided by 27 */
#define RCC_CFG2_ADC1MPRES_DIV28 ((uint32_t)0x0000D800U) /* ADC1M source clock is divided by 28 */
#define RCC_CFG2_ADC1MPRES_DIV29 ((uint32_t)0x0000E000U) /* ADC1M source clock is divided by 29 */
#define RCC_CFG2_ADC1MPRES_DIV30 ((uint32_t)0x0000E800U) /* ADC1M source clock is divided by 30 */
#define RCC_CFG2_ADC1MPRES_DIV31 ((uint32_t)0x0000F000U) /* ADC1M source clock is divided by 31 */
#define RCC_CFG2_ADC1MPRES_DIV32 ((uint32_t)0x0000F800U) /* ADC1M source clock is divided by 32 */


/** ADCCLKSEL configuration **/
#define RCC_CFG2_ADCCLKSEL   ((uint32_t)0x06000000U) /* ADCCLKSEL[1:0] bits */

#define RCC_CFG2_ADCCLKSEL_0   ((uint32_t)0x02000000U) /* Bit 0 */
#define RCC_CFG2_ADCCLKSEL_1   ((uint32_t)0x04000000U) /* Bit 1 */

#define RCC_CFG2_ADCCLKSEL_HSI24M   ((uint32_t)0x00000000U) /* HSI 24M clock selected as ADC clock */
#define RCC_CFG2_ADCCLKSEL_PLL      ((uint32_t)0x02000000U) /* PLL clock selected as ADC clock */
#define RCC_CFG2_ADCCLKSEL_HCLK     ((uint32_t)0x04000000U) /* HCLK clock selected as ADC clock */


/** LCDCLKSEL configuration **/
#define RCC_CFG2_LCDCLKSEL   ((uint32_t)0x08000000U) /* LCDCLKSEL[1:0] bits */

#define RCC_CFG2_LCDCLKSEL_HSI   ((uint32_t)0x00000000U) /* HSI clock divided 8 selected as LCD clock */
#define RCC_CFG2_LCDCLKSEL_HSE   ((uint32_t)0x08000000U) /* HSE clock divided 16 selected as LCD clock */

/** TIM6CLKSEL configuration **/
#define RCC_CFG2_TIM6CLKSEL   ((uint32_t)0x40000000U) /* TIM6CLKSEL bits */

#define RCC_CFG2_TIM6CLKSEL_PCLK  ((uint32_t)0x00000000U) /* PCLK clock selected as TIM6 clock */
#define RCC_CFG2_TIM6CLKSEL_LSI   ((uint32_t)0x40000000U) /* LSI clock selected as TIM6 clock */

/** TIM1CLKSEL configuration **/
#define RCC_CFG2_TIM1CLKSEL         ((uint32_t)0x80000000U) /* Timer1 clock source select */

#define RCC_CFG2_TIM1CLKSEL_PCLK    ((uint32_t)0x00000000U) /* Timer1 clock selected as PCLK */
#define RCC_CFG2_TIM1CLKSEL_SYSCLK  ((uint32_t)0x80000000U) /* Timer1 clock selected as sysclk clock */

/** Bit definition for RCC_CFG3 register **/

#define RCC_CFG3_GCLKEN        ((uint32_t)0x00000001U) /* LED GCLK clock enable */
/** GCLKSEL configuration **/
#define RCC_CFG3_GCLKSEL       ((uint32_t)0x00000002U) /* LED GCLK source select */

#define RCC_CFG3_GCLKSEL_HSI   ((uint32_t)0x00000000U) /* HSI clock selected as LED GCLK clock */
#define RCC_CFG3_GCLKSEL_HSE   ((uint32_t)0x00000002U) /* HSE clock selected as LED GCLK clock  */

#define RCC_CFG3_GCLKDONEF       ((uint32_t)0x00000004U) /* LED GCLK output lasts one cycle flag  */
#define RCC_CFG3_GCLKDMAEN       ((uint32_t)0x00000008U) /* LED GCLK dma req output enable */
/** GCLKPRES configuration **/
#define RCC_CFG3_GCLKPRES      ((uint32_t)0x00000F00U) /* LED GCLK prescaler */
#define RCC_CFG3_GCLKPRES_0    ((uint32_t)0x00000100U) /* Bit 0 */
#define RCC_CFG3_GCLKPRES_1    ((uint32_t)0x00000200U) /* Bit 1 */
#define RCC_CFG3_GCLKPRES_2    ((uint32_t)0x00000400U) /* Bit 2 */
#define RCC_CFG3_GCLKPRES_3    ((uint32_t)0x00000800U) /* Bit 3 */

#define RCC_CFG3_GCLKPRES_DISABLE  ((uint32_t)0x00000000U) /* LED source clock is disable */
#define RCC_CFG3_GCLKPRES_DIV32    ((uint32_t)0x00000800U) /* LED source clock is divided by 32 */
#define RCC_CFG3_GCLKPRES_DIV40    ((uint32_t)0x00000900U) /* LED source clock is divided by 40 */
#define RCC_CFG3_GCLKPRES_DIV50    ((uint32_t)0x00000A00U) /* LED source clock is divided by 50 */
#define RCC_CFG3_GCLKPRES_DIV64    ((uint32_t)0x00000B00U) /* LED source clock is divided by 64 */
#define RCC_CFG3_GCLKPRES_DIV80    ((uint32_t)0x00000C00U) /* LED source clock is divided by 80 */
#define RCC_CFG3_GCLKPRES_DIV160   ((uint32_t)0x00000D00U) /* LED source clock is divided by 160 */

#define RCC_CFG3_GCLKMNUM        ((uint32_t)0x00FF0000U) /* Number of low level cycles in one time period */
#define RCC_CFG3_GCLKNNUM        ((uint32_t)0xFF000000U) /* Number of clock cycles in one time period */

/**  Bit definition for RCC_EMCCTRL register  **/

#define RCC_EMCCTRL_GBNDET0EN ((uint32_t)0x00000010U) /* GBN0 Detect Enable */
#define RCC_EMCCTRL_GBNDET1EN ((uint32_t)0x00000020U) /* GBN1 Detect Enable */
#define RCC_EMCCTRL_GBNDET2EN ((uint32_t)0x00000040U) /* GBN2 Detect Enable */
#define RCC_EMCCTRL_GBNDET3EN ((uint32_t)0x00000080U) /* GBN3 Detect Enable */
#define RCC_EMCCTRL_GBDET0EN  ((uint32_t)0x00000100U) /* GB0 Detect Enable */
#define RCC_EMCCTRL_GBDET1EN  ((uint32_t)0x00000200U) /* GB1 Detect Enable */
#define RCC_EMCCTRL_GBDET2EN  ((uint32_t)0x00000400U) /* GB2 Detect Enable */
#define RCC_EMCCTRL_GBDET3EN  ((uint32_t)0x00000800U) /* GB3 Detect Enable */

#define RCC_EMCCTRL_GBN0RST   ((uint32_t)0x00010000U) /* GBN0 Reset */
#define RCC_EMCCTRL_GBN1RST   ((uint32_t)0x00020000U) /* GBN1 Reset */
#define RCC_EMCCTRL_GBN2RST   ((uint32_t)0x00040000U) /* GBN2 Reset */
#define RCC_EMCCTRL_GBN3RST   ((uint32_t)0x00080000U) /* GBN3 Reset */
#define RCC_EMCCTRL_GB0RST    ((uint32_t)0x00100000U) /* GB0 Reset */
#define RCC_EMCCTRL_GB1RST    ((uint32_t)0x00200000U) /* GB1 Reset */
#define RCC_EMCCTRL_GB2RST    ((uint32_t)0x00400000U) /* GB2 Reset */
#define RCC_EMCCTRL_GB3RST    ((uint32_t)0x00800000U) /* GB3 Reset */


/*** General Purpose and Alternate Function I/O ***/

/** Bit definition for GPIO_PMODE register **/
#define GPIO_PMODE0_Pos            (0)                                   
#define GPIO_PMODE0_Msk            (0x3 << GPIO_PMODE0_Pos)         /* 0x00000003 */ 
#define GPIO_PMODE0                        GPIO_PMODE0_Msk          /* 0x00000003 */
#define GPIO_PMODE0_0              (0x0 << GPIO_PMODE0_Pos)         /* 0x00000000 */
#define GPIO_PMODE0_1              (0x1 << GPIO_PMODE0_Pos)         /* 0x00000001 */
#define GPIO_PMODE0_2              (0x2 << GPIO_PMODE0_Pos)         /* 0x00000002 */
#define GPIO_PMODE0_3              (0x3 << GPIO_PMODE0_Pos)         /* 0x00000003 */

#define GPIO_PMODE1_Pos            (2)                                   
#define GPIO_PMODE1_Msk            (0x3 << GPIO_PMODE1_Pos)         /* 0x0000000C */
#define GPIO_PMODE1                        GPIO_PMODE1_Msk          /* 0x0000000C */
#define GPIO_PMODE1_0              (0x0 << GPIO_PMODE1_Pos)         /* 0x00000000 */
#define GPIO_PMODE1_1              (0x1 << GPIO_PMODE1_Pos)         /* 0x00000004 */
#define GPIO_PMODE1_2              (0x2 << GPIO_PMODE1_Pos)         /* 0x00000008 */
#define GPIO_PMODE1_3              (0x3 << GPIO_PMODE1_Pos)         /* 0x0000000C */

#define GPIO_PMODE2_Pos            (4)                                   
#define GPIO_PMODE2_Msk            (0x3 << GPIO_PMODE2_Pos)         /* 0x00000030 */               
#define GPIO_PMODE2                        GPIO_PMODE2_Msk          /* 0x00000030 */
#define GPIO_PMODE2_0              (0x0 << GPIO_PMODE2_Pos)         /* 0x00000000 */
#define GPIO_PMODE2_1              (0x1 << GPIO_PMODE2_Pos)         /* 0x00000010 */
#define GPIO_PMODE2_2              (0x2 << GPIO_PMODE2_Pos)         /* 0x00000020 */
#define GPIO_PMODE2_3              (0x3 << GPIO_PMODE2_Pos)         /* 0x00000030 */

#define GPIO_PMODE3_Pos            (6)                                   
#define GPIO_PMODE3_Msk            (0x3 << GPIO_PMODE3_Pos)         /* 0x000000C0 */
#define GPIO_PMODE3                        GPIO_PMODE3_Msk          /* 0x000000C0 */
#define GPIO_PMODE3_0              (0x0 << GPIO_PMODE3_Pos)         /* 0x00000000 */
#define GPIO_PMODE3_1              (0x1 << GPIO_PMODE3_Pos)         /* 0x00000040 */
#define GPIO_PMODE3_2              (0x2 << GPIO_PMODE3_Pos)         /* 0x00000080 */
#define GPIO_PMODE3_3              (0x3 << GPIO_PMODE3_Pos)         /* 0x000000C0 */

