handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for GPIO_AFH register **/
#define GPIO_AFH_AFSEL8            ((uint32_t)0x0000000FU) /* Port x AFH bit (0..3) */
#define GPIO_AFH_AFSEL9            ((uint32_t)0x000000F0U) /* Port x AFH bit (4..7) */
#define GPIO_AFH_AFSEL10           ((uint32_t)0x00000F00U) /* Port x AFH bit (8..11) */
#define GPIO_AFH_AFSEL11           ((uint32_t)0x0000F000U) /* Port x AFH bit (12..15) */
#define GPIO_AFH_AFSEL12           ((uint32_t)0x000F0000U) /* Port x AFH bit (16..19) */
#define GPIO_AFH_AFSEL13           ((uint32_t)0x00F00000U) /* Port x AFH bit (20..23) */
#define GPIO_AFH_AFSEL14           ((uint32_t)0x0F000000U) /* Port x AFH bit (24..27) */
#define GPIO_AFH_AFSEL15           ((uint32_t)0xF0000000U) /* Port x AFH bit (27..31) */

/** Bit definition for GPIO_PBC register **/
#define GPIO_PBC_PBC0              ((uint16_t)0x0001U) /* Port x Reset bit 0  */
#define GPIO_PBC_PBC1              ((uint16_t)0x0002U) /* Port x Reset bit 1  */
#define GPIO_PBC_PBC2              ((uint16_t)0x0004U) /* Port x Reset bit 2  */
#define GPIO_PBC_PBC3              ((uint16_t)0x0008U) /* Port x Reset bit 3  */
#define GPIO_PBC_PBC4              ((uint16_t)0x0010U) /* Port x Reset bit 4  */
#define GPIO_PBC_PBC5              ((uint16_t)0x0020U) /* Port x Reset bit 5  */
#define GPIO_PBC_PBC6              ((uint16_t)0x0040U) /* Port x Reset bit 6  */
#define GPIO_PBC_PBC7              ((uint16_t)0x0080U) /* Port x Reset bit 7  */
#define GPIO_PBC_PBC8              ((uint16_t)0x0100U) /* Port x Reset bit 8  */
#define GPIO_PBC_PBC9              ((uint16_t)0x0200U) /* Port x Reset bit 9  */
#define GPIO_PBC_PBC10             ((uint16_t)0x0400U) /* Port x Reset bit 10 */
#define GPIO_PBC_PBC11             ((uint16_t)0x0800U) /* Port x Reset bit 11 */
#define GPIO_PBC_PBC12             ((uint16_t)0x1000U) /* Port x Reset bit 12 */
#define GPIO_PBC_PBC13             ((uint16_t)0x2000U) /* Port x Reset bit 13 */
#define GPIO_PBC_PBC14             ((uint16_t)0x4000U) /* Port x Reset bit 14 */
#define GPIO_PBC_PBC15             ((uint16_t)0x8000U) /* Port x Reset bit 15 */

/** Bit definition for GPIO_DS register **/
#define GPIO_DS_DS0                ((uint16_t)0x0001U) /* Port x Reset bit 0  */
#define GPIO_DS_DS1                ((uint16_t)0x0002U) /* Port x Reset bit 1  */
#define GPIO_DS_DS2                ((uint16_t)0x0004U) /* Port x Reset bit 2  */
#define GPIO_DS_DS3                ((uint16_t)0x0008U) /* Port x Reset bit 3  */
#define GPIO_DS_DS4                ((uint16_t)0x0010U) /* Port x Reset bit 4  */
#define GPIO_DS_DS5                ((uint16_t)0x0020U) /* Port x Reset bit 5  */
#define GPIO_DS_DS6                ((uint16_t)0x0040U) /* Port x Reset bit 6  */
#define GPIO_DS_DS7                ((uint16_t)0x0080U) /* Port x Reset bit 7  */
#define GPIO_DS_DS8                ((uint16_t)0x0100U) /* Port x Reset bit 8  */
#define GPIO_DS_DS9                ((uint16_t)0x0200U) /* Port x Reset bit 9  */
#define GPIO_DS_DS10               ((uint16_t)0x0400U) /* Port x Reset bit 10 */
#define GPIO_DS_DS11               ((uint16_t)0x0800U) /* Port x Reset bit 11 */
#define GPIO_DS_DS12               ((uint16_t)0x1000U) /* Port x Reset bit 12 */
#define GPIO_DS_DS13               ((uint16_t)0x2000U) /* Port x Reset bit 13 */
#define GPIO_DS_DS14               ((uint16_t)0x4000U) /* Port x Reset bit 14 */
#define GPIO_DS_DS15               ((uint16_t)0x8000U) /* Port x Reset bit 15 */

/** Bit definition for AFIO register **/

/** Bit definition for AFIO_RMP_CFG register **/
#define AFIO_RMP_CFG_IOFLITCFG     ((uint32_t)0x0000001FU)  /* Filter stage control bit (0..4) */
#define AFIO_RMP_CFG_EXTI_ETRR     ((uint32_t)0x00007800U)  /* Selects the EXTI line through which the ETRGREG is remapped */
#define AFIO_RMP_CFG_SPI1_NSS      ((uint32_t)0x00200000U)  /* NSS mode of SPI1 */
#define AFIO_RMP_CFG_SPI2_NSS      ((uint32_t)0x00400000U)  /* NSS mode of SPI2 */
#define AFIO_RMP_CFG_SPI3_NSS      ((uint32_t)0x00800000U)  /* NSS mode of SPI3 */
#define AFIO_RMP_CFG_TIM3CH2       ((uint32_t)0x10000000U)  /* TIM3_CH2 REMAP SLECTION */

/** Bit definition for AFIO_EXTI_CFG1 register **/
#define AFIO_EXTI_CFG1_EXTI0       ((uint32_t)0x0000003FU)  /* EXTI 0 configuration */
#define AFIO_EXTI_CFG1_EXTI1       ((uint32_t)0x00003F00U)  /* EXTI 1 configuration */
#define AFIO_EXTI_CFG1_EXTI2       ((uint32_t)0x003F0000U)  /* EXTI 2 configuration */
#define AFIO_EXTI_CFG1_EXTI3       ((uint32_t)0x3F000000U)  /* EXTI 3 configuration */

/** Bit definition for AFIO_EXTI_CFG1 register **/
#define AFIO_EXTI_CFG1_EXTI0_PA0   ((uint32_t)0x00000001U) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB0   ((uint32_t)0x00000002U) /* PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PC0   ((uint32_t)0x00000004U) /* PC[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD0   ((uint32_t)0x00000008U) /* PD[0] pin */

#define AFIO_EXTI_CFG1_EXTI1_PA1   ((uint32_t)0x00000010U) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB1   ((uint32_t)0x00000020U) /* PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PC1   ((uint32_t)0x00000040U) /* PC[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD1   ((uint32_t)0x00000080U) /* PD[1] pin */

#define AFIO_EXTI_CFG1_EXTI2_PA2   ((uint32_t)0x00000100U) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB2   ((uint32_t)0x00000200U) /* PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PC2   ((uint32_t)0x00000400U) /* PC[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD2   ((uint32_t)0x00000800U) /* PD[2] pin */

#define AFIO_EXTI_CFG1_EXTI3_PA3   ((uint32_t)0x0C001000U) /* PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB3   ((uint32_t)0x0D002000U) /* PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PC3   ((uint32_t)0x00004000U) /* PC[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD3   ((uint32_t)0x00008000U) /* PD[3] pin */

/** Bit definition for AFIO_EXTI_CFG2 register **/
#define AFIO_EXTI_CFG2_EXTI4       ((uint32_t)0x0000003FU)  /* EXTI 4 configuration */
#define AFIO_EXTI_CFG2_EXTI5       ((uint32_t)0x00003F00U)  /* EXTI 5 configuration */
#define AFIO_EXTI_CFG2_EXTI6       ((uint32_t)0x003F0000U)  /* EXTI 6 configuration */
#define AFIO_EXTI_CFG2_EXTI7       ((uint32_t)0x3F000000U)  /* EXTI 7 configuration */

/** Bit definition for AFIO_EXTI_CFG2 register **/
#define AFIO_EXTI_CFG2_EXTI4_PA4   ((uint32_t)0x00000001U) /* PA[4] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB4   ((uint32_t)0x00000002U) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI4_PC4   ((uint32_t)0x00000004U) /* PC[4] pin */
#define AFIO_EXTI_CFG2_EXTI4_PD4   ((uint32_t)0x00000008U) /* PD[4] pin */

#define AFIO_EXTI_CFG2_EXTI5_PA5   ((uint32_t)0x00000010U) /* PA[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB5   ((uint32_t)0x00000020U) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PC5   ((uint32_t)0x00000040U) /* PC[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PD5   ((uint32_t)0x00000080U) /* PD[5] pin */

#define AFIO_EXTI_CFG2_EXTI6_PA6   ((uint32_t)0x00000100U) /* PA[6] pin */
#define AFIO_EXTI_CFG2_EXTI6_PB6   ((uint32_t)0x00000200U) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI6_PC6   ((uint32_t)0x00000400U) /* PC[6] pin */
#define AFIO_EXTI_CFG2_EXTI6_PD6   ((uint32_t)0x00000800U) /* PD[6] pin */

#define AFIO_EXTI_CFG2_EXTI7_PA7   ((uint32_t)0x00001000U) /* PA[7] pin */
#define AFIO_EXTI_CFG2_EXTI7_PB7   ((uint32_t)0x00002000U) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI7_PC7   ((uint32_t)0x00004000U) /* PC[7] pin */
#define AFIO_EXTI_CFG2_EXTI7_PD7   ((uint32_t)0x00008000U) /* PD[7] pin */

/** Bit definition for AFIO_EXTI_CFG3 register **/
#define AFIO_EXTI_CFG2_EXTI8       ((uint32_t)0x0000003FU)  /* EXTI 8 configuration */
#define AFIO_EXTI_CFG2_EXTI9       ((uint32_t)0x00003F00U)  /* EXTI 9 configuration */
#define AFIO_EXTI_CFG2_EXTI10      ((uint32_t)0x003F0000U)  /* EXTI 10 configuration */
#define AFIO_EXTI_CFG2_EXTI11      ((uint32_t)0x3F000000U)  /* EXTI 11 configuration */

/** Bit definition for AFIO_EXTI_CFG3 register **/
#define AFIO_EXTI_CFG3_EXTI8_PA8   ((uint32_t)0x00000001U) /* PA[8] pin */
#define AFIO_EXTI_CFG3_EXTI8_PB8   ((uint32_t)0x00000002U) /* PB[8] pin */
#define AFIO_EXTI_CFG3_EXTI8_PC8   ((uint32_t)0x00000004U) /* PC[8] pin */
#define AFIO_EXTI_CFG3_EXTI8_PD8   ((uint32_t)0x00000008U) /* PD[8] pin */

#define AFIO_EXTI_CFG3_EXTI9_PA9   ((uint32_t)0x00000010U) /* PA[9] pin */
#define AFIO_EXTI_CFG3_EXTI9_PB9   ((uint32_t)0x00000020U) /* PB[9] pin */
#define AFIO_EXTI_CFG3_EXTI9_PC9   ((uint32_t)0x00000040U) /* PC[9] pin */
#define AFIO_EXTI_CFG3_EXTI9_PD9   ((uint32_t)0x00000080U) /* PD[9] pin */

#define AFIO_EXTI_CFG3_EXTI10_PA10 ((uint32_t)0x00000100U) /* PA[10] pin */
#define AFIO_EXTI_CFG3_EXTI10_PB10 ((uint32_t)0x00000200U) /* PB[10] pin */
#define AFIO_EXTI_CFG3_EXTI10_PC10 ((uint32_t)0x00000400U) /* PC[10] pin */
#define AFIO_EXTI_CFG3_EXTI10_PD10 ((uint32_t)0x00000800U) /* PD[10] pin */

#define AFIO_EXTI_CFG3_EXTI11_PA11 ((uint32_t)0x00001000U) /* PA[11] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB11 ((uint32_t)0x00002000U) /* PB[11] pin */
#define AFIO_EXTI_CFG3_EXTI11_PC11 ((uint32_t)0x00004000U) /* PC[11] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD11 ((uint32_t)0x00008000U) /* PD[11] pin */

/** Bit definition for AFIO_EXTI_CFG4 register **/
#define AFIO_EXTI_CFG2_EXTI12      ((uint32_t)0x0000003FU)  /* EXTI 12 configuration */
#define AFIO_EXTI_CFG2_EXTI13      ((uint32_t)0x00003F00U)  /* EXTI 13 configuration */
#define AFIO_EXTI_CFG2_EXTI14      ((uint32_t)0x003F0000U)  /* EXTI 14 configuration */
#define AFIO_EXTI_CFG2_EXTI15      ((uint32_t)0x3F000000U)  /* EXTI 15 configuration */

/** Bit definition for AFIO_EXTI_CFG4 register **/
#define AFIO_EXTI_CFG4_EXTI12_PA12   ((uint32_t)0x00000001U) /* PA[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB12   ((uint32_t)0x00000002U) /* PB[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PC12   ((uint32_t)0x00000004U) /* PC[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD12   ((uint32_t)0x00000008U) /* PD[12] pin */

#define AFIO_EXTI_CFG4_EXTI13_PA13   ((uint32_t)0x00000010U) /* PA[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB13   ((uint32_t)0x00000020U) /* PB[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PC13   ((uint32_t)0x00000040U) /* PC[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD13   ((uint32_t)0x00000080U) /* PD[13] pin */

#define AFIO_EXTI_CFG4_EXTI14_PA14   ((uint32_t)0x00000100U) /* PA[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB14   ((uint32_t)0x00000200U) /* PB[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PC14   ((uint32_t)0x00000400U) /* PC[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD14   ((uint32_t)0x00000800U) /* PD[14] pin */

#define AFIO_EXTI_CFG4_EXTI15_PA15   ((uint32_t)0x00001000U) /* PA[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB15   ((uint32_t)0x00002000U) /* PB[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PC15   ((uint32_t)0x00004000U) /* PC[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD15   ((uint32_t)0x00008000U) /* PD[15] pin */

/** Bit definition for AFIO_DIGEFT_CFG1 register **/
#define AFIO_DIGEFT_CFG1_PA0DIGEFTEN  ((uint32_t)0x00000001U) /* PA[0]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA1DIGEFTEN  ((uint32_t)0x00000002U) /* PA[1]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA2DIGEFTEN  ((uint32_t)0x00000004U) /* PA[2]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA3DIGEFTEN  ((uint32_t)0x00000008U) /* PA[3]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA4DIGEFTEN  ((uint32_t)0x00000010U) /* PA[4]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA5DIGEFTEN  ((uint32_t)0x00000020U) /* PA[5]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA6DIGEFTEN  ((uint32_t)0x00000040U) /* PA[6]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA7DIGEFTEN  ((uint32_t)0x00000080U) /* PA[7]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA8DIGEFTEN  ((uint32_t)0x00000100U) /* PA[8]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA9DIGEFTEN  ((uint32_t)0x00000200U) /* PA[9]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA10DIGEFTEN ((uint32_t)0x00000400U) /* PA[10] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA11DIGEFTEN ((uint32_t)0x00000800U) /* PA[11] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA12DIGEFTEN ((uint32_t)0x00001000U) /* PA[12] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA13DIGEFTEN ((uint32_t)0x00002000U) /* PA[13] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA14DIGEFTEN ((uint32_t)0x00004000U) /* PA[14] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA15DIGEFTEN ((uint32_t)0x00008000U) /* PA[15] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB0DIGEFTEN  ((uint32_t)0x00010000U) /* PB[0]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB1DIGEFTEN  ((uint32_t)0x00020000U) /* PB[1]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB2DIGEFTEN  ((uint32_t)0x00040000U) /* PB[2]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB3DIGEFTEN  ((uint32_t)0x00080000U) /* PB[3]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB4DIGEFTEN  ((uint32_t)0x00100000U) /* PB[4]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB5DIGEFTEN  ((uint32_t)0x00200000U) /* PB[5]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB6DIGEFTEN  ((uint32_t)0x00400000U) /* PB[6]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB7DIGEFTEN  ((uint32_t)0x00800000U) /* PB[7]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB8DIGEFTEN  ((uint32_t)0x01000000U) /* PB[8]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB9DIGEFTEN  ((uint32_t)0x02000000U) /* PB[9]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB10DIGEFTEN ((uint32_t)0x04000000U) /* PB[10] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB11DIGEFTEN ((uint32_t)0x08000000U) /* PB[11] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB12DIGEFTEN ((uint32_t)0x10000000U) /* PB[12] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB13DIGEFTEN ((uint32_t)0x20000000U) /* PB[13] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB14DIGEFTEN ((uint32_t)0x40000000U) /* PB[14] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB15DIGEFTEN ((uint32_t)0x80000000U) /* PB[15] DIGEFT IE */

