handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define DMA_CHCFG5_MSIZE     ((uint16_t)0x0C00U) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG5_MSIZE_0   ((uint16_t)0x0400U) /* Bit 0 */
#define DMA_CHCFG5_MSIZE_1   ((uint16_t)0x0800U) /* Bit 1 */

#define DMA_CHCFG5_PRIOLVL   ((uint16_t)0x3000U) /* PRIOLVL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG5_PRIOLVL_0 ((uint16_t)0x1000U) /* Bit 0 */
#define DMA_CHCFG5_PRIOLVL_1 ((uint16_t)0x2000U) /* Bit 1 */

#define DMA_CHCFG5_MEM2MEM   ((uint16_t)0x4000U) /* Memory to memory mode */

/** Bit definition for DMA_TXNUM1 register **/
#define DMA_TXNUM1_NDTX ((uint16_t)0xFFFFU) /* CH1 number of data to transfer */

/** Bit definition for DMA_TXNUM2 register **/
#define DMA_TXNUM2_NDTX ((uint16_t)0xFFFFU) /* CH2 number of data to transfer */

/** Bit definition for DMA_TXNUM3 register **/
#define DMA_TXNUM3_NDTX ((uint16_t)0xFFFFU) /* CH3 number of data to transfer */

/** Bit definition for DMA_TXNUM4 register **/
#define DMA_TXNUM4_NDTX ((uint16_t)0xFFFFU) /* CH4 number of data to transfer */

/** Bit definition for DMA_TXNUM5 register **/
#define DMA_TXNUM5_NDTX ((uint16_t)0xFFFFU) /* CH5 number of data to transfer */

/** Bit definition for DMA_PADDR1 register **/
#define DMA_PADDR1_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH1 */

/** Bit definition for DMA_PADDR2 register **/
#define DMA_PADDR2_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH2 */

/** Bit definition for DMA_PADDR3 register **/
#define DMA_PADDR3_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH3 */

/** Bit definition for DMA_PADDR4 register **/
#define DMA_PADDR4_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH4 */

/** Bit definition for DMA_PADDR5 register **/
#define DMA_PADDR5_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH5 */

/** Bit definition for DMA_MADDR1 register **/
#define DMA_MADDR1_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH1 */

/** Bit definition for DMA_MADDR2 register **/
#define DMA_MADDR2_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH2 */

/** Bit definition for DMA_MADDR3 register **/
#define DMA_MADDR3_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH3 */

/** Bit definition for DMA_MADDR4 register **/
#define DMA_MADDR4_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH4 */

/** Bit definition for DMA_MADDR5 register **/
#define DMA_MADDR5_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH5 */

/** Bit definition for DMA_CHSELx(x=1~5) register  ***/
#define DMA_CHSEL_CH_SEL   ((uint32_t)0x0000003FU) /* CH_SEL[5:0]: Channel request select */
#define DMA_CHSEL_CH_SEL_0 ((uint32_t)0x00000001U) /* bit0 */
#define DMA_CHSEL_CH_SEL_1 ((uint32_t)0x00000002U) /* bit1 */
#define DMA_CHSEL_CH_SEL_2 ((uint32_t)0x00000004U) /* bit2 */
#define DMA_CHSEL_CH_SEL_3 ((uint32_t)0x00000008U) /* bit3 */
#define DMA_CHSEL_CH_SEL_4 ((uint32_t)0x00000010U) /* bit4 */
#define DMA_CHSEL_CH_SEL_5 ((uint32_t)0x00000020U) /* bit5 */

//*** Analog to Digital Converter ***/

/** Bit definition for ADC_STS register **/
#define ADC_STS_AWDG                        ((uint8_t)0x01U) /* Analog watchdog flag */
#define ADC_STS_ENDC                        ((uint8_t)0x02U) /* End of conversion */
#define ADC_STS_STR                         ((uint8_t)0x04U) /* Regular channel Start flag */
#define ADC_STS_ENDCA                       ((uint8_t)0x08U) /* Regular channel any end flag */

/** Bit definition for ADC_CTRL1 register **/
#define ADC_CTRL1_AWDGCH                    ((uint32_t)0x0000001FU) /* AWDG_CH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CTRL1_AWDGCH_0                  ((uint32_t)0x00000001U) /* Bit 0 */
#define ADC_CTRL1_AWDGCH_1                  ((uint32_t)0x00000002U) /* Bit 1 */
#define ADC_CTRL1_AWDGCH_2                  ((uint32_t)0x00000004U) /* Bit 2 */
#define ADC_CTRL1_AWDGCH_3                  ((uint32_t)0x00000008U) /* Bit 3 */
#define ADC_CTRL1_AWDGCH_4                  ((uint32_t)0x00000010U) /* Bit 4 */

#define ADC_CTRL1_ENDCIEN                   ((uint32_t)0x00000020U) /* Interrupt enable for EOC */
#define ADC_CTRL1_AWDGIEN                   ((uint32_t)0x00000040U) /* Analog Watchdog interrupt enable */
#define ADC_CTRL1_AWDGSGLEN                 ((uint32_t)0x00000080U) /* Enable the watchdog on a single channel in scan mode */
#define ADC_CTRL1_AWDGERCH                  ((uint32_t)0x00000100U) /* Analog watchdog enable on regular channels */
#define ADC_CTRL1_REFSEL                  	((uint32_t)0x00000400U) /* ADC Reference Source Select */

/** Bit definition for ADC_CTRL2 register **/
#define ADC_CTRL2_ON                        ((uint32_t)0x00000001U) /* A/D Converter ON / OFF */
#define ADC_CTRL2_CTU                       ((uint32_t)0x00000002U) /* Continuous Conversion */
#define ADC_CTRL2_ALIG                      ((uint32_t)0x00000004U) /* Data Alignment */

#define ADC_CTRL2_EXTRSEL                   ((uint32_t)0x00000078U) /* EXTSEL[3:0] bits (External Event Select for regular group) */
#define ADC_CTRL2_EXTRSEL_0                 ((uint32_t)0x00000080U) /* Bit 0 */
#define ADC_CTRL2_EXTRSEL_1                 ((uint32_t)0x00000010U) /* Bit 1 */
#define ADC_CTRL2_EXTRSEL_2                 ((uint32_t)0x00080020U) /* Bit 2 */
#define ADC_CTRL2_EXTRSEL_3                 ((uint32_t)0x00080040U) /* Bit 3 */

#define ADC_CTRL2_EXTRTRIG                  ((uint32_t)0x00000080U) /* External Trigger Conversion mode for regular channels */
#define ADC_CTRL2_SWSTRRCH                  ((uint32_t)0x00000100U) /* Start Conversion of regular channels */

#define ADC_CTRL2_LEN                       ((uint32_t)0x00000E00U) /* LEN[2:0] bits (Regular Sequence length) */
#define ADC_CTRL2_LEN_0                     ((uint32_t)0x00000200U) /* Bit 0 */
#define ADC_CTRL2_LEN_1                     ((uint32_t)0x00000400U) /* Bit 1 */
#define ADC_CTRL2_LEN_2                     ((uint32_t)0x00000800U) /* Bit 2 */

#define ADC_CTRL2_SCANMD                    ((uint32_t)0x00001000U) /* Scan mode */
#define ADC_CTRL2_ENDMA                     ((uint32_t)0x00002000U) /* DMA function switch */
#define ADC_CTRL2_TEMPEN                    ((uint32_t)0x00004000U) /* Temperature sensor switch */

