handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for ADC_CTRL3 register **/
#define ADC_CTRL3_VREFEN                    ((uint16_t)0x0002U) /* ADC VREFINT_EN */
#define ADC_CTRL3_VREFRDY                   ((uint16_t)0x0004U) /* ADC VREFINT_READY */
#define ADC_CTRL3_RDY                       ((uint16_t)0x0008U) /* ADC Ready */
#define ADC_CTRL3_PDRDY                     ((uint16_t)0x0010U) /* ADC Power_down Ready */
#define ADC_CTRL3_ENDCAIEN                  ((uint16_t)0x0020U) /* Interrupt enable for any regular channels */

/** Bit definition for ADC_SAMPT register **/
#define ADC_SAMPT_SAMP                      ((uint32_t)0x00000001FU) /* SMP10[4:0] bits (Channel Sample time selection) */
#define ADC_SAMPT_SAMP_0                    ((uint32_t)0x00000001U)  /* Bit 0 */
#define ADC_SAMPT_SAMP_1                    ((uint32_t)0x00000002U)  /* Bit 1 */
#define ADC_SAMPT_SAMP_2                    ((uint32_t)0x00000004U)  /* Bit 2 */
#define ADC_SAMPT_SAMP_3                    ((uint32_t)0x00000008U)  /* Bit 3 */
#define ADC_SAMPT_SAMP_4                    ((uint32_t)0x00000010U)  /* Bit 4 */

/** Bit definition for ADC_WDGHIGH register **/
#define ADC_WDGHIGH_HTH                     ((uint16_t)0x0FFFU)  /* Analog watchdog high threshold */

/** Bit definition for ADC_WDGLOW register **/
#define ADC_WDGLOW_LTH                      ((uint16_t)0x0FFFU)  /* Analog watchdog low threshold */

/** Bit definition for ADC_DATA0 register **/
#define ADC_DAT0_DAT                        ((uint32_t)0x0000FFFFU) /* Regular data */
#define ADC_DAT0_SEQ0                       ((uint32_t)0x001F0000U) /* channel seqence of conversion */
#define ADC_DAT0_SEQ0_0                     ((uint32_t)0x00010000U) /* Bit 0 */
#define ADC_DAT0_SEQ0_1                     ((uint32_t)0x00020000U) /* Bit 1 */
#define ADC_DAT0_SEQ0_2                     ((uint32_t)0x00040000U) /* Bit 2 */
#define ADC_DAT0_SEQ0_3                     ((uint32_t)0x00080000U) /* Bit 3 */
#define ADC_DAT0_SEQ0_4                     ((uint32_t)0x00100000U) /* Bit 4 */

/** Bit definition for ADC_DATA1 register **/
#define ADC_DAT1_DAT                        ((uint32_t)0x0000FFFFU) /* Regular data */
#define ADC_DAT1_SEQ1                       ((uint32_t)0x001F0000U) /* channel seqence of conversion */
#define ADC_DAT1_SEQ1_0                     ((uint32_t)0x00010000U) /* Bit 0 */
#define ADC_DAT1_SEQ1_1                     ((uint32_t)0x00020000U) /* Bit 1 */
#define ADC_DAT1_SEQ1_2                     ((uint32_t)0x00040000U) /* Bit 2 */
#define ADC_DAT1_SEQ1_3                     ((uint32_t)0x00080000U) /* Bit 3 */
#define ADC_DAT0_SEQ1_4                     ((uint32_t)0x00100000U) /* Bit 4 */

/** Bit definition for ADC_DATA2 register **/
#define ADC_DAT2_DAT                        ((uint32_t)0x0000FFFFU) /* Regular data */
#define ADC_DAT2_SEQ2                       ((uint32_t)0x001F0000U) /* channel seqence of conversion */
#define ADC_DAT2_SEQ2_0                     ((uint32_t)0x00010000U) /* Bit 0 */
#define ADC_DAT2_SEQ2_1                     ((uint32_t)0x00020000U) /* Bit 1 */
#define ADC_DAT2_SEQ2_2                     ((uint32_t)0x00040000U) /* Bit 2 */
#define ADC_DAT2_SEQ2_3                     ((uint32_t)0x00080000U) /* Bit 3 */
#define ADC_DAT0_SEQ2_4                     ((uint32_t)0x00100000U) /* Bit 4 */

/** Bit definition for ADC_DATA3 register **/
#define ADC_DAT3_DAT                        ((uint32_t)0x0000FFFFU) /* Regular data */
#define ADC_DAT3_SEQ3                       ((uint32_t)0x001F0000U) /* channel seqence of conversion */
#define ADC_DAT3_SEQ3_0                     ((uint32_t)0x00010000U) /* Bit 0 */
#define ADC_DAT3_SEQ3_1                     ((uint32_t)0x00020000U) /* Bit 1 */
#define ADC_DAT3_SEQ3_2                     ((uint32_t)0x00040000U) /* Bit 2 */
#define ADC_DAT3_SEQ3_3                     ((uint32_t)0x00080000U) /* Bit 3 */
#define ADC_DAT3_SEQ0_4                     ((uint32_t)0x00100000U) /* Bit 4 */

/** Bit definition for ADC_DATA4 register **/
#define ADC_DAT4_DAT                        ((uint32_t)0x0000FFFFU) /* Regular data */
#define ADC_DAT4_SEQ4                       ((uint32_t)0x001F0000U) /* channel seqence of conversion */
#define ADC_DAT4_SEQ4_0                     ((uint32_t)0x00010000U) /* Bit 0 */
#define ADC_DAT4_SEQ4_1                     ((uint32_t)0x00020000U) /* Bit 1 */
#define ADC_DAT4_SEQ4_2                     ((uint32_t)0x00040000U) /* Bit 2 */
#define ADC_DAT4_SEQ4_3                     ((uint32_t)0x00080000U) /* Bit 3 */
#define ADC_DAT4_SEQ0_4                     ((uint32_t)0x00100000U) /* Bit 4 */
/***LCD Controller ***/

/** Bit definition for LCD_CTRL register **/
#define LCD_CTRL_BUFEN              ((uint32_t)0x00000100U)          /* High driving capacity buffer enable bit*/

#define LCD_CTRL_BIAS               ((uint32_t)0x00000060U)          /* Bias[1:0] bits (Bias selection) */
#define LCD_CTRL_BIAS_0             ((uint32_t)0x00000020U)          /* Bit 0 */
#define LCD_CTRL_BIAS_1             ((uint32_t)0x00000040U)          /* Bit 1 */

#define LCD_CTRL_DUTY               ((uint32_t)0x0000001CU)          /* DUTY[2:0] bits (Duty selection) */
#define LCD_CTRL_DUTY_0             ((uint32_t)0x00000004U)          /* Bit 0 */
#define LCD_CTRL_DUTY_1             ((uint32_t)0x00000008U)          /* Bit 1 */
#define LCD_CTRL_DUTY_2             ((uint32_t)0x00000010U)          /* Bit 2 */

#define LCD_CTRL_VSEL               ((uint32_t)0x00000002U)          /* LCD driver contrast control bit */
#define LCD_CTRL_EN                 ((uint32_t)0x00000001U)          /* LCD controller enable bit */

/** Bit definition for LCD_FCTRL register **/
#define LCD_FCTRL_PRES              ((uint32_t)0x07800000U)          /* 4-bit prescaler bit*/
#define LCD_FCTRL_PRES_0            ((uint32_t)0x00800000U)
#define LCD_FCTRL_PRES_1            ((uint32_t)0x01000000U)
#define LCD_FCTRL_PRES_2            ((uint32_t)0x02000000U)
#define LCD_FCTRL_PRES_3            ((uint32_t)0x04000000U)

#define LCD_FCTRL_DIV               ((uint32_t)0x00780000U)          /* DIV clock divider bit*/
#define LCD_FCTRL_DIV_0             ((uint32_t)0x00080000U)
#define LCD_FCTRL_DIV_1             ((uint32_t)0x00100000U)
#define LCD_FCTRL_DIV_2             ((uint32_t)0x00200000U)
#define LCD_FCTRL_DIV_3             ((uint32_t)0x00400000U)

#define LCD_FCTRL_BLINK             ((uint32_t)0x00060000U)          /* Blink mode selection bit*/
#define LCD_FCTRL_BLINK_0           ((uint32_t)0x00020000U)
#define LCD_FCTRL_BLINK_1           ((uint32_t)0x00040000U)

#define LCD_FCTRL_BLINKF            ((uint32_t)0x0001C000U)          /* Blink frequency selection bit*/
#define LCD_FCTRL_BLINKF_0          ((uint32_t)0x00004000U)
#define LCD_FCTRL_BLINKF_1          ((uint32_t)0x00008000U)
#define LCD_FCTRL_BLINKF_2          ((uint32_t)0x00010000U)

