handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define LCD_FCTRL_CONTRAST          ((uint32_t)0x00003C00U)          /* Contrast Control bit*/
#define LCD_FCTRL_CONTRAST_0        ((uint32_t)0x00000400U)
#define LCD_FCTRL_CONTRAST_1        ((uint32_t)0x00000800U)
#define LCD_FCTRL_CONTRAST_2        ((uint32_t)0x00001000U)
#define LCD_FCTRL_CONTRAST_3        ((uint32_t)0x00002000U)

#define LCD_FCTRL_DEAD              ((uint32_t)0x00000380U)          /* Dead time duration bit*/
#define LCD_FCTRL_DEAD_0            ((uint32_t)0x00000080U)
#define LCD_FCTRL_DEAD_1            ((uint32_t)0x00000100U)
#define LCD_FCTRL_DEAD_2            ((uint32_t)0x00000200U)

#define LCD_FCTRL_PULSEON           ((uint32_t)0x00000070U)          /* Pulse on duration bit*/
#define LCD_FCTRL_PULSEON_0         ((uint32_t)0x00000010U) 
#define LCD_FCTRL_PULSEON_1         ((uint32_t)0x00000020U)
#define LCD_FCTRL_PULSEON_2         ((uint32_t)0x00000040U)

#define LCD_FCTRL_UDDIE             ((uint32_t)0x00000008U)          /* Update display done interrupt enable bit*/
#define LCD_FCTRL_SOFIE             ((uint32_t)0x00000002U)          /* Start of frame interrupt enable bit */
#define LCD_FCTRL_HDEN              ((uint32_t)0x00000001U)          /* High drive enable bit */

/** Bit definition for LCD_STS register **/
#define LCD_STS_FCRSF               ((uint32_t)0x00000020U)          /* LCD Frame Control Register Synchronization flag bit*/
#define LCD_STS_RDY                 ((uint32_t)0x00000010U)          /* VLCD Ready Flag bit*/
#define LCD_STS_UDD                 ((uint32_t)0x00000008U)          /* Update Display Done bit*/
#define LCD_STS_UDR                 ((uint32_t)0x00000004U)          /* Update Display Request bit*/
#define LCD_STS_SOF                 ((uint32_t)0x00000002U)          /* Start of Frame flag*/
#define LCD_STS_ENSTS               ((uint32_t)0x00000001U)          /* LCD state bit*/

/** Bit definition for LCD_CLR register **/
#define LCD_CLR_UDDCLR              ((uint32_t)0x00000008U)          /* Update display done clear bit*/
#define LCD_CLR_SOFCLR              ((uint32_t)0x00000002U)          /* Start of frame flag clear bit*/

/** Bit definition for LCD_RAM register **/
#define LCD_RAM_SEG_DATA_RAM1_Msk           ((uint32_t)0xFFFFFFFFULU)
#define LCD_RAM_SEG_DATA_RAM2_Msk           ((uint32_t)0x0000001FULU)


/***  Comparators Peripheral Interface ***/
/** COMP1_CTRL register **/
#define COMP1_CTRL_EN        ((uint32_t)0x00000001U)     /* Comparator_1 enable */

#define COMP1_CTRL_INMSEL    ((uint32_t)0x0000001EU)     /* Inverting input select of Comparator_1 */
#define COMP1_CTRL_INMSEL_0  ((uint32_t)0x00000002U)     /* Bit 0 */
#define COMP1_CTRL_INMSEL_1  ((uint32_t)0x00000004U)     /* Bit 1 */
#define COMP1_CTRL_INMSEL_2  ((uint32_t)0x00000008U)     /* Bit 2 */
#define COMP1_CTRL_INMSEL_3  ((uint32_t)0x00000010U)     /* Bit 3 */

#define COMP1_CTRL_INPSEL    ((uint32_t)0x000000E0U)     /* Non inverting input select of Comparator_1 */
#define COMP1_CTRL_INPSEL_0  ((uint32_t)0x00000020U)     /* Bit 0 */
#define COMP1_CTRL_INPSEL_1  ((uint32_t)0x00000040U)     /* Bit 1 */
#define COMP1_CTRL_INPSEL_2  ((uint32_t)0x00000080U)     /* Bit 2 */

#define COMP1_CTRL_OUTSEL    ((uint32_t)0x00000F00U)     /* Output select of Comparator_1 */
#define COMP1_CTRL_OUTSEL_0  ((uint32_t)0x00000100U)     /* Bit 0 */
#define COMP1_CTRL_OUTSEL_1  ((uint32_t)0x00000200U)     /* Bit 1 */ 
#define COMP1_CTRL_OUTSEL_2  ((uint32_t)0x00000400U)     /* Bit 2 */ 
#define COMP1_CTRL_OUTSEL_3  ((uint32_t)0x00000800U)     /* Bit 3 */ 
 
#define COMP1_CTRL_POL       ((uint32_t)0x00001000U)     /* Output polarity select of Comparator_1 */

#define COMP1_CTRL_HYST      ((uint32_t)0x00006000U)     /* Hysteresis level select of Comparator_1 */
#define COMP1_CTRL_HYST_0    ((uint32_t)0x00002000U)     /* Bit 0 */
#define COMP1_CTRL_HYST_1    ((uint32_t)0x00004000U)     /* Bit 1 */

#define COMP1_CTRL_BLKING    ((uint32_t)0x00038000U)     /* Blanking source select of Comparator_1 */
#define COMP1_CTRL_BLKING_0  ((uint32_t)0x00008000U)     /* Bit 0 */
#define COMP1_CTRL_BLKING_1  ((uint32_t)0x00010000U)     /* Bit 1 */
#define COMP1_CTRL_BLKING_2  ((uint32_t)0x00020000U)     /* Bit 2 */

#define COMP1_CTRL_OUT       ((uint32_t)0x00040000U)     /* Output state of Comparator_1 */

#define COMP1_CTRL_FILP_OUT ((uint32_t)0x00080000U)     /* Output state of Comparator_1 Fiter */

/** COMP1_FILC register **/
#define COMP1_FILC_FILEN     ((uint32_t)0x00000001U)     /* Comparator_1 filter enable */
#define COMP1_FILC_THRESH    ((uint32_t)0x0000003EU)     /* Comparator_1 filter threshold size */
#define COMP1_FILC_SAMPW     ((uint32_t)0x000007C0U)     /* Comparator_1 filter window size */

/** COMP1_FILP register **/
#define COMP1_FILP_CLKPSC    ((uint32_t)0x0000FFFFU)     /* Comparator_1 filter sample clock prescale */

/** COMP2_CTRL register **/
#define COMP2_CTRL_EN        ((uint32_t)0x00000001U)     /* Comparator_2 enable */

#define COMP2_CTRL_INMSEL    ((uint32_t)0x0000001EU)     /* Inverting input select of Comparator_2 */
#define COMP2_CTRL_INMSEL_0  ((uint32_t)0x00000002U)     /* Bit 0 */
#define COMP2_CTRL_INMSEL_1  ((uint32_t)0x00000004U)     /* Bit 1 */
#define COMP2_CTRL_INMSEL_2  ((uint32_t)0x00000008U)     /* Bit 2 */
#define COMP2_CTRL_INMSEL_3  ((uint32_t)0x00000010U)     /* Bit 3 */

#define COMP2_CTRL_INPSEL    ((uint32_t)0x000000E0U)     /* Non inverting input select of Comparator_2 */
#define COMP2_CTRL_INPSEL_0  ((uint32_t)0x00000020U)     /* Bit 0 */
#define COMP2_CTRL_INPSEL_1  ((uint32_t)0x00000040U)     /* Bit 1 */
#define COMP2_CTRL_INPSEL_2  ((uint32_t)0x00000080U)     /* Bit 2 */

#define COMP2_CTRL_OUTSEL    ((uint32_t)0x00000F00U)     /* Output select of Comparator_2 */
#define COMP2_CTRL_OUTSEL_0  ((uint32_t)0x00000100U)     /* Bit 0 */
#define COMP2_CTRL_OUTSEL_1  ((uint32_t)0x00000200U)     /* Bit 1 */ 
#define COMP2_CTRL_OUTSEL_2  ((uint32_t)0x00000400U)     /* Bit 2 */ 
#define COMP2_CTRL_OUTSEL_3  ((uint32_t)0x00000800U)     /* Bit 3 */ 
 
#define COMP2_CTRL_POL       ((uint32_t)0x00001000U)     /* Output polarity select of Comparator_2 */

#define COMP2_CTRL_HYST      ((uint32_t)0x00006000U)     /* Hysteresis level select of Comparator_2 */
#define COMP2_CTRL_HYST_0    ((uint32_t)0x00002000U)     /* Bit 0 */
#define COMP2_CTRL_HYST_1    ((uint32_t)0x00004000U)     /* Bit 1 */

