handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
#define COMP2_CTRL_BLKING    ((uint32_t)0x00038000U)     /* Blanking source select of Comparator_2 */
#define COMP2_CTRL_BLKING_0  ((uint32_t)0x00008000U)     /* Bit 0 */
#define COMP2_CTRL_BLKING_1  ((uint32_t)0x00010000U)     /* Bit 1 */
#define COMP2_CTRL_BLKING_2  ((uint32_t)0x00020000U)     /* Bit 2 */

#define COMP2_CTRL_OUT       ((uint32_t)0x00040000U)     /* Output state of Comparator_2 */

#define COMP2_CTRL_FILP_OUT  ((uint32_t)0x00080000U)     /* Output state of Comparator_2 Fiter */

/** COMP2_FILC register **/
#define COMP2_FILC_FILEN     ((uint32_t)0x00000001U)     /* Comparator_2 filter enable */
#define COMP2_FILC_THRESH    ((uint32_t)0x0000003EU)     /* Comparator_2 filter threshold size */
#define COMP2_FILC_SAMPW     ((uint32_t)0x000007C0U)     /* Comparator_2 filter window size */

/** COMP2_FILP register **/
#define COMP2_FILP_CLKPSC    ((uint32_t)0x0000FFFFU)     /* Comparator_2 filter sample clock prescale */

/** COMP3_CTRL register **/
#define COMP3_CTRL_EN        ((uint32_t)0x00000001U)     /* Comparator_3 enable */

#define COMP3_CTRL_INMSEL    ((uint32_t)0x0000001EU)     /* Inverting input select of Comparator_3 */
#define COMP3_CTRL_INMSEL_0  ((uint32_t)0x00000002U)     /* Bit 0 */
#define COMP3_CTRL_INMSEL_1  ((uint32_t)0x00000004U)     /* Bit 1 */
#define COMP3_CTRL_INMSEL_2  ((uint32_t)0x00000008U)     /* Bit 2 */
#define COMP3_CTRL_INMSEL_3  ((uint32_t)0x00000010U)     /* Bit 3 */

#define COMP3_CTRL_INPSEL    ((uint32_t)0x000000E0U)     /* Non inverting input select of Comparator_3 */
#define COMP3_CTRL_INPSEL_0  ((uint32_t)0x00000020U)     /* Bit 0 */
#define COMP3_CTRL_INPSEL_1  ((uint32_t)0x00000040U)     /* Bit 1 */
#define COMP3_CTRL_INPSEL_2  ((uint32_t)0x00000080U)     /* Bit 2 */

#define COMP3_CTRL_OUTSEL    ((uint32_t)0x00000F00U)     /* Output select of Comparator_3 */
#define COMP3_CTRL_OUTSEL_0  ((uint32_t)0x00000100U)     /* Bit 0 */
#define COMP3_CTRL_OUTSEL_1  ((uint32_t)0x00000200U)     /* Bit 1 */ 
#define COMP3_CTRL_OUTSEL_2  ((uint32_t)0x00000400U)     /* Bit 2 */ 
#define COMP3_CTRL_OUTSEL_3  ((uint32_t)0x00000800U)     /* Bit 3 */ 
 
#define COMP3_CTRL_POL       ((uint32_t)0x00001000U)     /* Output polarity select of Comparator_3 */

#define COMP3_CTRL_HYST      ((uint32_t)0x00006000U)     /* Hysteresis level select of Comparator_3 */
#define COMP3_CTRL_HYST_0    ((uint32_t)0x00002000U)     /* Bit 0 */
#define COMP3_CTRL_HYST_1    ((uint32_t)0x00004000U)     /* Bit 1 */

#define COMP3_CTRL_BLKING    ((uint32_t)0x00038000U)     /* Blanking source select of Comparator_3 */
#define COMP3_CTRL_BLKING_0  ((uint32_t)0x00008000U)     /* Bit 0 */
#define COMP3_CTRL_BLKING_1  ((uint32_t)0x00010000U)     /* Bit 1 */
#define COMP3_CTRL_BLKING_2  ((uint32_t)0x00020000U)     /* Bit 2 */

#define COMP3_CTRL_OUT       ((uint32_t)0x00040000U)     /* Output state of Comparator_3 */

#define COMP3_CTRL_FILP_OUT  ((uint32_t)0x00080000U)     /* Output state of Comparator_3 Fiter */

/** COMP3_FILC register **/
#define COMP3_FILC_FILEN     ((uint32_t)0x00000001U)     /* Comparator_3 filter enable */
#define COMP3_FILC_THRESH    ((uint32_t)0x0000003EU)     /* Comparator_3 filter threshold size */
#define COMP3_FILC_SAMPW     ((uint32_t)0x000007C0U)     /* Comparator_3 filter window size */

/** COMP3_FILP register **/
#define COMP3_FILP_CLKPSC    ((uint32_t)0x0000FFFFU)     /* Comparator_3 filter sample clock prescale */

/** COMP4_CTRL register **/
#define COMP4_CTRL_EN        ((uint32_t)0x00000001U)     /* Comparator_4 enable */

#define COMP4_CTRL_INMSEL    ((uint32_t)0x0000001EU)     /* Inverting input select of Comparator_4 */
#define COMP4_CTRL_INMSEL_0  ((uint32_t)0x00000002U)     /* Bit 0 */
#define COMP4_CTRL_INMSEL_1  ((uint32_t)0x00000004U)     /* Bit 1 */
#define COMP4_CTRL_INMSEL_2  ((uint32_t)0x00000008U)     /* Bit 2 */
#define COMP4_CTRL_INMSEL_3  ((uint32_t)0x00000010U)     /* Bit 3 */

#define COMP4_CTRL_INPSEL    ((uint32_t)0x000000E0U)     /* Non inverting input select of Comparator_4 */
#define COMP4_CTRL_INPSEL_0  ((uint32_t)0x00000020U)     /* Bit 0 */
#define COMP4_CTRL_INPSEL_1  ((uint32_t)0x00000040U)     /* Bit 1 */
#define COMP4_CTRL_INPSEL_2  ((uint32_t)0x00000080U)     /* Bit 2 */

#define COMP4_CTRL_OUTSEL    ((uint32_t)0x00000F00U)     /* Output select of Comparator_4 */
#define COMP4_CTRL_OUTSEL_0  ((uint32_t)0x00000100U)     /* Bit 0 */
#define COMP4_CTRL_OUTSEL_1  ((uint32_t)0x00000200U)     /* Bit 1 */ 
#define COMP4_CTRL_OUTSEL_2  ((uint32_t)0x00000400U)     /* Bit 2 */ 
#define COMP4_CTRL_OUTSEL_3  ((uint32_t)0x00000800U)     /* Bit 3 */ 
 
#define COMP4_CTRL_POL       ((uint32_t)0x00001000U)     /* Output polarity select of Comparator_4 */

#define COMP4_CTRL_HYST      ((uint32_t)0x00006000U)     /* Hysteresis level select of Comparator_4 */
#define COMP4_CTRL_HYST_0    ((uint32_t)0x00002000U)     /* Bit 0 */
#define COMP4_CTRL_HYST_1    ((uint32_t)0x00004000U)     /* Bit 1 */

#define COMP4_CTRL_BLKING    ((uint32_t)0x00038000U)     /* Blanking source select of Comparator_4 */
#define COMP4_CTRL_BLKING_0  ((uint32_t)0x00008000U)     /* Bit 0 */
#define COMP4_CTRL_BLKING_1  ((uint32_t)0x00010000U)     /* Bit 1 */
#define COMP4_CTRL_BLKING_2  ((uint32_t)0x00020000U)     /* Bit 2 */

#define COMP4_CTRL_OUT       ((uint32_t)0x00040000U)     /* Output state of Comparator_4 */

#define COMP4_CTRL_FILP_OUT  ((uint32_t)0x00080000U)     /* Output state of Comparator_4 Fiter */

/** COMP4_FILC register **/
#define COMP4_FILC_FILEN     ((uint32_t)0x00000001U)    /* Comparator_4 filter enable */
#define COMP4_FILC_THRESH    ((uint32_t)0x0000003EU)    /* Comparator_4 filter threshold size */
#define COMP4_FILC_SAMPW     ((uint32_t)0x000007C0U)    /* Comparator_4 filter window size */

/** COMP4_FILP register **/
#define COMP4_FILP_CLKPSC    ((uint32_t)0x0000FFFFU)    /* Comparator_4 filter sample clock prescale */

/** COMP_OSEL register **/
#define COMP4_OSEL_CMP4XO    ((uint32_t)0x00000002U)     /* Comparator_4 XOR output */
#define COMP2_OSEL_CMP2XO    ((uint32_t)0x00000001U)     /* Comparator_2 XOR output */

/** COMP_LOCK register **/
#define COMP_LOCK            ((uint32_t)0x000FU)         /* All comparator lock enable */
#define COMP_LOCK_CMP1LK     ((uint32_t)0x0001U)         /* Comparator_1 lock enable */
#define COMP_LOCK_CMP2LK     ((uint32_t)0x0002U)         /* Comparator_2 lock enable */
#define COMP_LOCK_CMP3LK     ((uint32_t)0x0004U)         /* Comparator_3 lock enable */
#define COMP_LOCK_CMP4LK     ((uint32_t)0x0008U)         /* Comparator_4 lock enable */

/** COMP_INTEN register **/
#define COMP_INTEN           ((uint32_t)0x0000000FU)     /* Interrupt enable for all COMP */
#define COMP_INTEN_CMP1IEN   ((uint32_t)0x00000001U)     /* Interrupt enable for COMP1 */
#define COMP_INTEN_CMP2IEN   ((uint32_t)0x00000002U)     /* Interrupt enable for COMP2 */
#define COMP_INTEN_CMP3IEN   ((uint32_t)0x00000004U)     /* Interrupt enable for COMP3 */
#define COMP_INTEN_CMP4IEN   ((uint32_t)0x00000008U)     /* Interrupt enable for COMP4 */

/** COMP_INTSTS register **/
#define COMP_INTSTS          ((uint32_t)0x0000000FU)     /* Interrupt status of all Comparator */
#define COMP_INTSTS_COMP1IS  ((uint32_t)0x00000001U)     /* Interrupt status of Comparator_1 */
#define COMP_INTSTS_COMP2IS  ((uint32_t)0x00000002U)     /* Interrupt status of Comparator_2 */
#define COMP_INTSTS_COMP3IS  ((uint32_t)0x00000004U)     /* Interrupt status of Comparator_3 */
#define COMP_INTSTS_COMP4IS  ((uint32_t)0x00000008U)     /* Interrupt status of Comparator_4 */

/** COMP_VREFSCL register **/
#define COMP_VREFSCL_VV1EN   ((uint32_t)0x00000001U)     /* Low-Power internal dac1 enable */
#define COMP_VREFSCL_VV1TRM  ((uint32_t)0x0000007EU)     /* Low-Power internal dac1 output voltage size */
#define COMP_VREFSCL_VV2EN   ((uint32_t)0x00000080U)     /* Low-Power internal dac2 enable */
#define COMP_VREFSCL_VV2TRM  ((uint32_t)0x00003F00U)     /* Low-Power internal dac2 output voltage size */

