handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** COMP_TIM_OSEN register **/
#define COMP_TIM_EN          ((uint32_t)0x0000000FU)     /* Output to timer for all Comparator */
#define CMP1_TIM_EN          ((uint32_t)0x00000001U)     /* Comparator_1 output to timer enable */
#define CMP2_TIM_EN          ((uint32_t)0x00000002U)     /* Comparator_2 output to timer enable */
#define CMP3_TIM_EN          ((uint32_t)0x00000004U)     /* Comparator_3 output to timer enable */
#define CMP4_TIM_EN          ((uint32_t)0x00000008U)     /* Comparator_4 output to timer enable */



/*** Digital to Analog Converter ***/

/** Bit definition for DAC_CTRL register **/
#define DAC_CTRL_CHEN            ((uint32_t)0x00000001U) /* DAC channel enable */
#define DAC_CTRL_DMAEN           ((uint32_t)0x00000002U) /* DAC channel DMA enable */
#define DAC_CTRL_BEN             ((uint32_t)0x00000004U) /* DAC channel output buffer disable */
#define DAC_CTRL_TEN             ((uint32_t)0x00000008U) /* DAC channel Trigger enable */
#define DAC_CTRL_MASEL           ((uint32_t)0x000000F0U) /* MASEL[3:0] (DAC channel1 Mask/Amplitude selector) */
#define DAC_CTRL_MASEL_0         ((uint32_t)0x00000010U) /* Bit 0 */
#define DAC_CTRL_MASEL_1         ((uint32_t)0x00000020U) /* Bit 1 */
#define DAC_CTRL_MASEL_2         ((uint32_t)0x00000040U) /* Bit 2 */
#define DAC_CTRL_MASEL_3         ((uint32_t)0x00000080U) /* Bit 3 */
#define DAC_CTRL_BDASEL          ((uint32_t)0x00000100U) /* Output buffer drive ability selection */
#define DAC_CTRL_WEN             ((uint32_t)0x00000C00U) /* WEN[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define DAC_CTRL_WEN_0           ((uint32_t)0x00000400U) /* Bit 0 */
#define DAC_CTRL_WEN_1           ((uint32_t)0x00000800U) /* Bit 1 */
#define DAC_CTRL_TSEL            ((uint32_t)0x00007000U) /* TSEL[2:0] (DAC channel1 Trigger selection) */
#define DAC_CTRL_TSEL_0          ((uint32_t)0x00001000U) /* Bit 0 */
#define DAC_CTRL_TSEL_1          ((uint32_t)0x00002000U) /* Bit 1 */
#define DAC_CTRL_TSEL_2          ((uint32_t)0x00004000U) /* Bit 2 */

/** Bit definition for DAC_SOTTR register **/
#define DAC_SOTTR_SWTREN         ((uint8_t)0x01U)        /* DAC channel software trigger */

/** Bit definition for DAC_DATO register **/
#define DAC_DATO_DACCHDO         ((uint16_t)0x0FFFU)     /* DAC channel data output */

/** Bit definition for DAC_DH8RA register **/
#define DAC_DH8RA_DACCHD         ((uint16_t)0x00FFU)     /* DAC channel1 8-bit right-aligned data */

/** Bit definition for DAC_DH12LA register **/
#define DAC_DH12LA_DACCHD        ((uint16_t)0xFFF0U)     /* DAC channel 12-bit left-aligned data */

/** Bit definition for DAC_DH12RA register **/
#define DAC_DH12RA_DACCHD        ((uint16_t)0x0FFFU)     /* DAC channel 12-bit right-aligned data */


/*** TIM ***/

/** Bit definition for TIM_CTRL1 register  **/

#define TIM_CTRL1_CNTEN     ((uint32_t)0x00000001U) /* Counter enable */
#define TIM_CTRL1_DIR       ((uint32_t)0x00000002U) /* Direction */

#define TIM_CTRL1_CAMSEL    ((uint32_t)0x0000000CU) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CTRL1_CAMSEL_0  ((uint32_t)0x00000004U) /* Bit 0 */
#define TIM_CTRL1_CAMSEL_1  ((uint32_t)0x00000008U) /* Bit 1 */

#define TIM_CTRL1_UPRS      ((uint32_t)0x00000010U) /* Update request source */
#define TIM_CTRL1_UPDIS     ((uint32_t)0x00000020U) /* Update disable */

#define TIM_CTRL1_CLKD      ((uint32_t)0x000000C0U) /* CKD[1:0] bits (clock division) */
#define TIM_CTRL1_CLKD_0    ((uint32_t)0x00000040U) /* Bit 0 */
#define TIM_CTRL1_CLKD_1    ((uint32_t)0x00000080U) /* Bit 1 */

#define TIM_CTRL1_ONEPM     ((uint32_t)0x00000100U) /* One pulse mode */
#define TIM_CTRL1_ARPEN     ((uint32_t)0x00000200U) /* Auto-reload preload enable */
#define TIM_CTRL1_LBKPEN    ((uint32_t)0x00000400U) /* LOCKUP as bkp Enable*/
#define TIM_CTRL1_PBKPEN    ((uint32_t)0x00000800U) /* PVD as bkp Enable */
#define TIM_CTRL1_IOMBKPEN  ((uint32_t)0x00001000U) /* Break_in selection from IOM/COMP */
#define TIM_CTRL1_CLRSEL    ((uint32_t)0x00002000U) /* OCxRef selection from ETR/COMP */
#define TIM_CTRL1_COMPBKPEN ((uint32_t)0x00008000U) /* COMP as bkp Enable */
#define TIM_CTRL1_C1SEL     ((uint32_t)0x00010000U) /* Channel 1 selection from IOM/COMP/HSI */
#define TIM_CTRL1_C3SEL     ((uint32_t)0x00040000U) /* Channel 3 selection from IOM/COMP/LSI */
#define TIM_CTRL1_C4SEL     ((uint32_t)0x00080000U) /* Channel 4 selection from IOM/COMP/HSE/128 */

#define TIM_CTRL1_CMODE     ((uint32_t)0x00300000U)  /* In center-aligned mode, channel 4/7/8/9 trigger mode */
#define TIM_CTRL1_CMODE_0   ((uint32_t)0x00100000U)  /* Bit0 */
#define TIM_CTRL1_CMODE_1   ((uint32_t)0x00200000U)  /* Bit1 */

#define TIM_CTRL1_ASMMETRIC ((uint32_t)0x00800000U)  /* Asynmmetric mode enable in center-aligned */

/** Bit definition for TIM_CTRL2 register **/

#define TIM_CTRL2_OI1       ((uint32_t)0x00000001U) /* Output Idle state 1 (OC1 output) */
#define TIM_CTRL2_OI1N      ((uint32_t)0x00000002U) /* Output Idle state 1 (OC1N output) */
#define TIM_CTRL2_OI2       ((uint32_t)0x00000004U) /* Output Idle state 2 (OC2 output) */
#define TIM_CTRL2_OI2N      ((uint32_t)0x00000008U) /* Output Idle state 2 (OC2N output) */
#define TIM_CTRL2_OI3       ((uint32_t)0x00000010U) /* Output Idle state 3 (OC3 output) */
#define TIM_CTRL2_OI3N      ((uint32_t)0x00000020U) /* Output Idle state 3 (OC3N output) */
#define TIM_CTRL2_OI4       ((uint32_t)0x00000040U) /* Output Idle state 4 (OC4 output) */
#define TIM_CTRL2_OI4N      ((uint32_t)0x00000080U) /* Output Idle state 4 (OC4N output) */
#define TIM_CTRL2_OI5       ((uint32_t)0x00000100U) /* Output Idle state 5 (OC5 output) */
#define TIM_CTRL2_OI6       ((uint32_t)0x00000400U) /* Output Idle state 6 (OC6 output) */

#define TIM_CTRL2_MMSEL     ((uint32_t)0x0000f000U) /* MMS[3:0] bits (Master Mode Selection) */
#define TIM_CTRL2_MMSEL_0   ((uint32_t)0x00001000U) /* Bit 0 */
#define TIM_CTRL2_MMSEL_1   ((uint32_t)0x00002000U) /* Bit 1 */
#define TIM_CTRL2_MMSEL_2   ((uint32_t)0x00004000U) /* Bit 2 */
#define TIM_CTRL2_MMSEL_3   ((uint32_t)0x00008000U) /* Bit 3 */

#define TIM_CTRL2_CCUSEL    ((uint32_t)0x00010000U) /* Capture/Compare Control Update Selection */
#define TIM_CTRL2_CCDSEL    ((uint32_t)0x00020000U) /* Capture/Compare DMA Selection */
#define TIM_CTRL2_CCPCTL    ((uint32_t)0x00040000U) /* Capture/Compare Preloaded Control */
#define TIM_CTRL2_TI1SEL    ((uint32_t)0x00080000U) /* TI1 Selection */
#define TIM_CTRL2_TRIG4     ((uint32_t)0x00100000U) /* OC4REF trigger to ADC enable */
#define TIM_CTRL2_TRIG7     ((uint32_t)0x00200000U) /* OC7REF trigger to ADC enable */
#define TIM_CTRL2_TRIG8     ((uint32_t)0x00400000U) /* OC7REF trigger to ADC enable */
#define TIM_CTRL2_TRIG9     ((uint32_t)0x00800000U) /* OC7REF trigger to ADC enable */

