handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for TIM_STS register **/

#define TIM_STS_CC1ITF      ((uint32_t)0x00000001U) /* Capture/Compare 1 interrupt Flag */
#define TIM_STS_CC2ITF      ((uint32_t)0x00000002U) /* Capture/Compare 2 interrupt Flag */
#define TIM_STS_CC3ITF      ((uint32_t)0x00000004U) /* Capture/Compare 3 interrupt Flag */
#define TIM_STS_CC4ITF      ((uint32_t)0x00000008U) /* Capture/Compare 4 interrupt Flag */
#define TIM_STS_CC5ITF      ((uint32_t)0x00000010U) /* Capture/Compare 5 interrupt Flag */
#define TIM_STS_CC6ITF      ((uint32_t)0x00000020U) /* Capture/Compare 6 interrupt Flag */
#define TIM_STS_CC1OCF      ((uint32_t)0x00000100U) /* Capture/Compare 1 Overcapture Flag */
#define TIM_STS_CC2OCF      ((uint32_t)0x00000200U) /* Capture/Compare 2 Overcapture Flag */
#define TIM_STS_CC3OCF      ((uint32_t)0x00000400U) /* Capture/Compare 3 Overcapture Flag */
#define TIM_STS_CC4OCF      ((uint32_t)0x00000800U) /* Capture/Compare 4 Overcapture Flag */
#define TIM_STS_UDITF       ((uint32_t)0x00010000U) /* Update interrupt Flag */
#define TIM_STS_COMITF      ((uint32_t)0x00020000U) /* COM interrupt Flag */
#define TIM_STS_TITF        ((uint32_t)0x00040000U) /* Trigger interrupt Flag */
#define TIM_STS_BITF        ((uint32_t)0x00080000U) /* Break interrupt Flag */

/** Bit definition for TIM_EVTGEN register **/

#define TIM_EVTGEN_CC1GN    ((uint32_t)0x00000001U) /* Capture/Compare 1 Generation */
#define TIM_EVTGEN_CC2GN    ((uint32_t)0x00000002U) /* Capture/Compare 2 Generation */
#define TIM_EVTGEN_CC3GN    ((uint32_t)0x00000004U) /* Capture/Compare 3 Generation */
#define TIM_EVTGEN_CC4GN    ((uint32_t)0x00000008U) /* Capture/Compare 4 Generation */
#define TIM_EVTGEN_UDGN     ((uint32_t)0x00000100U) /* Update Generation */
#define TIM_EVTGEN_CCUDGN   ((uint32_t)0x00000200U) /* Capture/Compare Control Update Generation */
#define TIM_EVTGEN_TGN      ((uint32_t)0x00000400U) /* Trigger Generation */
#define TIM_EVTGEN_BGN      ((uint32_t)0x00000800U) /* Break Generation */

/** Bit definition for TIM_SMCTRL register **/

#define TIM_SMCTRL_TSEL     ((uint32_t)0x00000007U) /* TS[2:0] bits (Trigger selection) */
#define TIM_SMCTRL_TSEL_0   ((uint32_t)0x00000001U) /* Bit 0 */
#define TIM_SMCTRL_TSEL_1   ((uint32_t)0x00000002U) /* Bit 1 */
#define TIM_SMCTRL_TSEL_2   ((uint32_t)0x00000004U) /* Bit 2 */

#define TIM_SMCTRL_SMSEL    ((uint32_t)0x00000070U) /* SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCTRL_SMSEL_0  ((uint32_t)0x00000010U) /* Bit 0 */
#define TIM_SMCTRL_SMSEL_1  ((uint32_t)0x00000020U) /* Bit 1 */
#define TIM_SMCTRL_SMSEL_2  ((uint32_t)0x00000040U) /* Bit 2 */

#define TIM_SMCTRL_EXTPS    ((uint32_t)0x00000300U) /* ETPS[1:0] bits (External trigger prescaler) */
#define TIM_SMCTRL_EXTPS_0  ((uint32_t)0x00000100U) /* Bit 0 */
#define TIM_SMCTRL_EXTPS_1  ((uint32_t)0x00000200U) /* Bit 1 */

#define TIM_SMCTRL_EXCEN    ((uint32_t)0x00000400U) /* External clock enable */
#define TIM_SMCTRL_EXTP     ((uint32_t)0x00000800U) /* External trigger polarity */

#define TIM_SMCTRL_EXTF     ((uint32_t)0x0000F000U) /* ETF[3:0] bits (External trigger filter) */
#define TIM_SMCTRL_EXTF_0   ((uint32_t)0x00001000U) /* Bit 0 */
#define TIM_SMCTRL_EXTF_1   ((uint32_t)0x00002000U) /* Bit 1 */
#define TIM_SMCTRL_EXTF_2   ((uint32_t)0x00004000U) /* Bit 2 */
#define TIM_SMCTRL_EXTF_3   ((uint32_t)0x00008000U) /* Bit 3 */

#define TIM_SMCTRL_MSMD     ((uint32_t)0x00010000U) /* Master/slave mode */

/** Bit definition for TIM_DINTEN register **/

#define TIM_DINTEN_CC1IEN   ((uint32_t)0x00000001U) /* Capture/Compare 1 interrupt enable */
#define TIM_DINTEN_CC2IEN   ((uint32_t)0x00000002U) /* Capture/Compare 2 interrupt enable */
#define TIM_DINTEN_CC3IEN   ((uint32_t)0x00000004U) /* Capture/Compare 3 interrupt enable */
#define TIM_DINTEN_CC4IEN   ((uint32_t)0x00000008U) /* Capture/Compare 4 interrupt enable */
#define TIM_DINTEN_CC1DEN   ((uint32_t)0x00000100U) /* Capture/Compare 1 DMA request enable */
#define TIM_DINTEN_CC2DEN   ((uint32_t)0x00000200U) /* Capture/Compare 2 DMA request enable */
#define TIM_DINTEN_CC3DEN   ((uint32_t)0x00000400U) /* Capture/Compare 3 DMA request enable */
#define TIM_DINTEN_CC4DEN   ((uint32_t)0x00000800U) /* Capture/Compare 4 DMA request enable */
#define TIM_DINTEN_UIEN     ((uint32_t)0x00010000U) /* Update interrupt enable */
#define TIM_DINTEN_TIEN     ((uint32_t)0x00020000U) /* Trigger interrupt enable */
#define TIM_DINTEN_BIEN     ((uint32_t)0x00040000U) /* Break interrupt enable */
#define TIM_DINTEN_UDEN     ((uint32_t)0x00080000U) /* Update DMA request enable */
#define TIM_DINTEN_COMDEN   ((uint32_t)0x00100000U) /* COM DMA request enable */
#define TIM_DINTEN_TDEN     ((uint32_t)0x00200000U) /* Trigger DMA request enable */
#define TIM_DINTEN_COMIEN   ((uint32_t)0x00400000U) /* COM interrupt enable */

/** Bit definition for TIM_CCMOD1 register **/

#define TIM_CCMOD1_CC1SEL       ((uint32_t)0x00000003U) /* CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM_CCMOD1_CC1SEL_0     ((uint32_t)0x00000001U) /* Bit 0 */
#define TIM_CCMOD1_CC1SEL_1     ((uint32_t)0x00000002U) /* Bit 1 */

#define TIM_CCMOD1_OC1PEN       ((uint32_t)0x00000004U) /* Output Compare 1 Preload enable */
#define TIM_CCMOD1_OC1FEN       ((uint32_t)0x00000008U) /* Output Compare 1 Fast enable */
#define TIM_CCMOD1_OC1CEN       ((uint32_t)0x00000010U) /* Output Compare 1Clear Enable */

#define TIM_CCMOD1_OC1MD        ((uint32_t)0x000000E0U) /* OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM_CCMOD1_OC1MD_0      ((uint32_t)0x00000020U) /* Bit 0 */
#define TIM_CCMOD1_OC1MD_1      ((uint32_t)0x00000040U) /* Bit 1 */
#define TIM_CCMOD1_OC1MD_2      ((uint32_t)0x00000080U) /* Bit 2 */

#define TIM_CCMOD1_CC2SEL       ((uint32_t)0x00000300U) /* CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM_CCMOD1_CC2SEL_0     ((uint32_t)0x00000100U) /* Bit 0 */
#define TIM_CCMOD1_CC2SEL_1     ((uint32_t)0x00000200U) /* Bit 1 */

#define TIM_CCMOD1_OC2PEN       ((uint32_t)0x00000400U) /* Output Compare 2 Preload enable */
#define TIM_CCMOD1_OC2FEN       ((uint32_t)0x00000800U) /* Output Compare 2 Fast enable */
#define TIM_CCMOD1_OC2CEN       ((uint32_t)0x00001000U) /* Output Compare 2 Clear Enable */

#define TIM_CCMOD1_OC2MD        ((uint32_t)0x0000E000U) /* OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM_CCMOD1_OC2MD_0      ((uint32_t)0x00002000U) /* Bit 0 */
#define TIM_CCMOD1_OC2MD_1      ((uint32_t)0x00004000U) /* Bit 1 */
#define TIM_CCMOD1_OC2MD_2      ((uint32_t)0x00008000U) /* Bit 2 */


#define TIM_CCMOD1_IC1PSC       ((uint32_t)0x0000000CU) /* IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM_CCMOD1_IC1PSC_0     ((uint32_t)0x00000004U) /* Bit 0 */
#define TIM_CCMOD1_IC1PSC_1     ((uint32_t)0x00000008U) /* Bit 1 */

