handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for IWDG_FREEZE register **/
#define  IWDG_FREEZE_LPFREV ((uint32_t)0x0000FFFFU)  /* Watchdog freeze enable/disable when MCU enter low power mode */


/*** Beeper ***/

/** Bit definition for BEEPER_CTRL register **/
#define BEERPER_CTRL_BEEPEN        ((uint32_t)0x00000001U)  /* Bit[0] */

#define BEEPER_CTRL_FREQ_SEL       ((uint32_t)0x0000007EU)  /* Beeper output frequency selection */
#define BEEPER_CTRL_FREQ_SEL_0     ((uint32_t)0x00000002U)  /* Bit[1] */
#define BEEPER_CTRL_FREQ_SEL_1     ((uint32_t)0x00000004U)  /* Bit[2] */
#define BEEPER_CTRL_FREQ_SEL_2     ((uint32_t)0x00000008U)  /* Bit[3] */
#define BEEPER_CTRL_FREQ_SEL_3     ((uint32_t)0x00000010U)  /* Bit[4] */
#define BEEPER_CTRL_FREQ_SEL_4     ((uint32_t)0x00000020U)  /* Bit[5] */
#define BEEPER_CTRL_FREQ_SEL_5     ((uint32_t)0x00000040U)  /* Bit[6] */

/****       Controller Area Network     ****/
/**** CAN control and status registers ****/
/**  Bit definition for CAN_MCTRL register  ****/
#define CAN_MCTRL_INIRQ                         ((uint16_t)0x0001U) /* Initialization Request */
#define CAN_MCTRL_SLPRQ                         ((uint16_t)0x0002U) /* Sleep Mode Request */
#define CAN_MCTRL_TXFP                          ((uint16_t)0x0004U) /* Transmit DATFIFO Priority */
#define CAN_MCTRL_RFLM                          ((uint16_t)0x0008U) /* Receive DATFIFO Locked Mode */
#define CAN_MCTRL_NART                          ((uint16_t)0x0010U) /* No Automatic Retransmission */
#define CAN_MCTRL_AWKUM                         ((uint16_t)0x0020U) /* Automatic Wakeup Mode */
#define CAN_MCTRL_ABOM                          ((uint16_t)0x0040U) /* Automatic Bus-Off Management */
#define CAN_MCTRL_TTCM                          ((uint16_t)0x0080U) /* Time Triggered Communication Mode */
#define CAN_MCTRL_MRST                          ((uint16_t)0x8000U) /* CAN software master reset */
#define CAN_MCTRL_DBGF                          ((uint32_t)0x00010000U) /* CAN Debug freeze */

/**  Bit definition for CAN_MSTS register  ****/
#define CAN_MSTS_INIAK                          ((uint16_t)0x0001U) /* Initialization Acknowledge */
#define CAN_MSTS_SLPAK                          ((uint16_t)0x0002U) /* Sleep Acknowledge */
#define CAN_MSTS_ERRINT                         ((uint16_t)0x0004U) /* Error Interrupt */
#define CAN_MSTS_WKUINT                         ((uint16_t)0x0008U) /* Wakeup Interrupt */
#define CAN_MSTS_SLAKINT                        ((uint16_t)0x0010U) /* Sleep Acknowledge Interrupt */
#define CAN_MSTS_TXMD                           ((uint16_t)0x0100U) /* Transmit Mode */
#define CAN_MSTS_RXMD                           ((uint16_t)0x0200U) /* Receive Mode */
#define CAN_MSTS_LSMP                           ((uint16_t)0x0400U) /* Last Sample Point */
#define CAN_MSTS_RXS                            ((uint16_t)0x0800U) /* CAN Rx Signal */

/**  Bit definition for CAN_TSTS register  ****/
#define CAN_TSTS_RQCPM0                         ((uint32_t)0x00000001U) /* Request Completed Mailbox0 */
#define CAN_TSTS_TXOKM0                         ((uint32_t)0x00000002U) /* Transmission OK of Mailbox0 */
#define CAN_TSTS_ALSTM0                         ((uint32_t)0x00000004U) /* Arbitration Lost for Mailbox0 */
#define CAN_TSTS_TERRM0                         ((uint32_t)0x00000008U) /* Transmission Error of Mailbox0 */
#define CAN_TSTS_ABRQM0                         ((uint32_t)0x00000080U) /* Abort Request for Mailbox0 */
#define CAN_TSTS_RQCPM1                         ((uint32_t)0x00000100U) /* Request Completed Mailbox1 */
#define CAN_TSTS_TXOKM1                         ((uint32_t)0x00000200U) /* Transmission OK of Mailbox1 */
#define CAN_TSTS_ALSTM1                         ((uint32_t)0x00000400U) /* Arbitration Lost for Mailbox1 */
#define CAN_TSTS_TERRM1                         ((uint32_t)0x00000800U) /* Transmission Error of Mailbox1 */
#define CAN_TSTS_ABRQM1                         ((uint32_t)0x00008000U) /* Abort Request for Mailbox 1 */
#define CAN_TSTS_RQCPM2                         ((uint32_t)0x00010000U) /* Request Completed Mailbox2 */
#define CAN_TSTS_TXOKM2                         ((uint32_t)0x00020000U) /* Transmission OK of Mailbox 2 */
#define CAN_TSTS_ALSTM2                         ((uint32_t)0x00040000U) /* Arbitration Lost for mailbox 2 */
#define CAN_TSTS_TERRM2                         ((uint32_t)0x00080000U) /* Transmission Error of Mailbox 2 */
#define CAN_TSTS_ABRQM2                         ((uint32_t)0x00800000U) /* Abort Request for Mailbox 2 */

#define CAN_TSTS_CODE                           ((uint32_t)0x03000000U) /* Mailbox Code */
#define CAN_TSTS_CODE_0                         ((uint32_t)0x01000000U) /* Bit 0 */
#define CAN_TSTS_CODE_1                         ((uint32_t)0x02000000U) /* Bit 1 */

#define CAN_TSTS_TMEM  ((uint32_t)0x1C000000U) /* TME[2:0] bits */
#define CAN_TSTS_TMEM0 ((uint32_t)0x04000000U) /* Transmit Mailbox 0 Empty */
#define CAN_TSTS_TMEM1 ((uint32_t)0x08000000U) /* Transmit Mailbox 1 Empty */
#define CAN_TSTS_TMEM2 ((uint32_t)0x10000000U) /* Transmit Mailbox 2 Empty */

#define CAN_TSTS_LOWM  ((uint32_t)0xE0000000U) /* LOW[2:0] bits */
#define CAN_TSTS_LOWM0 ((uint32_t)0x20000000U) /* Lowest Priority Flag for Mailbox 0 */
#define CAN_TSTS_LOWM1 ((uint32_t)0x40000000U) /* Lowest Priority Flag for Mailbox 1 */
#define CAN_TSTS_LOWM2 ((uint32_t)0x80000000U) /* Lowest Priority Flag for Mailbox 2 */

/** Bit definition for CAN_RFF0 register **/
#define CAN_RFF0_FFMP0      ((uint8_t)0x03U) /* DATFIFO 0 Message Pending */
#define CAN_RFF0_FFMP0_0    ((uint8_t)0x01U) /* Bit 0 */
#define CAN_RFF0_FFMP0_1    ((uint8_t)0x02U) /* Bit 1 */

#define CAN_RFF0_FFULL0 ((uint8_t)0x08U) /* DATFIFO 0 Full */
#define CAN_RFF0_FFOVR0 ((uint8_t)0x10U) /* DATFIFO 0 Overrun */
#define CAN_RFF0_RFFOM0 ((uint8_t)0x20U) /* Release DATFIFO 0 Output Mailbox */

/** Bit definition for CAN_RFF1 register **/
#define CAN_RFF1_FFMP1      ((uint8_t)0x03U) /* DATFIFO 1 Message Pending */
#define CAN_RFF1_FFMP1_0    ((uint8_t)0x01U) /* Bit 0 */
#define CAN_RFF1_FFMP1_1    ((uint8_t)0x02U) /* Bit 1 */

