handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/** Bit definition for CAN_TMDT2 register **/
#define CAN_TMDT2_DLC  ((uint32_t)0x0000000FU) /* Data Length Code */
#define CAN_TMDT2_TGT  ((uint32_t)0x00000100U) /* Transmit Global Time */
#define CAN_TMDT2_MTIM ((uint32_t)0xFFFF0000U) /* Message Time Stamp */

/** Bit definition for CAN_TMDL2 register **/
#define CAN_TMDL2_DATA0 ((uint32_t)0x000000FFU) /* Data byte 0 */
#define CAN_TMDL2_DATA1 ((uint32_t)0x0000FF00U) /* Data byte 1 */
#define CAN_TMDL2_DATA2 ((uint32_t)0x00FF0000U) /* Data byte 2 */
#define CAN_TMDL2_DATA3 ((uint32_t)0xFF000000U) /* Data byte 3 */

/** Bit definition for CAN_TMDH2 register **/
#define CAN_TMDH2_DATA4 ((uint32_t)0x000000FFU) /* Data byte 4 */
#define CAN_TMDH2_DATA5 ((uint32_t)0x0000FF00U) /* Data byte 5 */
#define CAN_TMDH2_DATA6 ((uint32_t)0x00FF0000U) /* Data byte 6 */
#define CAN_TMDH2_DATA7 ((uint32_t)0xFF000000U) /* Data byte 7 */

/** Bit definition for CAN_RMI0 register **/
#define CAN_RMI0_RTRQ  ((uint32_t)0x00000002U) /* Remote Transmission Request */
#define CAN_RMI0_IDE   ((uint32_t)0x00000004U) /* Identifier Extension */
#define CAN_RMI0_EXTID ((uint32_t)0x001FFFF8U) /* Extended Identifier */
#define CAN_RMI0_STDID ((uint32_t)0xFFE00000U) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_RMDT0 register **/
#define CAN_RMDT0_DLC  ((uint32_t)0x0000000FU) /* Data Length Code */
#define CAN_RMDT0_FMI  ((uint32_t)0x0000FF00U) /* Filter Match Index */
#define CAN_RMDT0_MTIM ((uint32_t)0xFFFF0000U) /* Message Time Stamp */

/** Bit definition for CAN_RMDL0 register **/
#define CAN_RMDL0_DATA0 ((uint32_t)0x000000FFU) /* Data byte 0 */
#define CAN_RMDL0_DATA1 ((uint32_t)0x0000FF00U) /* Data byte 1 */
#define CAN_RMDL0_DATA2 ((uint32_t)0x00FF0000U) /* Data byte 2 */
#define CAN_RMDL0_DATA3 ((uint32_t)0xFF000000U) /* Data byte 3 */

/** Bit definition for CAN_RMDH0 register **/
#define CAN_RMDH0_DATA4 ((uint32_t)0x000000FFU) /* Data byte 4 */
#define CAN_RMDH0_DATA5 ((uint32_t)0x0000FF00U) /* Data byte 5 */
#define CAN_RMDH0_DATA6 ((uint32_t)0x00FF0000U) /* Data byte 6 */
#define CAN_RMDH0_DATA7 ((uint32_t)0xFF000000U) /* Data byte 7 */

/** Bit definition for CAN_RMI1 register **/
#define CAN_RMI1_RTRQ  ((uint32_t)0x00000002U) /* Remote Transmission Request */
#define CAN_RMI1_IDE   ((uint32_t)0x00000004U) /* Identifier Extension */
#define CAN_RMI1_EXTID ((uint32_t)0x001FFFF8U) /* Extended identifier */
#define CAN_RMI1_STDID ((uint32_t)0xFFE00000U) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_RMDT1 register **/
#define CAN_RMDT1_DLC  ((uint32_t)0x0000000FU) /* Data Length Code */
#define CAN_RMDT1_FMI  ((uint32_t)0x0000FF00U) /* Filter Match Index */
#define CAN_RMDT1_MTIM ((uint32_t)0xFFFF0000U) /* Message Time Stamp */

/** Bit definition for CAN_RMDL1 register **/
#define CAN_RMDL1_DATA0 ((uint32_t)0x000000FFU) /* Data byte 0 */
#define CAN_RMDL1_DATA1 ((uint32_t)0x0000FF00U) /* Data byte 1 */
#define CAN_RMDL1_DATA2 ((uint32_t)0x00FF0000U) /* Data byte 2 */
#define CAN_RMDL1_DATA3 ((uint32_t)0xFF000000U) /* Data byte 3 */

/** Bit definition for CAN_RMDH1 register **/
#define CAN_RMDH1_DATA4 ((uint32_t)0x000000FFU) /* Data byte 4 */
#define CAN_RMDH1_DATA5 ((uint32_t)0x0000FF00U) /* Data byte 5 */
#define CAN_RMDH1_DATA6 ((uint32_t)0x00FF0000U) /* Data byte 6 */
#define CAN_RMDH1_DATA7 ((uint32_t)0xFF000000U) /* Data byte 7 */

/*** CAN filter registers ***/
/** Bit definition for CAN_FMC register **/
#define CAN_FMC_FINITM ((uint32_t)0x01U) /* Filter Init Mode */

/**  Bit definition for CAN_FM1 register  ***/
#define CAN_FM1_FB                              ((uint16_t)0x3FFFU) /* Filter Mode */
#define CAN_FM1_FB0                             ((uint16_t)0x0001U) /* Filter Init Mode bit 0 */
#define CAN_FM1_FB1                             ((uint16_t)0x0002U) /* Filter Init Mode bit 1 */
#define CAN_FM1_FB2                             ((uint16_t)0x0004U) /* Filter Init Mode bit 2 */
#define CAN_FM1_FB3                             ((uint16_t)0x0008U) /* Filter Init Mode bit 3 */
#define CAN_FM1_FB4                             ((uint16_t)0x0010U) /* Filter Init Mode bit 4 */
#define CAN_FM1_FB5                             ((uint16_t)0x0020U) /* Filter Init Mode bit 5 */
#define CAN_FM1_FB6                             ((uint16_t)0x0040U) /* Filter Init Mode bit 6 */
#define CAN_FM1_FB7                             ((uint16_t)0x0080U) /* Filter Init Mode bit 7 */
#define CAN_FM1_FB8                             ((uint16_t)0x0100U) /* Filter Init Mode bit 8 */
#define CAN_FM1_FB9                             ((uint16_t)0x0200U) /* Filter Init Mode bit 9 */
#define CAN_FM1_FB10                            ((uint16_t)0x0400U) /* Filter Init Mode bit 10 */
#define CAN_FM1_FB11                            ((uint16_t)0x0800U) /* Filter Init Mode bit 11 */
#define CAN_FM1_FB12                            ((uint16_t)0x1000U) /* Filter Init Mode bit 12 */
#define CAN_FM1_FB13                            ((uint16_t)0x2000U) /* Filter Init Mode bit 13 */

/**  Bit definition for CAN_FS1 register  ***/
#define CAN_FS1_FSC                             ((uint16_t)0x3FFFU) /* Filter Scale Configuration */
#define CAN_FS1_FSC0                            ((uint16_t)0x0001U) /* Filter Scale Configuration bit 0 */
#define CAN_FS1_FSC1                            ((uint16_t)0x0002U) /* Filter Scale Configuration bit 1 */
#define CAN_FS1_FSC2                            ((uint16_t)0x0004U) /* Filter Scale Configuration bit 2 */
#define CAN_FS1_FSC3                            ((uint16_t)0x0008U) /* Filter Scale Configuration bit 3 */
#define CAN_FS1_FSC4                            ((uint16_t)0x0010U) /* Filter Scale Configuration bit 4 */
#define CAN_FS1_FSC5                            ((uint16_t)0x0020U) /* Filter Scale Configuration bit 5 */
#define CAN_FS1_FSC6                            ((uint16_t)0x0040U) /* Filter Scale Configuration bit 6 */
#define CAN_FS1_FSC7                            ((uint16_t)0x0080U) /* Filter Scale Configuration bit 7 */
#define CAN_FS1_FSC8                            ((uint16_t)0x0100U) /* Filter Scale Configuration bit 8 */
#define CAN_FS1_FSC9                            ((uint16_t)0x0200U) /* Filter Scale Configuration bit 9 */
#define CAN_FS1_FSC10                           ((uint16_t)0x0400U) /* Filter Scale Configuration bit 10 */
#define CAN_FS1_FSC11                           ((uint16_t)0x0800U) /* Filter Scale Configuration bit 11 */
#define CAN_FS1_FSC12                           ((uint16_t)0x1000U) /* Filter Scale Configuration bit 12 */
#define CAN_FS1_FSC13                           ((uint16_t)0x2000U) /* Filter Scale Configuration bit 13 */

/**  Bit definition for CAN_FFA1 register  ***/
#define CAN_FFA1_FAF                            ((uint16_t)0x3FFFU) /* Filter DATFIFO Assignment */
#define CAN_FFA1_FAF0                           ((uint16_t)0x0001U) /* Filter DATFIFO Assignment for Filter 0 */
#define CAN_FFA1_FAF1                           ((uint16_t)0x0002U) /* Filter DATFIFO Assignment for Filter 1 */
#define CAN_FFA1_FAF2                           ((uint16_t)0x0004U) /* Filter DATFIFO Assignment for Filter 2 */
#define CAN_FFA1_FAF3                           ((uint16_t)0x0008U) /* Filter DATFIFO Assignment for Filter 3 */
#define CAN_FFA1_FAF4                           ((uint16_t)0x0010U) /* Filter DATFIFO Assignment for Filter 4 */
#define CAN_FFA1_FAF5                           ((uint16_t)0x0020U) /* Filter DATFIFO Assignment for Filter 5 */
#define CAN_FFA1_FAF6                           ((uint16_t)0x0040U) /* Filter DATFIFO Assignment for Filter 6 */
#define CAN_FFA1_FAF7                           ((uint16_t)0x0080U) /* Filter DATFIFO Assignment for Filter 7 */
#define CAN_FFA1_FAF8                           ((uint16_t)0x0100U) /* Filter DATFIFO Assignment for Filter 8 */
#define CAN_FFA1_FAF9                           ((uint16_t)0x0200U) /* Filter DATFIFO Assignment for Filter 9 */
#define CAN_FFA1_FAF10                          ((uint16_t)0x0400U) /* Filter DATFIFO Assignment for Filter 10 */
#define CAN_FFA1_FAF11                          ((uint16_t)0x0800U) /* Filter DATFIFO Assignment for Filter 11 */
#define CAN_FFA1_FAF12                          ((uint16_t)0x1000U) /* Filter DATFIFO Assignment for Filter 12 */
#define CAN_FFA1_FAF13                          ((uint16_t)0x2000U) /* Filter DATFIFO Assignment for Filter 13 */

