handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/**  Bit definition for CAN_F6R1 register  ***/
#define CAN_F6R1_FBC0                           ((uint32_t)0x00000001U) /* Filter bit 0 */
#define CAN_F6R1_FBC1                           ((uint32_t)0x00000002U) /* Filter bit 1 */
#define CAN_F6R1_FBC2                           ((uint32_t)0x00000004U) /* Filter bit 2 */
#define CAN_F6R1_FBC3                           ((uint32_t)0x00000008U) /* Filter bit 3 */
#define CAN_F6R1_FBC4                           ((uint32_t)0x00000010U) /* Filter bit 4 */
#define CAN_F6R1_FBC5                           ((uint32_t)0x00000020U) /* Filter bit 5 */
#define CAN_F6R1_FBC6                           ((uint32_t)0x00000040U) /* Filter bit 6 */
#define CAN_F6R1_FBC7                           ((uint32_t)0x00000080U) /* Filter bit 7 */
#define CAN_F6R1_FBC8                           ((uint32_t)0x00000100U) /* Filter bit 8 */
#define CAN_F6R1_FBC9                           ((uint32_t)0x00000200U) /* Filter bit 9 */
#define CAN_F6R1_FBC10                          ((uint32_t)0x00000400U) /* Filter bit 10 */
#define CAN_F6R1_FBC11                          ((uint32_t)0x00000800U) /* Filter bit 11 */
#define CAN_F6R1_FBC12                          ((uint32_t)0x00001000U) /* Filter bit 12 */
#define CAN_F6R1_FBC13                          ((uint32_t)0x00002000U) /* Filter bit 13 */
#define CAN_F6R1_FBC14                          ((uint32_t)0x00004000U) /* Filter bit 14 */
#define CAN_F6R1_FBC15                          ((uint32_t)0x00008000U) /* Filter bit 15 */
#define CAN_F6R1_FBC16                          ((uint32_t)0x00010000U) /* Filter bit 16 */
#define CAN_F6R1_FBC17                          ((uint32_t)0x00020000U) /* Filter bit 17 */
#define CAN_F6R1_FBC18                          ((uint32_t)0x00040000U) /* Filter bit 18 */
#define CAN_F6R1_FBC19                          ((uint32_t)0x00080000U) /* Filter bit 19 */
#define CAN_F6R1_FBC20                          ((uint32_t)0x00100000U) /* Filter bit 20 */
#define CAN_F6R1_FBC21                          ((uint32_t)0x00200000U) /* Filter bit 21 */
#define CAN_F6R1_FBC22                          ((uint32_t)0x00400000U) /* Filter bit 22 */
#define CAN_F6R1_FBC23                          ((uint32_t)0x00800000U) /* Filter bit 23 */
#define CAN_F6R1_FBC24                          ((uint32_t)0x01000000U) /* Filter bit 24 */
#define CAN_F6R1_FBC25                          ((uint32_t)0x02000000U) /* Filter bit 25 */
#define CAN_F6R1_FBC26                          ((uint32_t)0x04000000U) /* Filter bit 26 */
#define CAN_F6R1_FBC27                          ((uint32_t)0x08000000U) /* Filter bit 27 */
#define CAN_F6R1_FBC28                          ((uint32_t)0x10000000U) /* Filter bit 28 */
#define CAN_F6R1_FBC29                          ((uint32_t)0x20000000U) /* Filter bit 29 */
#define CAN_F6R1_FBC30                          ((uint32_t)0x40000000U) /* Filter bit 30 */
#define CAN_F6R1_FBC31                          ((uint32_t)0x80000000U) /* Filter bit 31 */

/**  Bit definition for CAN_F7R1 register  ***/
#define CAN_F7R1_FBC0                           ((uint32_t)0x00000001U) /* Filter bit 0 */
#define CAN_F7R1_FBC1                           ((uint32_t)0x00000002U) /* Filter bit 1 */
#define CAN_F7R1_FBC2                           ((uint32_t)0x00000004U) /* Filter bit 2 */
#define CAN_F7R1_FBC3                           ((uint32_t)0x00000008U) /* Filter bit 3 */
#define CAN_F7R1_FBC4                           ((uint32_t)0x00000010U) /* Filter bit 4 */
#define CAN_F7R1_FBC5                           ((uint32_t)0x00000020U) /* Filter bit 5 */
#define CAN_F7R1_FBC6                           ((uint32_t)0x00000040U) /* Filter bit 6 */
#define CAN_F7R1_FBC7                           ((uint32_t)0x00000080U) /* Filter bit 7 */
#define CAN_F7R1_FBC8                           ((uint32_t)0x00000100U) /* Filter bit 8 */
#define CAN_F7R1_FBC9                           ((uint32_t)0x00000200U) /* Filter bit 9 */
#define CAN_F7R1_FBC10                          ((uint32_t)0x00000400U) /* Filter bit 10 */
#define CAN_F7R1_FBC11                          ((uint32_t)0x00000800U) /* Filter bit 11 */
#define CAN_F7R1_FBC12                          ((uint32_t)0x00001000U) /* Filter bit 12 */
#define CAN_F7R1_FBC13                          ((uint32_t)0x00002000U) /* Filter bit 13 */
#define CAN_F7R1_FBC14                          ((uint32_t)0x00004000U) /* Filter bit 14 */
#define CAN_F7R1_FBC15                          ((uint32_t)0x00008000U) /* Filter bit 15 */
#define CAN_F7R1_FBC16                          ((uint32_t)0x00010000U) /* Filter bit 16 */
#define CAN_F7R1_FBC17                          ((uint32_t)0x00020000U) /* Filter bit 17 */
#define CAN_F7R1_FBC18                          ((uint32_t)0x00040000U) /* Filter bit 18 */
#define CAN_F7R1_FBC19                          ((uint32_t)0x00080000U) /* Filter bit 19 */
#define CAN_F7R1_FBC20                          ((uint32_t)0x00100000U) /* Filter bit 20 */
#define CAN_F7R1_FBC21                          ((uint32_t)0x00200000U) /* Filter bit 21 */
#define CAN_F7R1_FBC22                          ((uint32_t)0x00400000U) /* Filter bit 22 */
#define CAN_F7R1_FBC23                          ((uint32_t)0x00800000U) /* Filter bit 23 */
#define CAN_F7R1_FBC24                          ((uint32_t)0x01000000U) /* Filter bit 24 */
#define CAN_F7R1_FBC25                          ((uint32_t)0x02000000U) /* Filter bit 25 */
#define CAN_F7R1_FBC26                          ((uint32_t)0x04000000U) /* Filter bit 26 */
#define CAN_F7R1_FBC27                          ((uint32_t)0x08000000U) /* Filter bit 27 */
#define CAN_F7R1_FBC28                          ((uint32_t)0x10000000U) /* Filter bit 28 */
#define CAN_F7R1_FBC29                          ((uint32_t)0x20000000U) /* Filter bit 29 */
#define CAN_F7R1_FBC30                          ((uint32_t)0x40000000U) /* Filter bit 30 */
#define CAN_F7R1_FBC31                          ((uint32_t)0x80000000U) /* Filter bit 31 */

/**  Bit definition for CAN_F8R1 register  ***/
#define CAN_F8R1_FBC0                           ((uint32_t)0x00000001U) /* Filter bit 0 */
#define CAN_F8R1_FBC1                           ((uint32_t)0x00000002U) /* Filter bit 1 */
#define CAN_F8R1_FBC2                           ((uint32_t)0x00000004U) /* Filter bit 2 */
#define CAN_F8R1_FBC3                           ((uint32_t)0x00000008U) /* Filter bit 3 */
#define CAN_F8R1_FBC4                           ((uint32_t)0x00000010U) /* Filter bit 4 */
#define CAN_F8R1_FBC5                           ((uint32_t)0x00000020U) /* Filter bit 5 */
#define CAN_F8R1_FBC6                           ((uint32_t)0x00000040U) /* Filter bit 6 */
#define CAN_F8R1_FBC7                           ((uint32_t)0x00000080U) /* Filter bit 7 */
#define CAN_F8R1_FBC8                           ((uint32_t)0x00000100U) /* Filter bit 8 */
#define CAN_F8R1_FBC9                           ((uint32_t)0x00000200U) /* Filter bit 9 */
#define CAN_F8R1_FBC10                          ((uint32_t)0x00000400U) /* Filter bit 10 */
#define CAN_F8R1_FBC11                          ((uint32_t)0x00000800U) /* Filter bit 11 */
#define CAN_F8R1_FBC12                          ((uint32_t)0x00001000U) /* Filter bit 12 */
#define CAN_F8R1_FBC13                          ((uint32_t)0x00002000U) /* Filter bit 13 */
#define CAN_F8R1_FBC14                          ((uint32_t)0x00004000U) /* Filter bit 14 */
#define CAN_F8R1_FBC15                          ((uint32_t)0x00008000U) /* Filter bit 15 */
#define CAN_F8R1_FBC16                          ((uint32_t)0x00010000U) /* Filter bit 16 */
#define CAN_F8R1_FBC17                          ((uint32_t)0x00020000U) /* Filter bit 17 */
#define CAN_F8R1_FBC18                          ((uint32_t)0x00040000U) /* Filter bit 18 */
#define CAN_F8R1_FBC19                          ((uint32_t)0x00080000U) /* Filter bit 19 */
#define CAN_F8R1_FBC20                          ((uint32_t)0x00100000U) /* Filter bit 20 */
#define CAN_F8R1_FBC21                          ((uint32_t)0x00200000U) /* Filter bit 21 */
#define CAN_F8R1_FBC22                          ((uint32_t)0x00400000U) /* Filter bit 22 */
#define CAN_F8R1_FBC23                          ((uint32_t)0x00800000U) /* Filter bit 23 */
#define CAN_F8R1_FBC24                          ((uint32_t)0x01000000U) /* Filter bit 24 */
#define CAN_F8R1_FBC25                          ((uint32_t)0x02000000U) /* Filter bit 25 */
#define CAN_F8R1_FBC26                          ((uint32_t)0x04000000U) /* Filter bit 26 */
#define CAN_F8R1_FBC27                          ((uint32_t)0x08000000U) /* Filter bit 27 */
#define CAN_F8R1_FBC28                          ((uint32_t)0x10000000U) /* Filter bit 28 */
#define CAN_F8R1_FBC29                          ((uint32_t)0x20000000U) /* Filter bit 29 */
#define CAN_F8R1_FBC30                          ((uint32_t)0x40000000U) /* Filter bit 30 */
#define CAN_F8R1_FBC31                          ((uint32_t)0x80000000U) /* Filter bit 31 */

