handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/**  Bit definition for CAN_F13R2 register  **/
#define CAN_F13R2_FBC0                          ((uint32_t)0x00000001U) /* Filter bit 0 */
#define CAN_F13R2_FBC1                          ((uint32_t)0x00000002U) /* Filter bit 1 */
#define CAN_F13R2_FBC2                          ((uint32_t)0x00000004U) /* Filter bit 2 */
#define CAN_F13R2_FBC3                          ((uint32_t)0x00000008U) /* Filter bit 3 */
#define CAN_F13R2_FBC4                          ((uint32_t)0x00000010U) /* Filter bit 4 */
#define CAN_F13R2_FBC5                          ((uint32_t)0x00000020U) /* Filter bit 5 */
#define CAN_F13R2_FBC6                          ((uint32_t)0x00000040U) /* Filter bit 6 */
#define CAN_F13R2_FBC7                          ((uint32_t)0x00000080U) /* Filter bit 7 */
#define CAN_F13R2_FBC8                          ((uint32_t)0x00000100U) /* Filter bit 8 */
#define CAN_F13R2_FBC9                          ((uint32_t)0x00000200U) /* Filter bit 9 */
#define CAN_F13R2_FBC10                         ((uint32_t)0x00000400U) /* Filter bit 10 */
#define CAN_F13R2_FBC11                         ((uint32_t)0x00000800U) /* Filter bit 11 */
#define CAN_F13R2_FBC12                         ((uint32_t)0x00001000U) /* Filter bit 12 */
#define CAN_F13R2_FBC13                         ((uint32_t)0x00002000U) /* Filter bit 13 */
#define CAN_F13R2_FBC14                         ((uint32_t)0x00004000U) /* Filter bit 14 */
#define CAN_F13R2_FBC15                         ((uint32_t)0x00008000U) /* Filter bit 15 */
#define CAN_F13R2_FBC16                         ((uint32_t)0x00010000U) /* Filter bit 16 */
#define CAN_F13R2_FBC17                         ((uint32_t)0x00020000U) /* Filter bit 17 */
#define CAN_F13R2_FBC18                         ((uint32_t)0x00040000U) /* Filter bit 18 */
#define CAN_F13R2_FBC19                         ((uint32_t)0x00080000U) /* Filter bit 19 */
#define CAN_F13R2_FBC20                         ((uint32_t)0x00100000U) /* Filter bit 20 */
#define CAN_F13R2_FBC21                         ((uint32_t)0x00200000U) /* Filter bit 21 */
#define CAN_F13R2_FBC22                         ((uint32_t)0x00400000U) /* Filter bit 22 */
#define CAN_F13R2_FBC23                         ((uint32_t)0x00800000U) /* Filter bit 23 */
#define CAN_F13R2_FBC24                         ((uint32_t)0x01000000U) /* Filter bit 24 */
#define CAN_F13R2_FBC25                         ((uint32_t)0x02000000U) /* Filter bit 25 */
#define CAN_F13R2_FBC26                         ((uint32_t)0x04000000U) /* Filter bit 26 */
#define CAN_F13R2_FBC27                         ((uint32_t)0x08000000U) /* Filter bit 27 */
#define CAN_F13R2_FBC28                         ((uint32_t)0x10000000U) /* Filter bit 28 */
#define CAN_F13R2_FBC29                         ((uint32_t)0x20000000U) /* Filter bit 29 */
#define CAN_F13R2_FBC30                         ((uint32_t)0x40000000U) /* Filter bit 30 */
#define CAN_F13R2_FBC31                         ((uint32_t)0x80000000U) /* Filter bit 31 */


/*** Serial Peripheral Interface ***/

/** Bit definition for SPI_CTRL1 register **/
#define SPI_CTRL1_BR        ((uint16_t)0x0007U)      /* BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BR0       ((uint16_t)0x0001U)      /* Bit 0 */
#define SPI_CTRL1_BR1       ((uint16_t)0x0002U)      /* Bit 1 */
#define SPI_CTRL1_BR2       ((uint16_t)0x0004U)      /* Bit 2 */
#define SPI_CTRL1_CLKPOL    ((uint16_t)0x0010U)      /* Clock Polarity */
#define SPI_CTRL1_CLKPHA    ((uint16_t)0x0020U)      /* Clock Phase */
#define SPI_CTRL1_MSEL      ((uint16_t)0x0040U)      /* Master Selection */
#define SPI_CTRL1_LSBFF     ((uint16_t)0x0080U)      /* Frame Format */
#define SPI_CTRL1_DATFF     ((uint16_t)0x0100U)      /* Data Frame Format */
#define SPI_CTRL1_CRCNEXT   ((uint16_t)0x0200U)      /* Transmit CRC next */
#define SPI_CTRL1_SSOEN     ((uint16_t)0x0400U)      /* SS Output Enable */
#define SPI_CTRL1_SSEL      ((uint16_t)0x0800U)      /* Internal slave select */
#define SPI_CTRL1_SSMEN     ((uint16_t)0x1000U)      /* Software slave management */
#define SPI_CTRL1_RONLY     ((uint16_t)0x2000U)      /* Receive only */
#define SPI_CTRL1_BIDIROEN  ((uint16_t)0x4000U)      /* Output enable in bidirectional mode */
#define SPI_CTRL1_BIDIRMODE ((uint16_t)0x8000U)      /* Bidirectional data mode enable */

/** Bit definition for SPI_CTRL2 register **/ 
#define SPI_CTRL2_SPIEN     ((uint16_t)0x0001U)      /* SPI Enable */
#define SPI_CTRL2_RDMAEN    ((uint16_t)0x0002U)      /* Rx buffer DMA enable */
#define SPI_CTRL2_TDMAEN    ((uint16_t)0x0004U)      /* Tx buffer DMA enable */
#define SPI_CTRL2_CRCEN     ((uint16_t)0x0008U)      /* Hardware CRC calculation enable */
#define SPI_CTRL2_TEINTEN   ((uint16_t)0x0010U)      /* Tx buffer Empty Interrupt Enable */
#define SPI_CTRL2_RNEINTEN  ((uint16_t)0x0020U)      /* RX buffer Not Empty Interrupt Enable */
#define SPI_CTRL2_ERRINTEN  ((uint16_t)0x0040U)      /* Error Interrupt Enable */
#define SPI_CTRL2_NSSPOL    ((uint16_t)0x0080U)      /* NSS polarity */
#define SPI_CTRL2_CRCSTP    ((uint16_t)0x2000U)      /* CRC stop calculation control */

/** Bit definition for SPI_STS register **/
#define SPI_STS_TE          ((uint16_t)0x0001U)      /* Transmit buffer Empty */
#define SPI_STS_RNE         ((uint16_t)0x0002U)      /* Receive buffer Not Empty */
#define SPI_STS_BUSY        ((uint16_t)0x0004U)      /* Busy flag */
#define SPI_STS_CRCERR      ((uint16_t)0x0008U)      /* CRC fault */
#define SPI_STS_MODERR      ((uint16_t)0x0010U)      /* Mode fault */
#define SPI_STS_OVER        ((uint16_t)0x0020U)      /* Overrun flag */

/** Bit definition for SPI_DAT register **/
#define SPI_DAT_DAT         ((uint16_t)0xFFFFU)      /* Data Register */

/** Bit definition for SPI_CRCTDAT register **/
#define SPI_CRCTDAT_DAT     ((uint16_t)0xFFFFU)      /* The CRC result value to send */

/** Bit definition for SPI_CRCRDAT register **/
#define SPI_CRCRDAT_DAT     ((uint16_t)0xFFFFU)      /* The received CRC result value */

/** Bit definition for SPI_CRCPOLY register **/
#define SPI_CRCPOLY_DAT     ((uint16_t)0xFFFFU)      /* CRC polynomial */

