handsome666-c/ps-g/ps_g1/firmware/CMSIS/device/n32g05x.h
/**  Bit definition for I2C_GFLTRCTRL register  ***/
#define  I2C_GFLTRCTRL_SDADFW   ((uint16_t)0x000FU) /* SDA digital gfilter width selection */
#define  I2C_GFLTRCTRL_SCLDFW   ((uint16_t)0x00F0U) /* SCL digital gfilter width selection */

#define  I2C_GFLTRCTRL_SDAAFW   ((uint16_t)0x0300U) /* SDA analog gfilter width selection */
#define  I2C_GFLTRCTRL_SDAAFW_0 ((uint16_t)0x0100U) /* Bit 0 */
#define  I2C_GFLTRCTRL_SDAAFW_1 ((uint16_t)0x0200U) /* Bit 1 */

#define  I2C_GFLTRCTRL_SDAAFENN ((uint16_t)0x0800U) /* SDA analog gfilter enable */

#define  I2C_GFLTRCTRL_SCLAFW   ((uint16_t)0x3000U) /* SCL analog gfilter width selection */
#define  I2C_GFLTRCTRL_SCLAFW_0 ((uint16_t)0x1000U) /* Bit 0 */
#define  I2C_GFLTRCTRL_SCLAFW_1 ((uint16_t)0x2000U) /* Bit 1 */

#define  I2C_GFLTRCTRL_SCLAFENN ((uint16_t)0x8000U) /* SCL analog gfilter enable */


/*** Universal Asynchronous Receiver Transmitter ***/

/** Bit definition for UART_CTRL1 register **/
#define UART_CTRL1_UEN      ((uint32_t)0x00000001U) /* UART Enable */
#define UART_CTRL1_RXEN     ((uint32_t)0x00000002U) /* Receiver Enable */
#define UART_CTRL1_TXEN     ((uint32_t)0x00000004U) /* Transmitter Enable */
#define UART_CTRL1_PSEL     ((uint32_t)0x00000008U) /* Parity Selection */
#define UART_CTRL1_PCEN     ((uint32_t)0x00000010U) /* Parity Control Enable */
#define UART_CTRL1_WL       ((uint32_t)0x00000020U) /* Word length */
#define UART_CTRL1_RCVWU    ((uint32_t)0x00000040U) /* Receiver wakeup */
#define UART_CTRL1_WUM      ((uint32_t)0x00000080U) /* Wakeup method */
#define UART_CTRL1_IDLEIEN  ((uint32_t)0x00000100U) /* IDLE Interrupt Enable */
#define UART_CTRL1_RXDNEIEN ((uint32_t)0x00000200U) /* RXNE Interrupt Enable */
#define UART_CTRL1_TXDEIEN  ((uint32_t)0x00000400U) /* TXE Interrupt Enable */
#define UART_CTRL1_TXCIEN   ((uint32_t)0x00000800U) /* Transmission Complete Interrupt Enable */
#define UART_CTRL1_PEIEN    ((uint32_t)0x00001000U) /* PE Interrupt Enable */
#define UART_CTRL1_SDBRK    ((uint32_t)0x00002000U) /* Send Break */

/** Bit definition for UART_CTRL2 register **/
#define UART_CTRL2_ADDR     ((uint32_t)0x0000000FU) /* Address of the UART node */
#define UART_CTRL2_STPB     ((uint32_t)0x00000060U) /* STOP[1:0] bits (STOP bits) */
#define UART_CTRL2_STPB_0   ((uint32_t)0x00000020U) /* Bit 0 */
#define UART_CTRL2_STPB_1   ((uint32_t)0x00000040U) /* Bit 1 */

#define UART_CTRL2_LINMEN   ((uint32_t)0x00001000U) /* LIN mode enable */
#define UART_CTRL2_LINBDIEN ((uint32_t)0x00002000U) /* LIN Break Detection Interrupt Enable */
#define UART_CTRL2_LINBDL   ((uint32_t)0x00004000U) /* LIN Break Detection Length */

/** Bit definition for UART_CTRL3 register **/
#define UART_CTRL3_HDMEN    ((uint32_t)0x00000008U) /* Half-Duplex Selection */
#define UART_CTRL3_DMATXEN  ((uint32_t)0x00000010U) /* DMA Enable Transmitter */
#define UART_CTRL3_DMARXEN  ((uint32_t)0x00000020U) /* DMA Enable Receiver */
#define UART_CTRL3_ERRIEN   ((uint32_t)0x00000040U) /* Error Interrupt Enable */
#define UART_CTRL3_IRDAMEN  ((uint32_t)0x00000080U) /* IrDA mode Enable */
#define UART_CTRL3_IRDALP   ((uint32_t)0x00000100U) /* IrDA Low-Power */

/** Bit definition for UART_STS register **/
#define UART_STS_IDLEF      ((uint32_t)0x00000040U) /* IDLE line detected */
#define UART_STS_TXDE       ((uint32_t)0x00000080U) /* Transmit Data Register Empty */
#define UART_STS_TXC        ((uint32_t)0x00000100U) /* Transmission Complete */
#define UART_STS_RXDNE      ((uint32_t)0x00000200U) /* Read Data Register Not Empty */
#define UART_STS_LINBDF     ((uint32_t)0x00000800U) /* LIN Break Detection Flag */
#define UART_STS_PEF        ((uint32_t)0x00001000U) /* Parity Error */
#define UART_STS_OREF       ((uint32_t)0x00002000U) /* OverRun Error */
#define UART_STS_NEF        ((uint32_t)0x00004000U) /* Noise Error Flag */
#define UART_STS_FEF        ((uint32_t)0x00008000U) /* Framing Error */

/** Bit definition for UART_DAT register **/
#define UART_DAT_DATV       ((uint32_t)0x000001FFU) /* Data value */

/** Bit definition for UART_BRCF register **/
#define UART_BRCF_DIVD      ((uint32_t)0x0000000FU) /* Decimal of UARTDIV */
#define UART_BRCF_DIVI      ((uint32_t)0x0000FFF0U) /* Integer of UARTDIV */

/** Bit definition for UART_GTP register **/
#define UART_GTP_PSCV       ((uint32_t)0x000000FFU) /* Prescaler value  */

/*** FLASH Registers ***/

/**  Bit definition for FLASH_AC register  **/
#define  FLASH_AC_LATENCY                   ((uint8_t)0x03U)               /* LATENCY[1:0] bits (Latency) */
#define  FLASH_AC_LATENCY_0                 ((uint8_t)0x00U)               /* Bit 0 = 0 */
#define  FLASH_AC_LATENCY_1                 ((uint8_t)0x01U)               /* Bit 0 = 1 */
#define  FLASH_AC_LATENCY_2                 ((uint8_t)0x02U)               /* Bit 1 = 1 */

#define  FLASH_AC_PRFTBFEN                  ((uint8_t)0x10U)               /* Prefetch Buffer Enable */
#define  FLASH_AC_PRFTBFSTS                 ((uint8_t)0x20U)               /* Prefetch Buffer Status */

/**  Bit definition for FLASH_KEY register  **/
#define  FLASH_KEY_FKEY                    ((uint32_t)0xFFFFFFFFU)        /* FLASH Key */

/**  Bit definition for FLASH_OPTKEY register  **/
#define  FLASH_OPTKEY_OPTKEY              ((uint32_t)0xFFFFFFFFU)         /* Option Byte Key */

/**  Bit definition for FLASH_STS register  **/
#define  FLASH_STS_BUSY                       ((uint16_t)0x0001U)               /* Busy */
#define  FLASH_STS_PGERR                      ((uint16_t)0x0004U)               /* Programming Error */
#define  FLASH_STS_WRPERR                     ((uint16_t)0x0010U)               /* Write Protection Error */
#define  FLASH_STS_EOP                        ((uint16_t)0x0020U)               /* End of operation */
#define  FLASH_STS_ECCERR                     ((uint16_t)0x0080U)               /* ECC Error */

/**  Bit definition for FLASH_CTRL register  **/
#define  FLASH_CTRL_PG                         ((uint16_t)0x0001U)            /* Programming */
#define  FLASH_CTRL_PER                        ((uint16_t)0x0002U)            /* Page Erase */
#define  FLASH_CTRL_MER                        ((uint16_t)0x0004U)            /* Mass Erase */
#define  FLASH_CTRL_OPTPG                      ((uint16_t)0x0010U)            /* Option Byte Programming */
#define  FLASH_CTRL_OPTER                      ((uint16_t)0x0020U)            /* Option Byte Erase */
#define  FLASH_CTRL_START                      ((uint16_t)0x0040U)            /* Start */
#define  FLASH_CTRL_LOCK                       ((uint16_t)0x0080U)            /* Lock */
#define  FLASH_CTRL_OPTWE                      ((uint16_t)0x0200U)            /* Option Bytes Write Enable */
#define  FLASH_CTRL_ERRITE                     ((uint16_t)0x0400U)            /* Error Interrupt Enable */
#define  FLASH_CTRL_EOPITE                     ((uint16_t)0x1000U)            /* End of operation interrupt enable */
#define  FLASH_CTRL_ECERRITE                   ((uint16_t)0x2000U)            /* ECC Error interrupt enable */

/**  Bit definition for FLASH_ADD register  **/
#define  FLASH_ADD_FADD                        ((uint32_t)0xFFFFFFFFU)        /* Flash Address */

/**  Bit definition for FLASH_OB register  **/
#define  FLASH_OB_OBERR                        ((uint16_t)0x0001U)            /* Option Byte Error */
#define  FLASH_OB_RDPRT1                       ((uint16_t)0x0002U)            /* Read protection */

#define  FLASH_OB_USER                         ((uint16_t)0x01FCU)            /* User Option Bytes */
#define  FLASH_OB_IWDG_SW                      ((uint16_t)0x0004U)            /* IWDG_SW */
#define  FLASH_OB_nRST_STOP                    ((uint16_t)0x0008U)            /* nRST_STOP */
#define  FLASH_OB_nRST_PD                      ((uint16_t)0x0010U)            /* nRST_STDBY */

#define  FLASH_OB_nBOOT0                       ((uint16_t)0x0020U)            /* nBOOT0 */
#define  FLASH_OB_nBOOT1                       ((uint16_t)0x0040U)            /* nBOOT1 */
#define  FLASH_OB_nSWBOOT0                     ((uint16_t)0x0080U)            /* nSWBOOT0 */

#define  FLASH_OB_BOOT0_CFG                    ((uint16_t)0x0100U)            /* BOOT0_CFG */

#define FLASH_OB_DATA0                          ((uint32_t)0x0003FC00U) /* Data0[7:0]  */
#define FLASH_OB_DATA0_0                        ((uint32_t)0x00000400U) /* bit 0 */ 
#define FLASH_OB_DATA0_1                        ((uint32_t)0x00000800U) /* bit 1 */
#define FLASH_OB_DATA0_2                        ((uint32_t)0x00001000U) /* bit 2 */
#define FLASH_OB_DATA0_3                        ((uint32_t)0x00002000U) /* bit 3 */
#define FLASH_OB_DATA0_4                        ((uint32_t)0x00004000U) /* bit 4 */
#define FLASH_OB_DATA0_5                        ((uint32_t)0x00008000U) /* bit 5 */
#define FLASH_OB_DATA0_6                        ((uint32_t)0x00010000U) /* bit 6 */
#define FLASH_OB_DATA0_7                        ((uint32_t)0x00020000U) /* bit 7 */

#define FLASH_OB_DATA1                          ((uint32_t)0x03FC0000U) /* Data1[7:0] */
#define FLASH_OB_DATA1_0                        ((uint32_t)0x00040000U) /* bit 0 */ 
#define FLASH_OB_DATA1_1                        ((uint32_t)0x00080000U) /* bit 1 */
#define FLASH_OB_DATA1_2                        ((uint32_t)0x00100000U) /* bit 2 */
#define FLASH_OB_DATA1_3                        ((uint32_t)0x00200000U) /* bit 3 */
#define FLASH_OB_DATA1_4                        ((uint32_t)0x00400000U) /* bit 4 */
#define FLASH_OB_DATA1_5                        ((uint32_t)0x00800000U) /* bit 5 */
#define FLASH_OB_DATA1_6                        ((uint32_t)0x01000000U) /* bit 6 */
#define FLASH_OB_DATA1_7                        ((uint32_t)0x02000000U) /* bit 7 */

#define  FLASH_OB_BOOT_SEL                      ((uint32_t)0x0C000000U)        /* boot pin select */
#define  FLASH_OB_RDPRT2                        ((uint32_t)0x80000000U)        /* Read protection level 2 */

/** Bit definition for FLASH_WRP register **/
#define FLASH_WRP_WRPT                          ((uint32_t)0xFFFFFFFFU) /* Write Protect */
#define FLASH_WRP_WRPT_0                        ((uint32_t)0x00000001U) /* bit 0  */
#define FLASH_WRP_WRPT_1                        ((uint32_t)0x00000002U) /* bit 1  */
#define FLASH_WRP_WRPT_2                        ((uint32_t)0x00000004U) /* bit 2  */
#define FLASH_WRP_WRPT_3                        ((uint32_t)0x00000008U) /* bit 3  */
#define FLASH_WRP_WRPT_4                        ((uint32_t)0x00000010U) /* bit 4  */
#define FLASH_WRP_WRPT_5                        ((uint32_t)0x00000020U) /* bit 5  */
#define FLASH_WRP_WRPT_6                        ((uint32_t)0x00000040U) /* bit 6  */
#define FLASH_WRP_WRPT_7                        ((uint32_t)0x00000080U) /* bit 7  */
#define FLASH_WRP_WRPT_8                        ((uint32_t)0x00000100U) /* bit 8  */
#define FLASH_WRP_WRPT_9                        ((uint32_t)0x00000200U) /* bit 9  */
#define FLASH_WRP_WRPT_10                       ((uint32_t)0x00000400U) /* bit 10 */
#define FLASH_WRP_WRPT_11                       ((uint32_t)0x00000800U) /* bit 11 */
#define FLASH_WRP_WRPT_12                       ((uint32_t)0x00001000U) /* bit 12 */
#define FLASH_WRP_WRPT_13                       ((uint32_t)0x00002000U) /* bit 13 */
#define FLASH_WRP_WRPT_14                       ((uint32_t)0x00004000U) /* bit 14 */
#define FLASH_WRP_WRPT_15                       ((uint32_t)0x00008000U) /* bit 15 */
#define FLASH_WRP_WRPT_16                       ((uint32_t)0x00010000U) /* bit 16 */
#define FLASH_WRP_WRPT_17                       ((uint32_t)0x00020000U) /* bit 17 */
#define FLASH_WRP_WRPT_18                       ((uint32_t)0x00040000U) /* bit 18 */
#define FLASH_WRP_WRPT_19                       ((uint32_t)0x00080000U) /* bit 19 */
#define FLASH_WRP_WRPT_20                       ((uint32_t)0x00100000U) /* bit 20 */
#define FLASH_WRP_WRPT_21                       ((uint32_t)0x00200000U) /* bit 21 */
#define FLASH_WRP_WRPT_22                       ((uint32_t)0x00400000U) /* bit 22 */
#define FLASH_WRP_WRPT_23                       ((uint32_t)0x00800000U) /* bit 23 */
#define FLASH_WRP_WRPT_24                       ((uint32_t)0x01000000U) /* bit 24 */
#define FLASH_WRP_WRPT_25                       ((uint32_t)0x02000000U) /* bit 25 */
#define FLASH_WRP_WRPT_26                       ((uint32_t)0x04000000U) /* bit 26 */
#define FLASH_WRP_WRPT_27                       ((uint32_t)0x08000000U) /* bit 27 */
#define FLASH_WRP_WRPT_28                       ((uint32_t)0x10000000U) /* bit 28 */
#define FLASH_WRP_WRPT_29                       ((uint32_t)0x20000000U) /* bit 29 */
#define FLASH_WRP_WRPT_30                       ((uint32_t)0x40000000U) /* bit 30 */
#define FLASH_WRP_WRPT_31                       ((uint32_t)0x80000000U) /* bit 31 */

/** Bit definition for FLASH_ECC register **/
#define FLASH_WRP_ECCLW                      ((uint32_t)0x000000FFU)        /* ecc result of low word data[31:0] in flash */

/**  Bit definition for FLASH_USER register  **/
#define  FLASH_USER_LVRLS                   ((uint32_t)0x0000000FU)       /* LVR gear selection */
#define  FLASH_USER_LVREN                   ((uint32_t)0x00000010U)       /* LVR enable */
#define  FLASH_USER_LVRRST                  ((uint32_t)0x00000020U)       /* LVR reset enable control */
#define  FLASH_USER_LVRFILEN                ((uint32_t)0x00000040U)       /* LVR filter enable */
#define  FLASH_USER_LVRCNT                  ((uint32_t)0x0000FF00U)       /* LVR filter control count value */
#define  FLASH_USER_POR_DELAY               ((uint32_t)0x00FF0000U)       /* Delay time of CPU reset after POR is triggered */

/**  Bit definition for FLASH_START_ADD register  **/
#define  FLASH_START_ADD_MASK               ((uint32_t)0x000000FFU)       /* FLASH boot address mask */

/**  Bit definition for FLASH_VTOR register  **/
#define  FLASH_VTOR_EN                      ((uint32_t)0x80000000U)       /* VTOR enalbe */
#define  FLASH_VTOR_VALUE                   ((uint32_t)0x7FFFFFFFU)       /* VTOR address value */


